/* automatically generated by rust-bindgen 0.57.0 */

#![allow(clippy::all)]
#![allow(
    non_upper_case_globals,
    non_camel_case_types,
    non_snake_case,
    clashing_extern_declarations
)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {

pub const ZEND_LOGO_DATA_URI : & 'static [u8 ; 6083usize] = b"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAPoAAAAvCAYAAADKH9ehAAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAEWJJREFUeNrsXQl0VNUZvjNJSAgEAxHCGsNitSBFxB1l0boUW1pp3VAUrKLWKgUPUlEB13K0Yq1alaXWuh5EadWK1F0s1gJaoaCgQDRKBBJDVhKSzPR+zPfg5vLevCUzmZnwvnP+k8ybN3fevfff73/vBAJTHxc+khL5kr6T1ODk5nAgTRTWloghFVtEg/zfh2PkSvq9pJGSKiX9SdKittbJoD/PSYkrJD0vKeB4IsNNotfuUtHk/CM+IvijpF9KGiDpGEkLJZ3lC7qPeKKTpD9IWiDpUOfWPCi61ZeLvD2VIhTwp9QlTjK5NsIXdB/xxHmSpvD/OucWPSAyQw2+LfeG1SbXVra1Tqb785xUaNdMel0g7Iu5V1zPv6dJqpD0kKR/+ILuI55o8oeg1bFT0kWSOkraQxK+oPvw0TZR3ZY758foyQXf//ZxUFh0Q/GEfNf9gHkaJ6m7pHJJSyTt9tnXhxtBR2EGlnHCMbZMaHuHzX19JZ0u6VRJh0k6hM+BpMjnklZIelPSNhff3V5StkNlEWBMFm+3LcC+BW3GuZP2GvfmiEiCCMUzxZIKRGSt9zeML/fdGAW9JB3O8c6SlMZ+b5f0qaQiF7EpnieXY1auvZfG7zhSUk8RSS428F7M5xfsh1eAV/vxOzoq16sklZBqbdpo5H2qDPRQXoP3Ki0+20FSFyrZUgt+Rt/7KH2vZb8/t/iMG2Sy/0dI6sbvgHGoV8a3xErQb5Q0iTfHCplkzlkW7w+VNF3ST7QJUzFK0pVkDFiw+yV95uC7r5Z0k3CW2ApwIkrJ9B9IelfSh2SIlqC/pDFUZAVk0rQoMhk2GYswx+AtWvMKPtcyEckW37pPwsIHNAuBniDpYhEpBMmJwvibJL0gIlVh39r0C8UlczkXQ/mM6OtEzuf3RfPVAxUY47f5PStcGKPxpOMldbbxiBptPMavJX1PuQ/P/olyz12S7rD4PLyqBTQ8gyXVSOot6VK+dxR53wyl7POjkv7pkpcwpleJSCHP4eQjM0BB/ZuG4Hl9EO8mQx4ZQ0FfL+k+k+t4wNlULpkO24IGnSzpQklzKPDRAMvZ1eXz9uXfH/Pvx5Ie44C5zYQXUgDPj6LEnMCQ3AFkjjupjGF9/kJmxPw1oiquz+6dalXcCRSmYxwK0kDSRI71azb3Y+6GiMi6P/5ey3F3YpExjxdQoG61uX8gBetkh2OWFkUIVGUT1pS9yosZNu1nkl8uZH+mikhxkx1wz7mkB0WkXsKJFw1ZuSWKotY9wjNJS6mUy41JK5P0c2qCnBgIeQWZvEK7Dnf6WUljTT5TS7d0KwezkJShdWIeGeuKKJo7FktUQylcl0i6RtL/HH4OjP+wB0UTLTGHfubRDWyi1g7SaoZQ495z9w7RpaHKqHEfLeklEyWzk+7dl3TTu1KQCpV7+pBB4IWstFFAgvOpJnTL6DoW0xPbw3k/nIYkW+kbmHeXhUEABklazrBDBdzTDfyuBo5DPq1eoUk7ZbSk70l6n3MZjUdCDpQvMF/rezn7/hX7Xs8wsj/7rsrWdQxnZtrwwENUosJkDDZxTjOUkEH1ds6lzJyDZzGScRsonGNcMCIG+WgRKTRQ8Su2p7uRi/mlKjZKekREChS2KIOcTvfqp3RZDlM+cxnfv8Thc75Pt8kqo92VzNTbxBqcQlceivAdByHDIxbvFTMOLovyHAGGK3qc/jJDoDc4hpjABzBm4UAglBFqEAOqt8mB29ss4uJnNCHfSK/tVZMYEfMykt7Bcco1eDLDHCT8gmzzRdLHZL6wRSgzg6GIgVl8Xj2uhPA+oQn53yTdK2mVMC8NzuJ8zaSyM/ApxyzWCFJRvUQ3eQ29BTNFcRgt+FTl2g30zDZZtD/ZRMifE5ES6Y9MxqAHQ7XZikI9nd97j5p1f83GZTPr6Crt2sOcOB1zTYT8HrqjVRZx4wbSAt47SXn/YsZV9zp4zuvJgNGQRaszmoN1rBY6IH4dHiVHcA5dZd2zeIbPv8ZBkghYTQFTx/h1WvSz6c3kM5ewGG8Prvxc5DZWS2u+dypnM5Y3sIJMXmbxfXW0misZN56oxITnWsyl2fg+6+C+zWTefMWr68RwaYF271htHBZqCsKqL28wB/ACjYShrE9nUjfWmEU33A7woqbR4k5UlNk4yoYOzOHvtGs30KO1QgnlZC2VohGOIGn7WEvW0ZdoMeCHfBgdo8X++m3V+s2wEHKzJMblJom92+ne2SHDwT1gknUispPpJLrrVZqwLxTmy5F5jOdVS72F/b6UwlbrcEytrD00+a8l/ZUM82jEZd8peu8uNYS8JxNWqis5IYqQCy1rPUULh8Y7fOYal3zzmPb6aJN7zlf+32bBV9ESclNE85WUX4j4oNbl/fM1b2eoxX3jyXNqiDTP4Xe8Rm9ItfSjvAr6DM0d+o5MXW/CuHO0a7eZTLYT3KF9LktYZ/WdCI+IkoV+lFZ6l3J9OF14HdM0F3MrhXxFjJmqhh5FBera24XqxaCqL0UosK97Z2ku+yJaEqf4D62ByoROcjZuN78Xaa9zTBSzKvxvC+vlrmgWVPU2h4j4FCO5lZ+vNBnpYHHfOOX/PfR83eApTaGM8CLop5l88WSLWAOu4AiNme5owcBO1xhlLGO/eGAFkyYqrtFe5zKzqU7KBE5o/BAIiv7VJSK7qV4GhEF1XtSk0YseWl6lWYI+cXj6pigJLkH3Vk0qfebxe4q0JGOGSDxCWn/Nchk9qJgMfGKS87LDes1IHeVW0LszgaC6sPMYE5lBt4CzRcuy4lVMLKlWfWwcJ+YpxtcGjtOYfzRjTgNIlv0rnpyCveeHNFSJ/jUlonH/3nNYqyOU28qYhHOLbzVPqFc81JQDKxnQ5twLdmjfmQzlxU6eoZ/mma3y8D3VonlhUr6bElhMwJ81RseSxW+jfOYULdYGAw5s4WBtpeU0ijKwxnp/HCfn70piCNlMFEUU8/WpmnZe1Bq80r96m5yMkIwx9nnNHTWFs114q0ArM1HsiUY7j5/rKFIThdrrzR7agHyoy9vd3Ag64uEfKa+xjIKlLqtTUBB7FWgJrQ9joFl1d2cQ2wzHaeDXa6/ztO9Wx+OT+FrzSAKuV12ptOZp+ljnaVawk8uxDpnMZXYCGB3PXqe5sl7QQ5ubhhQR9B4mQpvjIR+gJgrbOxV0rK/rVUyXmyRWdI2a2YLEhVP3BwmN9sJ9BtQpKkxiSDOrUeUhaeQaPevKzKQ3oIVTSGatcynoRl29sIkh440a8pURNoz00Ab4Ts1obxCps1FKl8k5IpKbcmsgu6nz6ETQC+iSqoKKOPmVJBmYnDjHX4EozB9s7TgwykkyYS13URAHpmstYIloOP/HEi6Wx5a4+DwSpH2V18tTyHUPm3iQeS1s09ai4/0ntVgNRQmzHTRulGwaQNnei3FgHqPcMBEJlXrNioAaE8AcupKBd7ElBu1uTxCzg+dmKB4TahiQNX/OxssAb00Uzdeci4S3FYhEQdfkWCrc1cI2K+2EDhsP1OUxZGUnOWTmcgphV0UgZ4jUR1hLlBiuJfqJpb61CXimOrq8RqiEeu6TU3iMwdzYgWhUnWHDDKr0ptLar6USqmOfYYiGMMTUN/KgziGVTo+pNJHBBfF0zVAQc6N2DUL+tcO2Yc1Rk2ss+yBmOko43yCSCljJXAWA7PD4eAt6MBy2yiNACRvVVN05t40pPLYPsT+zlRDpOLG/Jt8OSGKhmnBpivV7q/Y6JkucVgkyWKb52rVZwl0tvNDi+AzRvKjfK1Dnjvpd1FhPEc1LBVsbqENXN35cFaPY2BIVGdlWYZKqgPPj/RythNtpcNycpoOxwAae0bGwhAkAQg01cfiDWDRqZtHhCqFQ5FAtOXKXh/Yh6Ci2N5YMUDW2SHg/N3scn02N++cnMIZCBdwS9gtApRxqDc6OlzWtSrdc8cJGlzP5fzZDri1tQNixISWL/5fSQvcVzfe/wzXfSG8Kuw03pHB/t5KMik+EYJ1EC1d0zCw6fofqRI2ZJwpvyxN4uPs0q/6UR2szyESobxatf3aa7jvfrT0DGPNpYV3H3CI0BYLGllQdy7TX14rUP/zzDHpuRp0EPLnJvH68Qij/RXnyIyku5Ea+5S3NO7s01q77eMY1qqY8T7Qs+4qtq+o2UWhjZO6HuWhjJBlZXWbAHvbFSTAxqMW+RbuG3VfviAP36tshujINh6Tr3kE0BNMl5x8Qq6+mVTdwrMlzpRrGaGPzVpw9NDNFngjoFZZzRCS/FRPXHRZT31X2MgfYTQYX1WE1moaaQJfKEFTs/camkXnUwt9YtNWPiuc67VmRlb0yiRgS/cAe7is0QXuTAm9kikM2DNc5OkeGRaMU8tq0TJHbUCOtezMeRfITiSv1PLLbGE5gb/NOB/1AuR1KlLETDltidyR4XIPasyEnc6eIbRa9kfNifFeXJOAnVJBiKfFCvobcLKccLHWojHJpIPH3iXQlpoNLrdcH44sucvmQOHHjZ9rDrGdbixVmbk/XGy4mtiKuoQDjmQpFJLs6wuSZvqKmL0ky6zOZLry+420UKUaue5ooyeqy9+iopgM989cp1Dcp16bSU1tOJbyFyjedTID5wOk6OAUFFXUDKFRLkmBM3xH7fzIJwPLsxexDMWP2b8g38DqN45ywCuH0VNuv+XmjwOYCjtUakbg6AkGlNoQGBMB5A9g8hh2g7zFE2U4F35FxfHfmwwbxcz3Yl32C/oAwPwDAS6UXdpOhXPZ27Trc9R/SLTla0zzGoXl2QAexnLVZJB/CZMpV7HthfL4lJIrb54u+tdv3/rCiSbw+k88yM9ZxXgKwlHmZycq13iSr0KeMHmUZw6r1VICrLT4D5fy4wq/5DAvfjaWC9oAd9KxwTNUJynUjL+EqpwSTME1zOWMBuIxmZ7p9RCsNq+NmdxW09I1MdNkJeYZNHsIt0qKEO2Z4kvmHadS+Xqv2cqzc93rpuhdl54tg2DISuJljBW3uZjMHrAPqHOYK6zPIM23G2+14Rts4cyLbdxo3Y667UskOo/W/m/PwRhQBwZFkT2vXzDbTtLMZCyfP1155bbfDrpjKZoYH41bO+d97jmEgMPVxFMF0iHESIkiNtDhKuwV058cw0dBZNP+lFsSU/6VWf0E4P/x+IF2eJnokr4uW/2jAKPYjjRb7Cxef70c3qsCl0im1Gj/Uu2eF6sWo0rUiTQq7zS+pYjywnXYwcyOZfI4mKgHj9N2ttHqbRfSlQXhjw5XXy4S7ZbzOovkxVRsphHp8ia3HlyleZS1zHcvoVrdjuNFdEe7edGHzSbpSria/WZ3+cxYV5DCx/4w7FUfyfTW0WO+i7x2YrzKUXZFw/sut+OxJDGkHUxEZPwgCquQcIgxZR9oXekDQk8FF60bqwocupaIoEz6EmaC3C+0Ro6Wgp4eb2tpPJqN+4xXFXQ3TfUfCc5PDNnLZDpLIV1NADKyjZa87mHgmWX57bYdIfIY3pdCGf43xQUXI62kBn3fZxi4SPC8crIjDQ4yzFAaz/XcPJn7xf03VRzIB5Z7qCbBzPQi5jga2E9bCD+ELug8ficEZCk/Cmj8Ro3aLtLxDR1/QffhIHNRTUZCf+S5G7SJBp2b7G31B9+EjcVAFEInZQ2LU7jiN1zf4gu7DR+KwTvkfO9bGx6BNnEQ8XXmN5cT3fEH34SNxwN4A9dgknIEwyWNbeRTwV7WYHBVwFQfbwKb7vOUjiYAiKVT1PczXqCLD/n5UbuLcNxTKoCgExSFNmsFCHI6iJBQFnUbqqbWPHyFceDAOrC/oPpIN+FVaVLrNUa6dLPbvoEQdO4pd1OUylBVkCutsOkqosbNvwcE6qL6g+0hG3MY4ejots1pT3kE4P9QDdfuLKeDfHswD6gu6j2TF2yQcLoqEGurre9EdP1QTfmxJRdn0NlrvD+jmY69Egz+UQvxfgAEALJ4EcRDa/toAAAAASUVORK5CYII=\0" ;
pub const ZEND_EXTENSION_API_NO: u32 = 220131226;
pub const ZEND_EXTMSG_NEW_EXTENSION: u32 = 1;
pub type size_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type off_t = __off_t;
pub type time_t = __time_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type uint = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_leak_info {
    pub addr: *mut ::std::os::raw::c_void,
    pub size: size_t,
    pub filename: *const ::std::os::raw::c_char,
    pub lineno: uint,
    pub orig_filename: *const ::std::os::raw::c_char,
    pub orig_lineno: uint,
}
#[test]
fn bindgen_test_layout__zend_leak_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_leak_info>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_leak_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_leak_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_leak_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).lineno as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).orig_filename as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(orig_filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).orig_lineno as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(orig_lineno)
        )
    );
}
pub type zend_leak_info = _zend_leak_info;
extern "C" {
    pub fn zend_strndup(
        s: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _zend_mem_block_size(ptr: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    pub fn zend_set_memory_limit(memory_limit: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_memory_usage(real_usage: ::std::os::raw::c_int) -> size_t;
}
extern "C" {
    pub fn zend_memory_peak_usage(real_usage: ::std::os::raw::c_int) -> size_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_heap {
    _unused: [u8; 0],
}
pub type zend_mm_heap = _zend_mm_heap;
extern "C" {
    pub fn zend_mm_startup() -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_shutdown(
        heap: *mut zend_mm_heap,
        full_shutdown: ::std::os::raw::c_int,
        silent: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn _zend_mm_alloc(heap: *mut zend_mm_heap, size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _zend_mm_free(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _zend_mm_realloc(
        heap: *mut zend_mm_heap,
        p: *mut ::std::os::raw::c_void,
        size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _zend_mm_block_size(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void) -> size_t;
}
pub type zend_mm_storage = _zend_mm_storage;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_segment {
    pub size: size_t,
    pub next_segment: *mut _zend_mm_segment,
}
#[test]
fn bindgen_test_layout__zend_mm_segment() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mm_segment>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_mm_segment))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mm_segment>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mm_segment))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_segment>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_segment),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_segment>())).next_segment as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_segment),
            "::",
            stringify!(next_segment)
        )
    );
}
pub type zend_mm_segment = _zend_mm_segment;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_mem_handlers {
    pub name: *const ::std::os::raw::c_char,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(params: *mut ::std::os::raw::c_void) -> *mut zend_mm_storage,
    >,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(storage: *mut zend_mm_storage)>,
    pub compact: ::std::option::Option<unsafe extern "C" fn(storage: *mut zend_mm_storage)>,
    pub _alloc: ::std::option::Option<
        unsafe extern "C" fn(storage: *mut zend_mm_storage, size: size_t) -> *mut zend_mm_segment,
    >,
    pub _realloc: ::std::option::Option<
        unsafe extern "C" fn(
            storage: *mut zend_mm_storage,
            ptr: *mut zend_mm_segment,
            size: size_t,
        ) -> *mut zend_mm_segment,
    >,
    pub _free: ::std::option::Option<
        unsafe extern "C" fn(storage: *mut zend_mm_storage, ptr: *mut zend_mm_segment),
    >,
}
#[test]
fn bindgen_test_layout__zend_mm_mem_handlers() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mm_mem_handlers>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_mm_mem_handlers))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mm_mem_handlers>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mm_mem_handlers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>())).init as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>())).dtor as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>())).compact as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(compact)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>()))._alloc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>()))._realloc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(_realloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_mem_handlers>()))._free as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_mem_handlers),
            "::",
            stringify!(_free)
        )
    );
}
pub type zend_mm_mem_handlers = _zend_mm_mem_handlers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_storage {
    pub handlers: *const zend_mm_mem_handlers,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_mm_storage() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mm_storage>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_mm_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mm_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mm_storage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_storage>())).handlers as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_storage),
            "::",
            stringify!(handlers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_storage>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_storage),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn zend_mm_startup_ex(
        handlers: *const zend_mm_mem_handlers,
        block_size: size_t,
        reserve_size: size_t,
        internal: ::std::os::raw::c_int,
        params: *mut ::std::os::raw::c_void,
    ) -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_set_heap(new_heap: *mut zend_mm_heap) -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_get_storage(heap: *mut zend_mm_heap) -> *mut zend_mm_storage;
}
extern "C" {
    pub fn zend_mm_set_custom_handlers(
        heap: *mut zend_mm_heap,
        _malloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: size_t) -> *mut ::std::os::raw::c_void,
        >,
        _free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: size_t,
            ) -> *mut ::std::os::raw::c_void,
        >,
    );
}
pub type zend_bool = ::std::os::raw::c_uchar;
pub type zend_uchar = ::std::os::raw::c_uchar;
pub type zend_uint = ::std::os::raw::c_uint;
pub type zend_ulong = ::std::os::raw::c_ulong;
pub type zend_ushort = ::std::os::raw::c_ushort;
pub type zend_long64 = ::std::os::raw::c_longlong;
pub type zend_ulong64 = ::std::os::raw::c_ulonglong;
pub type zend_intptr_t = ::std::os::raw::c_long;
pub type zend_uintptr_t = ::std::os::raw::c_ulong;
pub type zend_object_handle = ::std::os::raw::c_uint;
pub type zend_object_handlers = _zend_object_handlers;
pub type zval = _zval_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_value {
    pub handle: zend_object_handle,
    pub handlers: *const zend_object_handlers,
}
#[test]
fn bindgen_test_layout__zend_object_value() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_value>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_object_value))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_value>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_value>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_value),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_value>())).handlers as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_value),
            "::",
            stringify!(handlers)
        )
    );
}
pub type zend_object_value = _zend_object_value;
extern "C" {
    pub static mut zend_new_interned_string: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
            free_src: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >;
}
extern "C" {
    pub static mut zend_interned_strings_snapshot: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_interned_strings_restore: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub fn zend_interned_strings_init();
}
extern "C" {
    pub fn zend_interned_strings_dtor();
}
pub const ZEND_RESULT_CODE_SUCCESS: ZEND_RESULT_CODE = 0;
pub const ZEND_RESULT_CODE_FAILURE: ZEND_RESULT_CODE = -1;
pub type ZEND_RESULT_CODE = ::std::os::raw::c_int;
pub type compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type sort_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: size_t,
        arg3: size_t,
        arg4: compare_func_t,
    ),
>;
pub type dtor_func_t =
    ::std::option::Option<unsafe extern "C" fn(pDest: *mut ::std::os::raw::c_void)>;
pub type copy_ctor_func_t =
    ::std::option::Option<unsafe extern "C" fn(pElement: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bucket {
    pub h: ulong,
    pub nKeyLength: uint,
    pub pData: *mut ::std::os::raw::c_void,
    pub pDataPtr: *mut ::std::os::raw::c_void,
    pub pListNext: *mut bucket,
    pub pListLast: *mut bucket,
    pub pNext: *mut bucket,
    pub pLast: *mut bucket,
    pub arKey: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_bucket() {
    assert_eq!(
        ::std::mem::size_of::<bucket>(),
        72usize,
        concat!("Size of: ", stringify!(bucket))
    );
    assert_eq!(
        ::std::mem::align_of::<bucket>(),
        8usize,
        concat!("Alignment of ", stringify!(bucket))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).h as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(bucket), "::", stringify!(h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).nKeyLength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(nKeyLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pDataPtr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pDataPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pListNext as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pListNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pListLast as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pListLast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pNext as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).pLast as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(pLast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bucket>())).arKey as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(bucket),
            "::",
            stringify!(arKey)
        )
    );
}
pub type Bucket = bucket;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _hashtable {
    pub nTableSize: uint,
    pub nTableMask: uint,
    pub nNumOfElements: uint,
    pub nNextFreeElement: ulong,
    pub pInternalPointer: *mut Bucket,
    pub pListHead: *mut Bucket,
    pub pListTail: *mut Bucket,
    pub arBuckets: *mut *mut Bucket,
    pub pDestructor: dtor_func_t,
    pub persistent: zend_bool,
    pub nApplyCount: ::std::os::raw::c_uchar,
    pub bApplyProtection: zend_bool,
}
#[test]
fn bindgen_test_layout__hashtable() {
    assert_eq!(
        ::std::mem::size_of::<_hashtable>(),
        72usize,
        concat!("Size of: ", stringify!(_hashtable))
    );
    assert_eq!(
        ::std::mem::align_of::<_hashtable>(),
        8usize,
        concat!("Alignment of ", stringify!(_hashtable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).nTableSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(nTableSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).nTableMask as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(nTableMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).nNumOfElements as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(nNumOfElements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).nNextFreeElement as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(nNextFreeElement)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).pInternalPointer as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(pInternalPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).pListHead as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(pListHead)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).pListTail as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(pListTail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).arBuckets as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(arBuckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).pDestructor as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(pDestructor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).persistent as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(persistent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).nApplyCount as *const _ as usize },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(nApplyCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_hashtable>())).bApplyProtection as *const _ as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(_hashtable),
            "::",
            stringify!(bApplyProtection)
        )
    );
}
pub type HashTable = _hashtable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_hash_key {
    pub arKey: *const ::std::os::raw::c_char,
    pub nKeyLength: uint,
    pub h: ulong,
}
#[test]
fn bindgen_test_layout__zend_hash_key() {
    assert_eq!(
        ::std::mem::size_of::<_zend_hash_key>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_hash_key))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_hash_key>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_hash_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_hash_key>())).arKey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_hash_key),
            "::",
            stringify!(arKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_hash_key>())).nKeyLength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_hash_key),
            "::",
            stringify!(nKeyLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_hash_key>())).h as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_hash_key),
            "::",
            stringify!(h)
        )
    );
}
pub type zend_hash_key = _zend_hash_key;
pub type merge_checker_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        target_ht: *mut HashTable,
        source_data: *mut ::std::os::raw::c_void,
        hash_key: *mut zend_hash_key,
        pParam: *mut ::std::os::raw::c_void,
    ) -> zend_bool,
>;
pub type HashPosition = *mut Bucket;
extern "C" {
    pub fn _zend_hash_init(
        ht: *mut HashTable,
        nSize: uint,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_hash_init_ex(
        ht: *mut HashTable,
        nSize: uint,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
        bApplyProtection: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_clean(ht: *mut HashTable);
}
extern "C" {
    pub fn _zend_hash_add_or_update(
        ht: *mut HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_hash_quick_add_or_update(
        ht: *mut HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_hash_index_update_or_next_insert(
        ht: *mut HashTable,
        h: ulong,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_add_empty_element(
        ht: *mut HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
    ) -> ::std::os::raw::c_int;
}
pub type apply_func_t = ::std::option::Option<
    unsafe extern "C" fn(pDest: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type apply_func_arg_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut ::std::os::raw::c_void,
        argument: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type apply_func_args_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut ::std::os::raw::c_void,
        num_args: ::std::os::raw::c_int,
        args: *mut __va_list_tag,
        hash_key: *mut zend_hash_key,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn zend_hash_graceful_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_graceful_reverse_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_hash_apply_with_argument(
        ht: *mut HashTable,
        apply_func: apply_func_arg_t,
        arg1: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_hash_apply_with_arguments(
        ht: *mut HashTable,
        apply_func: apply_func_args_t,
        arg1: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn zend_hash_reverse_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_hash_del_key_or_index(
        ht: *mut HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_find(
        ht: *const HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_quick_find(
        ht: *const HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_index_find(
        ht: *const HashTable,
        h: ulong,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_exists(
        ht: *const HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_quick_exists(
        ht: *const HashTable,
        arKey: *const ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_index_exists(ht: *const HashTable, h: ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_next_free_element(ht: *const HashTable) -> ulong;
}
extern "C" {
    pub fn zend_hash_move_forward_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_move_backwards_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_key_ex(
        ht: *const HashTable,
        str_index: *mut *mut ::std::os::raw::c_char,
        str_length: *mut uint,
        num_index: *mut ulong,
        duplicate: zend_bool,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_key_zval_ex(
        ht: *const HashTable,
        key: *mut zval,
        pos: *mut HashPosition,
    );
}
extern "C" {
    pub fn zend_hash_get_current_key_type_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_data_ex(
        ht: *mut HashTable,
        pData: *mut *mut ::std::os::raw::c_void,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_internal_pointer_reset_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
extern "C" {
    pub fn zend_hash_internal_pointer_end_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
extern "C" {
    pub fn zend_hash_update_current_key_ex(
        ht: *mut HashTable,
        key_type: ::std::os::raw::c_int,
        str_index: *const ::std::os::raw::c_char,
        str_length: uint,
        num_index: ulong,
        mode: ::std::os::raw::c_int,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HashPointer {
    pub pos: HashPosition,
    pub h: ulong,
}
#[test]
fn bindgen_test_layout__HashPointer() {
    assert_eq!(
        ::std::mem::size_of::<_HashPointer>(),
        16usize,
        concat!("Size of: ", stringify!(_HashPointer))
    );
    assert_eq!(
        ::std::mem::align_of::<_HashPointer>(),
        8usize,
        concat!("Alignment of ", stringify!(_HashPointer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HashPointer>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HashPointer),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HashPointer>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HashPointer),
            "::",
            stringify!(h)
        )
    );
}
pub type HashPointer = _HashPointer;
extern "C" {
    pub fn zend_hash_get_pointer(
        ht: *const HashTable,
        ptr: *mut HashPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_set_pointer(
        ht: *mut HashTable,
        ptr: *const HashPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_copy(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        tmp: *mut ::std::os::raw::c_void,
        size: uint,
    );
}
extern "C" {
    pub fn _zend_hash_merge(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        tmp: *mut ::std::os::raw::c_void,
        size: uint,
        overwrite: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn zend_hash_merge_ex(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        size: uint,
        pMergeSource: merge_checker_func_t,
        pParam: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_hash_sort(
        ht: *mut HashTable,
        sort_func: sort_func_t,
        compare_func: compare_func_t,
        renumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_compare(
        ht1: *mut HashTable,
        ht2: *mut HashTable,
        compar: compare_func_t,
        ordered: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_minmax(
        ht: *const HashTable,
        compar: compare_func_t,
        flag: ::std::os::raw::c_int,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_num_elements(ht: *const HashTable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_rehash(ht: *mut HashTable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_reindex(ht: *mut HashTable, only_integer_keys: zend_bool);
}
extern "C" {
    pub fn _zend_hash_splice(
        ht: *mut HashTable,
        nDataSize: uint,
        pCopyConstructor: copy_ctor_func_t,
        offset: uint,
        length: uint,
        list: *mut *mut ::std::os::raw::c_void,
        list_count: uint,
        removed: *mut HashTable,
    );
}
extern "C" {
    pub fn zend_hash_func(arKey: *const ::std::os::raw::c_char, nKeyLength: uint) -> ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ts_hashtable {
    pub hash: HashTable,
    pub reader: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_ts_hashtable() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ts_hashtable>(),
        80usize,
        concat!("Size of: ", stringify!(_zend_ts_hashtable))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ts_hashtable>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ts_hashtable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ts_hashtable>())).hash as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ts_hashtable),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ts_hashtable>())).reader as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ts_hashtable),
            "::",
            stringify!(reader)
        )
    );
}
pub type TsHashTable = _zend_ts_hashtable;
extern "C" {
    pub fn _zend_ts_hash_init(
        ht: *mut TsHashTable,
        nSize: uint,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_ts_hash_init_ex(
        ht: *mut TsHashTable,
        nSize: uint,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
        bApplyProtection: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_destroy(ht: *mut TsHashTable);
}
extern "C" {
    pub fn zend_ts_hash_clean(ht: *mut TsHashTable);
}
extern "C" {
    pub fn _zend_ts_hash_add_or_update(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_ts_hash_quick_add_or_update(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _zend_ts_hash_index_update_or_next_insert(
        ht: *mut TsHashTable,
        h: ulong,
        pData: *mut ::std::os::raw::c_void,
        nDataSize: uint,
        pDest: *mut *mut ::std::os::raw::c_void,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_add_empty_element(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_graceful_destroy(ht: *mut TsHashTable);
}
extern "C" {
    pub fn zend_ts_hash_apply(ht: *mut TsHashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_ts_hash_apply_with_argument(
        ht: *mut TsHashTable,
        apply_func: apply_func_arg_t,
        arg1: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_ts_hash_apply_with_arguments(
        ht: *mut TsHashTable,
        apply_func: apply_func_args_t,
        arg1: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn zend_ts_hash_reverse_apply(ht: *mut TsHashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_ts_hash_del_key_or_index(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_get_hash_value(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
    ) -> ulong;
}
extern "C" {
    pub fn zend_ts_hash_find(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_quick_find(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
        h: ulong,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_index_find(
        ht: *mut TsHashTable,
        h: ulong,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_exists(
        ht: *mut TsHashTable,
        arKey: *mut ::std::os::raw::c_char,
        nKeyLength: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_index_exists(ht: *mut TsHashTable, h: ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_copy(
        target: *mut TsHashTable,
        source: *mut TsHashTable,
        pCopyConstructor: copy_ctor_func_t,
        tmp: *mut ::std::os::raw::c_void,
        size: uint,
    );
}
extern "C" {
    pub fn zend_ts_hash_copy_to_hash(
        target: *mut HashTable,
        source: *mut TsHashTable,
        pCopyConstructor: copy_ctor_func_t,
        tmp: *mut ::std::os::raw::c_void,
        size: uint,
    );
}
extern "C" {
    pub fn zend_ts_hash_merge(
        target: *mut TsHashTable,
        source: *mut TsHashTable,
        pCopyConstructor: copy_ctor_func_t,
        tmp: *mut ::std::os::raw::c_void,
        size: uint,
        overwrite: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn zend_ts_hash_merge_ex(
        target: *mut TsHashTable,
        source: *mut TsHashTable,
        pCopyConstructor: copy_ctor_func_t,
        size: uint,
        pMergeSource: merge_checker_func_t,
        pParam: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_ts_hash_sort(
        ht: *mut TsHashTable,
        sort_func: sort_func_t,
        compare_func: compare_func_t,
        renumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_compare(
        ht1: *mut TsHashTable,
        ht2: *mut TsHashTable,
        compar: compare_func_t,
        ordered: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_minmax(
        ht: *mut TsHashTable,
        compar: compare_func_t,
        flag: ::std::os::raw::c_int,
        pData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_num_elements(ht: *mut TsHashTable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_rehash(ht: *mut TsHashTable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ts_hash_func(arKey: *mut ::std::os::raw::c_char, nKeyLength: uint) -> ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist_element {
    pub next: *mut _zend_llist_element,
    pub prev: *mut _zend_llist_element,
    pub data: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout__zend_llist_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_llist_element>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_llist_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_llist_element>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_llist_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(data)
        )
    );
}
pub type zend_llist_element = _zend_llist_element;
pub type llist_dtor_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type llist_compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *const zend_llist_element,
        arg2: *mut *const zend_llist_element,
    ) -> ::std::os::raw::c_int,
>;
pub type llist_apply_with_args_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        num_args: ::std::os::raw::c_int,
        args: *mut __va_list_tag,
    ),
>;
pub type llist_apply_with_arg_func_t = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void, arg: *mut ::std::os::raw::c_void),
>;
pub type llist_apply_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist {
    pub head: *mut zend_llist_element,
    pub tail: *mut zend_llist_element,
    pub count: size_t,
    pub size: size_t,
    pub dtor: llist_dtor_func_t,
    pub persistent: ::std::os::raw::c_uchar,
    pub traverse_ptr: *mut zend_llist_element,
}
#[test]
fn bindgen_test_layout__zend_llist() {
    assert_eq!(
        ::std::mem::size_of::<_zend_llist>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_llist))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_llist>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_llist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).tail as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).dtor as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).persistent as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(persistent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).traverse_ptr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(traverse_ptr)
        )
    );
}
pub type zend_llist = _zend_llist;
pub type zend_llist_position = *mut zend_llist_element;
extern "C" {
    pub fn zend_llist_init(
        l: *mut zend_llist,
        size: size_t,
        dtor: llist_dtor_func_t,
        persistent: ::std::os::raw::c_uchar,
    );
}
extern "C" {
    pub fn zend_llist_add_element(l: *mut zend_llist, element: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_llist_prepend_element(l: *mut zend_llist, element: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_llist_del_element(
        l: *mut zend_llist,
        element: *mut ::std::os::raw::c_void,
        compare: ::std::option::Option<
            unsafe extern "C" fn(
                element1: *mut ::std::os::raw::c_void,
                element2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_llist_destroy(l: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_clean(l: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_remove_tail(l: *mut zend_llist) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_copy(dst: *mut zend_llist, src: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_apply(l: *mut zend_llist, func: llist_apply_func_t);
}
extern "C" {
    pub fn zend_llist_apply_with_del(
        l: *mut zend_llist,
        func: ::std::option::Option<
            unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_llist_apply_with_argument(
        l: *mut zend_llist,
        func: llist_apply_with_arg_func_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_llist_apply_with_arguments(
        l: *mut zend_llist,
        func: llist_apply_with_args_func_t,
        num_args: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn zend_llist_count(l: *mut zend_llist) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_llist_sort(l: *mut zend_llist, comp_func: llist_compare_func_t);
}
extern "C" {
    pub fn zend_llist_get_first_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_last_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_next_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_prev_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_error_noreturn(
        type_: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
pub type zend_class_entry = _zend_class_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_guard {
    pub in_get: zend_bool,
    pub in_set: zend_bool,
    pub in_unset: zend_bool,
    pub in_isset: zend_bool,
    pub dummy: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_guard() {
    assert_eq!(
        ::std::mem::size_of::<_zend_guard>(),
        5usize,
        concat!("Size of: ", stringify!(_zend_guard))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_guard>(),
        1usize,
        concat!("Alignment of ", stringify!(_zend_guard))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_guard>())).in_get as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_guard),
            "::",
            stringify!(in_get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_guard>())).in_set as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_guard),
            "::",
            stringify!(in_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_guard>())).in_unset as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_guard),
            "::",
            stringify!(in_unset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_guard>())).in_isset as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_guard),
            "::",
            stringify!(in_isset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_guard>())).dummy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_guard),
            "::",
            stringify!(dummy)
        )
    );
}
pub type zend_guard = _zend_guard;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object {
    pub ce: *mut zend_class_entry,
    pub properties: *mut HashTable,
    pub properties_table: *mut *mut zval,
    pub guards: *mut HashTable,
}
#[test]
fn bindgen_test_layout__zend_object() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_object))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).ce as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).properties as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).properties_table as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(properties_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).guards as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(guards)
        )
    );
}
pub type zend_object = _zend_object;
pub type zend_object_read_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        type_: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> *mut zval,
>;
pub type zend_object_read_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        offset: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> *mut zval,
>;
pub type zend_object_write_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        value: *mut zval,
        key: *const _zend_literal,
    ),
>;
pub type zend_object_write_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, offset: *mut zval, value: *mut zval),
>;
pub type zend_object_get_property_ptr_ptr_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        type_: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> *mut *mut zval,
>;
pub type zend_object_set_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut *mut zval, value: *mut zval)>;
pub type zend_object_get_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> *mut zval>;
pub type zend_object_has_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        has_set_exists: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_has_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        check_empty: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_unset_property_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, member: *mut zval, key: *const _zend_literal),
>;
pub type zend_object_unset_dimension_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval, offset: *mut zval)>;
pub type zend_object_get_properties_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> *mut HashTable>;
pub type zend_object_get_debug_info_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, is_temp: *mut ::std::os::raw::c_int) -> *mut HashTable,
>;
pub type zend_object_call_method_t = ::std::option::Option<
    unsafe extern "C" fn(
        method: *const ::std::os::raw::c_char,
        ht: ::std::os::raw::c_int,
        return_value: *mut zval,
        return_value_ptr: *mut *mut zval,
        this_ptr: *mut zval,
        return_value_used: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_method_t = ::std::option::Option<
    unsafe extern "C" fn(
        object_ptr: *mut *mut zval,
        method: *mut ::std::os::raw::c_char,
        method_len: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> *mut _zend_function,
>;
pub type zend_object_get_constructor_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> *mut _zend_function>;
pub type zend_object_add_ref_t = ::std::option::Option<unsafe extern "C" fn(object: *mut zval)>;
pub type zend_object_del_ref_t = ::std::option::Option<unsafe extern "C" fn(object: *mut zval)>;
pub type zend_object_delete_obj_t = ::std::option::Option<unsafe extern "C" fn(object: *mut zval)>;
pub type zend_object_clone_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> zend_object_value>;
pub type zend_object_get_class_entry_t =
    ::std::option::Option<unsafe extern "C" fn(object: *const zval) -> *mut zend_class_entry>;
pub type zend_object_get_class_name_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *const zval,
        class_name: *mut *const ::std::os::raw::c_char,
        class_name_len: *mut zend_uint,
        parent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_compare_t = ::std::option::Option<
    unsafe extern "C" fn(object1: *mut zval, object2: *mut zval) -> ::std::os::raw::c_int,
>;
pub type zend_object_compare_zvals_t = ::std::option::Option<
    unsafe extern "C" fn(resul: *mut zval, op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int,
>;
pub type zend_object_cast_t = ::std::option::Option<
    unsafe extern "C" fn(
        readobj: *mut zval,
        retval: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_count_elements_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        count: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_closure_t = ::std::option::Option<
    unsafe extern "C" fn(
        obj: *mut zval,
        ce_ptr: *mut *mut zend_class_entry,
        fptr_ptr: *mut *mut _zend_function,
        zobj_ptr: *mut *mut zval,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_gc_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        table: *mut *mut *mut zval,
        n: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable,
>;
pub type zend_object_do_operation_t = ::std::option::Option<
    unsafe extern "C" fn(
        opcode: zend_uchar,
        result: *mut zval,
        op1: *mut zval,
        op2: *mut zval,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_handlers {
    pub add_ref: zend_object_add_ref_t,
    pub del_ref: zend_object_del_ref_t,
    pub clone_obj: zend_object_clone_obj_t,
    pub read_property: zend_object_read_property_t,
    pub write_property: zend_object_write_property_t,
    pub read_dimension: zend_object_read_dimension_t,
    pub write_dimension: zend_object_write_dimension_t,
    pub get_property_ptr_ptr: zend_object_get_property_ptr_ptr_t,
    pub get: zend_object_get_t,
    pub set: zend_object_set_t,
    pub has_property: zend_object_has_property_t,
    pub unset_property: zend_object_unset_property_t,
    pub has_dimension: zend_object_has_dimension_t,
    pub unset_dimension: zend_object_unset_dimension_t,
    pub get_properties: zend_object_get_properties_t,
    pub get_method: zend_object_get_method_t,
    pub call_method: zend_object_call_method_t,
    pub get_constructor: zend_object_get_constructor_t,
    pub get_class_entry: zend_object_get_class_entry_t,
    pub get_class_name: zend_object_get_class_name_t,
    pub compare_objects: zend_object_compare_t,
    pub cast_object: zend_object_cast_t,
    pub count_elements: zend_object_count_elements_t,
    pub get_debug_info: zend_object_get_debug_info_t,
    pub get_closure: zend_object_get_closure_t,
    pub get_gc: zend_object_get_gc_t,
    pub do_operation: zend_object_do_operation_t,
    pub compare: zend_object_compare_zvals_t,
}
#[test]
fn bindgen_test_layout__zend_object_handlers() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_handlers>(),
        224usize,
        concat!("Size of: ", stringify!(_zend_object_handlers))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_handlers>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_handlers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).add_ref as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(add_ref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).del_ref as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(del_ref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).clone_obj as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(clone_obj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).read_property as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(read_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).write_property as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(write_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).read_dimension as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(read_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).write_dimension as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(write_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_property_ptr_ptr as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_property_ptr_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).get as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).set as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).has_property as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(has_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).unset_property as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(unset_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).has_dimension as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(has_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).unset_dimension as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(unset_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_properties as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_properties)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_method as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).call_method as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(call_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_constructor as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_constructor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_class_entry as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_class_entry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_class_name as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).compare_objects as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(compare_objects)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).cast_object as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(cast_object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).count_elements as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(count_elements)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_debug_info as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_debug_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_closure as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_closure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).get_gc as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_gc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).do_operation as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(do_operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).compare as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(compare)
        )
    );
}
extern "C" {
    pub static mut std_object_handlers: zend_object_handlers;
}
extern "C" {
    pub fn zend_std_get_static_method(
        ce: *mut zend_class_entry,
        function_name_strval: *const ::std::os::raw::c_char,
        function_name_strlen: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> *mut _zend_function;
}
extern "C" {
    pub fn zend_std_get_static_property(
        ce: *mut zend_class_entry,
        property_name: *const ::std::os::raw::c_char,
        property_name_len: ::std::os::raw::c_int,
        silent: zend_bool,
        key: *const _zend_literal,
    ) -> *mut *mut zval;
}
extern "C" {
    pub fn zend_std_unset_static_property(
        ce: *mut zend_class_entry,
        property_name: *const ::std::os::raw::c_char,
        property_name_len: ::std::os::raw::c_int,
        key: *const _zend_literal,
    ) -> zend_bool;
}
extern "C" {
    pub fn zend_std_get_constructor(object: *mut zval) -> *mut _zend_function;
}
extern "C" {
    pub fn zend_get_property_info(
        ce: *mut zend_class_entry,
        member: *mut zval,
        silent: ::std::os::raw::c_int,
    ) -> *mut _zend_property_info;
}
extern "C" {
    pub fn zend_std_get_properties(object: *mut zval) -> *mut HashTable;
}
extern "C" {
    pub fn zend_std_get_debug_info(
        object: *mut zval,
        is_temp: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
extern "C" {
    pub fn zend_std_cast_object_tostring(
        readobj: *mut zval,
        writeobj: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_std_write_property(
        object: *mut zval,
        member: *mut zval,
        value: *mut zval,
        key: *const _zend_literal,
    );
}
extern "C" {
    pub fn zend_check_private(
        fbc: *mut _zend_function,
        ce: *mut zend_class_entry,
        function_name_strval: *mut ::std::os::raw::c_char,
        function_name_strlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_check_protected(
        ce: *mut zend_class_entry,
        scope: *mut zend_class_entry,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_check_property_access(
        zobj: *mut zend_object,
        prop_info_name: *const ::std::os::raw::c_char,
        prop_info_name_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_std_call_user_call(
        ht: ::std::os::raw::c_int,
        return_value: *mut zval,
        return_value_ptr: *mut *mut zval,
        this_ptr: *mut zval,
        return_value_used: ::std::os::raw::c_int,
    );
}
pub type zend_ast = _zend_ast;
pub const _zend_ast_kind_ZEND_CONST: _zend_ast_kind = 256;
pub const _zend_ast_kind_ZEND_BOOL_AND: _zend_ast_kind = 257;
pub const _zend_ast_kind_ZEND_BOOL_OR: _zend_ast_kind = 258;
pub const _zend_ast_kind_ZEND_SELECT: _zend_ast_kind = 259;
pub const _zend_ast_kind_ZEND_UNARY_PLUS: _zend_ast_kind = 260;
pub const _zend_ast_kind_ZEND_UNARY_MINUS: _zend_ast_kind = 261;
pub type _zend_ast_kind = ::std::os::raw::c_uint;
pub use self::_zend_ast_kind as zend_ast_kind;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast {
    pub kind: ::std::os::raw::c_ushort,
    pub children: ::std::os::raw::c_ushort,
    pub u: _zend_ast__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_ast__bindgen_ty_1 {
    pub val: *mut zval,
    pub child: *mut zend_ast,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__zend_ast__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_ast__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast__bindgen_ty_1>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast__bindgen_ty_1),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast__bindgen_ty_1>())).child as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast__bindgen_ty_1),
            "::",
            stringify!(child)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_ast() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_ast))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).children as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(children)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(u)
        )
    );
}
extern "C" {
    pub fn zend_ast_create_constant(zv: *mut zval) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_unary(kind: uint, op0: *mut zend_ast) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_binary(
        kind: uint,
        op0: *mut zend_ast,
        op1: *mut zend_ast,
    ) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_ternary(
        kind: uint,
        op0: *mut zend_ast,
        op1: *mut zend_ast,
        op2: *mut zend_ast,
    ) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_dynamic(kind: uint) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_dynamic_add(ast: *mut *mut zend_ast, op: *mut zend_ast);
}
extern "C" {
    pub fn zend_ast_dynamic_shrink(ast: *mut *mut zend_ast);
}
extern "C" {
    pub fn zend_ast_is_ct_constant(ast: *mut zend_ast) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ast_evaluate(result: *mut zval, ast: *mut zend_ast, scope: *mut zend_class_entry);
}
extern "C" {
    pub fn zend_ast_copy(ast: *mut zend_ast) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_destroy(ast: *mut zend_ast);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zvalue_value {
    pub lval: ::std::os::raw::c_long,
    pub dval: f64,
    pub str_: _zvalue_value__bindgen_ty_1,
    pub ht: *mut HashTable,
    pub obj: zend_object_value,
    pub ast: *mut zend_ast,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zvalue_value__bindgen_ty_1 {
    pub val: *mut ::std::os::raw::c_char,
    pub len: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zvalue_value__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zvalue_value__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(_zvalue_value__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zvalue_value__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zvalue_value__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value__bindgen_ty_1>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value__bindgen_ty_1),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value__bindgen_ty_1>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value__bindgen_ty_1),
            "::",
            stringify!(len)
        )
    );
}
#[test]
fn bindgen_test_layout__zvalue_value() {
    assert_eq!(
        ::std::mem::size_of::<_zvalue_value>(),
        16usize,
        concat!("Size of: ", stringify!(_zvalue_value))
    );
    assert_eq!(
        ::std::mem::align_of::<_zvalue_value>(),
        8usize,
        concat!("Alignment of ", stringify!(_zvalue_value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).lval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(lval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).dval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(dval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).ht as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(ht)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).obj as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zvalue_value>())).ast as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zvalue_value),
            "::",
            stringify!(ast)
        )
    );
}
pub type zvalue_value = _zvalue_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zval_struct {
    pub value: zvalue_value,
    pub refcount__gc: zend_uint,
    pub type_: zend_uchar,
    pub is_ref__gc: zend_uchar,
}
#[test]
fn bindgen_test_layout__zval_struct() {
    assert_eq!(
        ::std::mem::size_of::<_zval_struct>(),
        24usize,
        concat!("Size of: ", stringify!(_zval_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(_zval_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).refcount__gc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(refcount__gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).type_ as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).is_ref__gc as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(is_ref__gc)
        )
    );
}
pub type zend_object_iterator = _zend_object_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_iterator_funcs {
    pub dtor: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub valid: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator) -> ::std::os::raw::c_int,
    >,
    pub get_current_data: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator, data: *mut *mut *mut zval),
    >,
    pub get_current_key: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator, key: *mut zval),
    >,
    pub move_forward: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub rewind: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub invalidate_current:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
}
#[test]
fn bindgen_test_layout__zend_object_iterator_funcs() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_iterator_funcs>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_object_iterator_funcs))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_iterator_funcs>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_iterator_funcs))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).dtor as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).valid as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).get_current_data as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(get_current_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).get_current_key as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(get_current_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).move_forward as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(move_forward)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).rewind as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(rewind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).invalidate_current as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(invalidate_current)
        )
    );
}
pub type zend_object_iterator_funcs = _zend_object_iterator_funcs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_iterator {
    pub data: *mut ::std::os::raw::c_void,
    pub funcs: *mut zend_object_iterator_funcs,
    pub index: ulong,
}
#[test]
fn bindgen_test_layout__zend_object_iterator() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_iterator>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_object_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_iterator))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).funcs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(funcs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).index as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(index)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_iterator_funcs {
    pub funcs: *mut zend_object_iterator_funcs,
    pub zf_new_iterator: *mut _zend_function,
    pub zf_valid: *mut _zend_function,
    pub zf_current: *mut _zend_function,
    pub zf_key: *mut _zend_function,
    pub zf_next: *mut _zend_function,
    pub zf_rewind: *mut _zend_function,
}
#[test]
fn bindgen_test_layout__zend_class_iterator_funcs() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_iterator_funcs>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_class_iterator_funcs))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_iterator_funcs>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_iterator_funcs))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).funcs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(funcs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_new_iterator as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_new_iterator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_valid as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_current as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_current)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_key as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_next as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_rewind as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_rewind)
        )
    );
}
pub type zend_class_iterator_funcs = _zend_class_iterator_funcs;
pub const zend_object_iterator_kind_ZEND_ITER_INVALID: zend_object_iterator_kind = 0;
pub const zend_object_iterator_kind_ZEND_ITER_PLAIN_ARRAY: zend_object_iterator_kind = 1;
pub const zend_object_iterator_kind_ZEND_ITER_PLAIN_OBJECT: zend_object_iterator_kind = 2;
pub const zend_object_iterator_kind_ZEND_ITER_OBJECT: zend_object_iterator_kind = 3;
pub type zend_object_iterator_kind = ::std::os::raw::c_uint;
extern "C" {
    pub fn zend_iterator_unwrap(
        array_ptr: *mut zval,
        iter: *mut *mut zend_object_iterator,
    ) -> zend_object_iterator_kind;
}
extern "C" {
    pub fn zend_iterator_wrap(iter: *mut zend_object_iterator) -> *mut zval;
}
extern "C" {
    pub fn zend_register_iterator_wrapper();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_serialize_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_unserialize_data {
    _unused: [u8; 0],
}
pub type zend_serialize_data = _zend_serialize_data;
pub type zend_unserialize_data = _zend_unserialize_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_method_reference {
    pub method_name: *const ::std::os::raw::c_char,
    pub mname_len: ::std::os::raw::c_uint,
    pub ce: *mut zend_class_entry,
    pub class_name: *const ::std::os::raw::c_char,
    pub cname_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__zend_trait_method_reference() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_method_reference>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_trait_method_reference))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_method_reference>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_method_reference))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).method_name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(method_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).mname_len as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(mname_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_method_reference>())).ce as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).class_name as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).cname_len as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(cname_len)
        )
    );
}
pub type zend_trait_method_reference = _zend_trait_method_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_precedence {
    pub trait_method: *mut zend_trait_method_reference,
    pub exclude_from_classes: *mut *mut zend_class_entry,
}
#[test]
fn bindgen_test_layout__zend_trait_precedence() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_precedence>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_trait_precedence))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_precedence>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_precedence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence>())).trait_method as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence),
            "::",
            stringify!(trait_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence>())).exclude_from_classes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence),
            "::",
            stringify!(exclude_from_classes)
        )
    );
}
pub type zend_trait_precedence = _zend_trait_precedence;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_alias {
    pub trait_method: *mut zend_trait_method_reference,
    #[doc = " name for method to be added"]
    pub alias: *const ::std::os::raw::c_char,
    pub alias_len: ::std::os::raw::c_uint,
    #[doc = " modifiers to be set on trait method"]
    pub modifiers: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_trait_alias() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_alias>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_trait_alias))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_alias>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_alias))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).trait_method as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(trait_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).alias as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).alias_len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(alias_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).modifiers as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(modifiers)
        )
    );
}
pub type zend_trait_alias = _zend_trait_alias;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_class_entry {
    pub type_: ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub name_length: zend_uint,
    pub parent: *mut _zend_class_entry,
    pub refcount: ::std::os::raw::c_int,
    pub ce_flags: zend_uint,
    pub function_table: HashTable,
    pub properties_info: HashTable,
    pub default_properties_table: *mut *mut zval,
    pub default_static_members_table: *mut *mut zval,
    pub static_members_table: *mut *mut zval,
    pub constants_table: HashTable,
    pub default_properties_count: ::std::os::raw::c_int,
    pub default_static_members_count: ::std::os::raw::c_int,
    pub constructor: *mut _zend_function,
    pub destructor: *mut _zend_function,
    pub clone: *mut _zend_function,
    pub __get: *mut _zend_function,
    pub __set: *mut _zend_function,
    pub __unset: *mut _zend_function,
    pub __isset: *mut _zend_function,
    pub __call: *mut _zend_function,
    pub __callstatic: *mut _zend_function,
    pub __tostring: *mut _zend_function,
    pub __debugInfo: *mut _zend_function,
    pub serialize_func: *mut _zend_function,
    pub unserialize_func: *mut _zend_function,
    pub iterator_funcs: zend_class_iterator_funcs,
    pub create_object: ::std::option::Option<
        unsafe extern "C" fn(class_type: *mut zend_class_entry) -> zend_object_value,
    >,
    pub get_iterator: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            object: *mut zval,
            by_ref: ::std::os::raw::c_int,
        ) -> *mut zend_object_iterator,
    >,
    pub interface_gets_implemented: ::std::option::Option<
        unsafe extern "C" fn(
            iface: *mut zend_class_entry,
            class_type: *mut zend_class_entry,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_static_method: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            method: *mut ::std::os::raw::c_char,
            method_len: ::std::os::raw::c_int,
        ) -> *mut _zend_function,
    >,
    pub serialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut zval,
            buffer: *mut *mut ::std::os::raw::c_uchar,
            buf_len: *mut zend_uint,
            data: *mut zend_serialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub unserialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut *mut zval,
            ce: *mut zend_class_entry,
            buf: *const ::std::os::raw::c_uchar,
            buf_len: zend_uint,
            data: *mut zend_unserialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub interfaces: *mut *mut zend_class_entry,
    pub num_interfaces: zend_uint,
    pub traits: *mut *mut zend_class_entry,
    pub num_traits: zend_uint,
    pub trait_aliases: *mut *mut zend_trait_alias,
    pub trait_precedences: *mut *mut zend_trait_precedence,
    pub info: _zend_class_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_1 {
    pub user: _zend_class_entry__bindgen_ty_1__bindgen_ty_1,
    pub internal: _zend_class_entry__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_1__bindgen_ty_1 {
    pub filename: *const ::std::os::raw::c_char,
    pub line_start: zend_uint,
    pub line_end: zend_uint,
    pub doc_comment: *const ::std::os::raw::c_char,
    pub doc_comment_len: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).filename
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).line_start
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(line_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).line_end
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(line_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).doc_comment
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>()))
                .doc_comment_len as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(doc_comment_len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_1__bindgen_ty_2 {
    pub builtin_functions: *const _zend_function_entry,
    pub module: *mut _zend_module_entry,
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>()))
                .builtin_functions as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(builtin_functions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>())).module
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(module)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_class_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1>())).user as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1>())).internal as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1),
            "::",
            stringify!(internal)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_class_entry() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry>(),
        576usize,
        concat!("Size of: ", stringify!(_zend_class_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).name_length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(name_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).parent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).refcount as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).ce_flags as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(ce_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).function_table as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(function_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).properties_info as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(properties_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_properties_table as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_properties_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_static_members_table as *const _
                as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_static_members_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).static_members_table as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(static_members_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).constants_table as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(constants_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_properties_count as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_properties_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_static_members_count as *const _
                as usize
        },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_static_members_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).constructor as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(constructor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).destructor as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(destructor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).clone as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__get as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__set as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__unset as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__unset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__isset as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__isset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__call as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__callstatic as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__callstatic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__tostring as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__tostring)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__debugInfo as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__debugInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).serialize_func as *const _ as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(serialize_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).unserialize_func as *const _ as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(unserialize_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).iterator_funcs as *const _ as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(iterator_funcs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).create_object as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(create_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).get_iterator as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(get_iterator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).interface_gets_implemented as *const _
                as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(interface_gets_implemented)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).get_static_method as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(get_static_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).serialize as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(serialize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).unserialize as *const _ as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(unserialize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).interfaces as *const _ as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(interfaces)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).num_interfaces as *const _ as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(num_interfaces)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).traits as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(traits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).num_traits as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(num_traits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).trait_aliases as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(trait_aliases)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).trait_precedences as *const _ as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(trait_precedences)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).info as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(info)
        )
    );
}
pub type zend_stream_fsizer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void) -> size_t>;
pub type zend_stream_reader_t = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        buf: *mut ::std::os::raw::c_char,
        len: size_t,
    ) -> size_t,
>;
pub type zend_stream_closer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void)>;
pub const zend_stream_type_ZEND_HANDLE_FILENAME: zend_stream_type = 0;
pub const zend_stream_type_ZEND_HANDLE_FD: zend_stream_type = 1;
pub const zend_stream_type_ZEND_HANDLE_FP: zend_stream_type = 2;
pub const zend_stream_type_ZEND_HANDLE_STREAM: zend_stream_type = 3;
pub const zend_stream_type_ZEND_HANDLE_MAPPED: zend_stream_type = 4;
pub type zend_stream_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mmap {
    pub len: size_t,
    pub pos: size_t,
    pub map: *mut ::std::os::raw::c_void,
    pub buf: *mut ::std::os::raw::c_char,
    pub old_handle: *mut ::std::os::raw::c_void,
    pub old_closer: zend_stream_closer_t,
}
#[test]
fn bindgen_test_layout__zend_mmap() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mmap>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_mmap))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mmap>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mmap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).map as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).buf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).old_handle as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(old_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).old_closer as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(old_closer)
        )
    );
}
pub type zend_mmap = _zend_mmap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stream {
    pub handle: *mut ::std::os::raw::c_void,
    pub isatty: ::std::os::raw::c_int,
    pub mmap: zend_mmap,
    pub reader: zend_stream_reader_t,
    pub fsizer: zend_stream_fsizer_t,
    pub closer: zend_stream_closer_t,
}
#[test]
fn bindgen_test_layout__zend_stream() {
    assert_eq!(
        ::std::mem::size_of::<_zend_stream>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_stream))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_stream>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_stream))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).isatty as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(isatty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).mmap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(mmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).reader as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(reader)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).fsizer as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(fsizer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).closer as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(closer)
        )
    );
}
pub type zend_stream = _zend_stream;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_file_handle {
    pub type_: zend_stream_type,
    pub filename: *const ::std::os::raw::c_char,
    pub opened_path: *mut ::std::os::raw::c_char,
    pub handle: _zend_file_handle__bindgen_ty_1,
    pub free_filename: zend_bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_file_handle__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub fp: *mut FILE,
    pub stream: zend_stream,
    _bindgen_union_align: [u64; 11usize],
}
#[test]
fn bindgen_test_layout__zend_file_handle__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_file_handle__bindgen_ty_1>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_file_handle__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_file_handle__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_file_handle__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).fp as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).stream as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(stream)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_file_handle() {
    assert_eq!(
        ::std::mem::size_of::<_zend_file_handle>(),
        120usize,
        concat!("Size of: ", stringify!(_zend_file_handle))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_file_handle>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_file_handle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).filename as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).opened_path as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(opened_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).handle as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).free_filename as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(free_filename)
        )
    );
}
pub type zend_file_handle = _zend_file_handle;
extern "C" {
    pub fn zend_stream_open(
        filename: *const ::std::os::raw::c_char,
        handle: *mut zend_file_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stream_fixup(
        file_handle: *mut zend_file_handle,
        buf: *mut *mut ::std::os::raw::c_char,
        len: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_file_handle_dtor(fh: *mut zend_file_handle);
}
extern "C" {
    pub fn zend_compare_file_handles(
        fh1: *mut zend_file_handle,
        fh2: *mut zend_file_handle,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_utility_functions {
    pub error_function: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *const ::std::os::raw::c_char,
            error_lineno: uint,
            format: *const ::std::os::raw::c_char,
            args: *mut __va_list_tag,
        ),
    >,
    pub printf_function: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int,
    >,
    pub write_function: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const ::std::os::raw::c_char,
            str_length: uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub fopen_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            opened_path: *mut *mut ::std::os::raw::c_char,
        ) -> *mut FILE,
    >,
    pub message_handler: ::std::option::Option<
        unsafe extern "C" fn(message: ::std::os::raw::c_long, data: *const ::std::os::raw::c_void),
    >,
    pub block_interruptions: ::std::option::Option<unsafe extern "C" fn()>,
    pub unblock_interruptions: ::std::option::Option<unsafe extern "C" fn()>,
    pub get_configuration_directive: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            name_length: uint,
            contents: *mut zval,
        ) -> ::std::os::raw::c_int,
    >,
    pub ticks_function: ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>,
    pub on_timeout: ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>,
    pub stream_open_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            handle: *mut zend_file_handle,
        ) -> ::std::os::raw::c_int,
    >,
    pub vspprintf_function: ::std::option::Option<
        unsafe extern "C" fn(
            pbuf: *mut *mut ::std::os::raw::c_char,
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int,
    >,
    pub getenv_function: ::std::option::Option<
        unsafe extern "C" fn(
            name: *mut ::std::os::raw::c_char,
            name_len: size_t,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub resolve_path_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            filename_len: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout__zend_utility_functions() {
    assert_eq!(
        ::std::mem::size_of::<_zend_utility_functions>(),
        112usize,
        concat!("Size of: ", stringify!(_zend_utility_functions))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_utility_functions>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_utility_functions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).error_function as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(error_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).printf_function as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(printf_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).write_function as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(write_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).fopen_function as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(fopen_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).message_handler as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(message_handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).block_interruptions as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(block_interruptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).unblock_interruptions as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(unblock_interruptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).get_configuration_directive
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(get_configuration_directive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).ticks_function as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(ticks_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).on_timeout as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(on_timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).stream_open_function as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(stream_open_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).vspprintf_function as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(vspprintf_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).getenv_function as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(getenv_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).resolve_path_function as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(resolve_path_function)
        )
    );
}
pub type zend_utility_functions = _zend_utility_functions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_utility_values {
    pub import_use_extension: *mut ::std::os::raw::c_char,
    pub import_use_extension_length: uint,
    pub html_errors: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_utility_values() {
    assert_eq!(
        ::std::mem::size_of::<_zend_utility_values>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_utility_values))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_utility_values>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_utility_values))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).import_use_extension as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(import_use_extension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).import_use_extension_length as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(import_use_extension_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).html_errors as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(html_errors)
        )
    );
}
pub type zend_utility_values = _zend_utility_values;
pub type zend_write_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *const ::std::os::raw::c_char,
        str_length: uint,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn zend_startup(
        utility_functions: *mut zend_utility_functions,
        extensions: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_shutdown();
}
extern "C" {
    pub fn zend_register_standard_ini_entries();
}
extern "C" {
    pub fn zend_post_startup();
}
extern "C" {
    pub fn zend_set_utility_values(utility_values: *mut zend_utility_values);
}
extern "C" {
    pub fn _zend_bailout(filename: *mut ::std::os::raw::c_char, lineno: uint);
}
extern "C" {
    pub fn zend_make_printable_zval(
        expr: *mut zval,
        expr_copy: *mut zval,
        use_copy: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn zend_print_zval(expr: *mut zval, indent: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_print_zval_ex(
        write_func: zend_write_func_t,
        expr: *mut zval,
        indent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_print_zval_r(expr: *mut zval, indent: ::std::os::raw::c_int);
}
extern "C" {
    pub fn zend_print_flat_zval_r(expr: *mut zval);
}
extern "C" {
    pub fn zend_print_zval_r_ex(
        write_func: zend_write_func_t,
        expr: *mut zval,
        indent: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn zend_output_debug_string(
        trigger_break: zend_bool,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn zend_activate();
}
extern "C" {
    pub fn zend_deactivate();
}
extern "C" {
    pub fn zend_call_destructors();
}
extern "C" {
    pub fn zend_activate_modules();
}
extern "C" {
    pub fn zend_deactivate_modules();
}
extern "C" {
    pub fn zend_post_deactivate_modules();
}
extern "C" {
    pub static mut zend_printf: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub static mut zend_write: zend_write_func_t;
}
extern "C" {
    pub static mut zend_fopen: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            opened_path: *mut *mut ::std::os::raw::c_char,
        ) -> *mut FILE,
    >;
}
extern "C" {
    pub static mut zend_block_interruptions: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_unblock_interruptions: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_ticks_function:
        ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>;
}
extern "C" {
    pub static mut zend_error_cb: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *const ::std::os::raw::c_char,
            error_lineno: uint,
            format: *const ::std::os::raw::c_char,
            args: *mut __va_list_tag,
        ),
    >;
}
extern "C" {
    pub static mut zend_on_timeout:
        ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>;
}
extern "C" {
    pub static mut zend_stream_open_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            handle: *mut zend_file_handle,
        ) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub static mut zend_vspprintf: ::std::option::Option<
        unsafe extern "C" fn(
            pbuf: *mut *mut ::std::os::raw::c_char,
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub static mut zend_getenv: ::std::option::Option<
        unsafe extern "C" fn(
            name: *mut ::std::os::raw::c_char,
            name_len: size_t,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
extern "C" {
    pub static mut zend_resolve_path: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            filename_len: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
extern "C" {
    pub fn zend_error(type_: ::std::os::raw::c_int, format: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn zenderror(error: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut zend_standard_class_def: *mut zend_class_entry;
}
extern "C" {
    pub static mut zend_uv: zend_utility_values;
}
extern "C" {
    pub static mut zval_used_for_init: zval;
}
extern "C" {
    pub fn zend_message_dispatcher(
        message: ::std::os::raw::c_long,
        data: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_get_configuration_directive(
        name: *const ::std::os::raw::c_char,
        name_length: uint,
        contents: *mut zval,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _gc_root_buffer {
    pub prev: *mut _gc_root_buffer,
    pub next: *mut _gc_root_buffer,
    pub handle: zend_object_handle,
    pub u: _gc_root_buffer__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _gc_root_buffer__bindgen_ty_1 {
    pub pz: *mut zval,
    pub handlers: *const zend_object_handlers,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__gc_root_buffer__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_gc_root_buffer__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_gc_root_buffer__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_gc_root_buffer__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_gc_root_buffer__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gc_root_buffer__bindgen_ty_1>())).pz as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer__bindgen_ty_1),
            "::",
            stringify!(pz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_gc_root_buffer__bindgen_ty_1>())).handlers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer__bindgen_ty_1),
            "::",
            stringify!(handlers)
        )
    );
}
#[test]
fn bindgen_test_layout__gc_root_buffer() {
    assert_eq!(
        ::std::mem::size_of::<_gc_root_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_gc_root_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_gc_root_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_gc_root_buffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).u as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(u)
        )
    );
}
pub type gc_root_buffer = _gc_root_buffer;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zval_gc_info {
    pub z: zval,
    pub u: _zval_gc_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_gc_info__bindgen_ty_1 {
    pub buffered: *mut gc_root_buffer,
    pub next: *mut _zval_gc_info,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__zval_gc_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zval_gc_info__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_zval_gc_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_gc_info__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zval_gc_info__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_gc_info__bindgen_ty_1>())).buffered as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_gc_info__bindgen_ty_1),
            "::",
            stringify!(buffered)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_gc_info__bindgen_ty_1>())).next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_gc_info__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
#[test]
fn bindgen_test_layout__zval_gc_info() {
    assert_eq!(
        ::std::mem::size_of::<_zval_gc_info>(),
        32usize,
        concat!("Size of: ", stringify!(_zval_gc_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_gc_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zval_gc_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_gc_info>())).z as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_gc_info),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_gc_info>())).u as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_gc_info),
            "::",
            stringify!(u)
        )
    );
}
pub type zval_gc_info = _zval_gc_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_gc_globals {
    pub gc_enabled: zend_bool,
    pub gc_active: zend_bool,
    pub buf: *mut gc_root_buffer,
    pub roots: gc_root_buffer,
    pub unused: *mut gc_root_buffer,
    pub first_unused: *mut gc_root_buffer,
    pub last_unused: *mut gc_root_buffer,
    pub zval_to_free: *mut zval_gc_info,
    pub free_list: *mut zval_gc_info,
    pub next_to_free: *mut zval_gc_info,
    pub gc_runs: zend_uint,
    pub collected: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_gc_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_gc_globals>(),
        104usize,
        concat!("Size of: ", stringify!(_zend_gc_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_gc_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_gc_globals))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_active as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_active)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).roots as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(roots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).unused as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).first_unused as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(first_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).last_unused as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(last_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).zval_to_free as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(zval_to_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).free_list as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(free_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).next_to_free as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(next_to_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_runs as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_runs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).collected as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(collected)
        )
    );
}
pub type zend_gc_globals = _zend_gc_globals;
extern "C" {
    pub static mut gc_globals: zend_gc_globals;
}
extern "C" {
    pub fn zend_freedtoa(s: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn zend_dtoa(
        _d: f64,
        mode: ::std::os::raw::c_int,
        ndigits: ::std::os::raw::c_int,
        decpt: *mut ::std::os::raw::c_int,
        sign: *mut ::std::os::raw::c_int,
        rve: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_strtod(
        s00: *const ::std::os::raw::c_char,
        se: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_hex_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_oct_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_bin_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_startup_strtod() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_shutdown_strtod() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_string_to_double(number: *const ::std::os::raw::c_char, length: zend_uint) -> f64;
}
extern "C" {
    pub fn zend_str_tolower(str_: *mut ::std::os::raw::c_char, length: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn zend_str_tolower_copy(
        dest: *mut ::std::os::raw::c_char,
        source: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_str_tolower_dup(
        source: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_binary_zval_strcmp(s1: *mut zval, s2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strncmp(
        s1: *mut zval,
        s2: *mut zval,
        s3: *mut zval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strcasecmp(s1: *mut zval, s2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strncasecmp(
        s1: *mut zval,
        s2: *mut zval,
        s3: *mut zval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strcmp(
        s1: *const ::std::os::raw::c_char,
        len1: uint,
        s2: *const ::std::os::raw::c_char,
        len2: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncmp(
        s1: *const ::std::os::raw::c_char,
        len1: uint,
        s2: *const ::std::os::raw::c_char,
        len2: uint,
        length: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strcasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: uint,
        s2: *const ::std::os::raw::c_char,
        len2: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: uint,
        s2: *const ::std::os::raw::c_char,
        len2: uint,
        length: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncasecmp_l(
        s1: *const ::std::os::raw::c_char,
        len1: uint,
        s2: *const ::std::os::raw::c_char,
        len2: uint,
        length: uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zendi_smart_strcmp(result: *mut zval, s1: *mut zval, s2: *mut zval);
}
extern "C" {
    pub fn zend_compare_symbol_tables(result: *mut zval, ht1: *mut HashTable, ht2: *mut HashTable);
}
extern "C" {
    pub fn zend_compare_arrays(result: *mut zval, a1: *mut zval, a2: *mut zval);
}
extern "C" {
    pub fn zend_compare_objects(result: *mut zval, o1: *mut zval, o2: *mut zval);
}
extern "C" {
    pub fn zend_atoi(
        str_: *const ::std::os::raw::c_char,
        str_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_atol(
        str_: *const ::std::os::raw::c_char,
        str_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn zend_locale_sprintf_double(op: *mut zval);
}
extern "C" {
    pub fn zend_print_variable(var: *mut zval) -> ::std::os::raw::c_int;
}
pub const zend_error_handling_t_EH_NORMAL: zend_error_handling_t = 0;
pub const zend_error_handling_t_EH_SUPPRESS: zend_error_handling_t = 1;
pub const zend_error_handling_t_EH_THROW: zend_error_handling_t = 2;
pub type zend_error_handling_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct zend_error_handling {
    pub handling: zend_error_handling_t,
    pub exception: *mut zend_class_entry,
    pub user_handler: *mut zval,
}
#[test]
fn bindgen_test_layout_zend_error_handling() {
    assert_eq!(
        ::std::mem::size_of::<zend_error_handling>(),
        24usize,
        concat!("Size of: ", stringify!(zend_error_handling))
    );
    assert_eq!(
        ::std::mem::align_of::<zend_error_handling>(),
        8usize,
        concat!("Alignment of ", stringify!(zend_error_handling))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zend_error_handling>())).handling as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(handling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zend_error_handling>())).exception as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(exception)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<zend_error_handling>())).user_handler as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(user_handler)
        )
    );
}
extern "C" {
    pub fn zend_save_error_handling(current: *mut zend_error_handling);
}
extern "C" {
    pub fn zend_replace_error_handling(
        error_handling: zend_error_handling_t,
        exception_class: *mut zend_class_entry,
        current: *mut zend_error_handling,
    );
}
extern "C" {
    pub fn zend_restore_error_handling(saved: *mut zend_error_handling);
}
pub type compare_r_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn zend_qsort(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        siz: size_t,
        compare: compare_func_t,
    );
}
extern "C" {
    pub fn zend_qsort_r(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        siz: size_t,
        compare: compare_r_func_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
pub type zend_op_array = _zend_op_array;
pub type zend_op = _zend_op;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_compiler_context {
    pub opcodes_size: zend_uint,
    pub vars_size: ::std::os::raw::c_int,
    pub literals_size: ::std::os::raw::c_int,
    pub current_brk_cont: ::std::os::raw::c_int,
    pub backpatch_count: ::std::os::raw::c_int,
    pub nested_calls: ::std::os::raw::c_int,
    pub used_stack: ::std::os::raw::c_int,
    pub in_finally: ::std::os::raw::c_int,
    pub labels: *mut HashTable,
}
#[test]
fn bindgen_test_layout__zend_compiler_context() {
    assert_eq!(
        ::std::mem::size_of::<_zend_compiler_context>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_compiler_context))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_compiler_context>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_compiler_context))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).opcodes_size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(opcodes_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).vars_size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(vars_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).literals_size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(literals_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).current_brk_cont as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(current_brk_cont)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).backpatch_count as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(backpatch_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).nested_calls as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(nested_calls)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).used_stack as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(used_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_context>())).in_finally as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(in_finally)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_context>())).labels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_context),
            "::",
            stringify!(labels)
        )
    );
}
pub type zend_compiler_context = _zend_compiler_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_literal {
    pub constant: zval,
    pub hash_value: zend_ulong,
    pub cache_slot: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_literal() {
    assert_eq!(
        ::std::mem::size_of::<_zend_literal>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_literal))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_literal>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_literal))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_literal>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_literal),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_literal>())).hash_value as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_literal),
            "::",
            stringify!(hash_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_literal>())).cache_slot as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_literal),
            "::",
            stringify!(cache_slot)
        )
    );
}
pub type zend_literal = _zend_literal;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode_op {
    pub constant: zend_uint,
    pub var: zend_uint,
    pub num: zend_uint,
    pub hash: zend_ulong,
    pub opline_num: zend_uint,
    pub jmp_addr: *mut zend_op,
    pub zv: *mut zval,
    pub literal: *mut zend_literal,
    pub ptr: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__znode_op() {
    assert_eq!(
        ::std::mem::size_of::<_znode_op>(),
        8usize,
        concat!("Size of: ", stringify!(_znode_op))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode_op>(),
        8usize,
        concat!("Alignment of ", stringify!(_znode_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).var as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).hash as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).opline_num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(opline_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).jmp_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(jmp_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).zv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(zv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).literal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(literal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(ptr)
        )
    );
}
pub type znode_op = _znode_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _znode {
    pub op_type: ::std::os::raw::c_int,
    pub u: _znode__bindgen_ty_1,
    pub EA: zend_uint,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode__bindgen_ty_1 {
    pub op: znode_op,
    pub constant: zval,
    pub op_array: *mut zend_op_array,
    pub ast: *mut zend_ast,
    _bindgen_union_align: [u64; 3usize],
}
#[test]
fn bindgen_test_layout__znode__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_znode__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(_znode__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_znode__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).op_array as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(op_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).ast as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(ast)
        )
    );
}
#[test]
fn bindgen_test_layout__znode() {
    assert_eq!(
        ::std::mem::size_of::<_znode>(),
        40usize,
        concat!("Size of: ", stringify!(_znode))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode>(),
        8usize,
        concat!("Alignment of ", stringify!(_znode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).op_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode),
            "::",
            stringify!(op_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).u as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_znode), "::", stringify!(u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).EA as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode),
            "::",
            stringify!(EA)
        )
    );
}
pub type znode = _znode;
pub type zend_execute_data = _zend_execute_data;
pub type user_opcode_handler_t = ::std::option::Option<
    unsafe extern "C" fn(execute_data: *mut zend_execute_data) -> ::std::os::raw::c_int,
>;
pub type opcode_handler_t = ::std::option::Option<
    unsafe extern "C" fn(execute_data: *mut zend_execute_data) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub static mut zend_opcode_handlers: *mut opcode_handler_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_op {
    pub handler: opcode_handler_t,
    pub op1: znode_op,
    pub op2: znode_op,
    pub result: znode_op,
    pub extended_value: ulong,
    pub lineno: uint,
    pub opcode: zend_uchar,
    pub op1_type: zend_uchar,
    pub op2_type: zend_uchar,
    pub result_type: zend_uchar,
}
#[test]
fn bindgen_test_layout__zend_op() {
    assert_eq!(
        ::std::mem::size_of::<_zend_op>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_op))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_op>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).handler as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).result as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).extended_value as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(extended_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).lineno as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).opcode as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op1_type as *const _ as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op1_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op2_type as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op2_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).result_type as *const _ as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(result_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_brk_cont_element {
    pub start: ::std::os::raw::c_int,
    pub cont: ::std::os::raw::c_int,
    pub brk: ::std::os::raw::c_int,
    pub parent: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_brk_cont_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_brk_cont_element>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_brk_cont_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_brk_cont_element>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_brk_cont_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).cont as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).brk as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(brk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).parent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(parent)
        )
    );
}
pub type zend_brk_cont_element = _zend_brk_cont_element;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_label {
    pub brk_cont: ::std::os::raw::c_int,
    pub opline_num: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_label() {
    assert_eq!(
        ::std::mem::size_of::<_zend_label>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_label))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_label>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_label))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_label>())).brk_cont as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_label),
            "::",
            stringify!(brk_cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_label>())).opline_num as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_label),
            "::",
            stringify!(opline_num)
        )
    );
}
pub type zend_label = _zend_label;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_try_catch_element {
    pub try_op: zend_uint,
    pub catch_op: zend_uint,
    pub finally_op: zend_uint,
    pub finally_end: zend_uint,
}
#[test]
fn bindgen_test_layout__zend_try_catch_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_try_catch_element>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_try_catch_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_try_catch_element>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_try_catch_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_try_catch_element>())).try_op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(try_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).catch_op as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(catch_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).finally_op as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(finally_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).finally_end as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(finally_end)
        )
    );
}
pub type zend_try_catch_element = _zend_try_catch_element;
extern "C" {
    pub fn zend_visibility_string(fn_flags: zend_uint) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_property_info {
    pub flags: zend_uint,
    pub name: *const ::std::os::raw::c_char,
    pub name_length: ::std::os::raw::c_int,
    pub h: ulong,
    pub offset: ::std::os::raw::c_int,
    pub doc_comment: *const ::std::os::raw::c_char,
    pub doc_comment_len: ::std::os::raw::c_int,
    pub ce: *mut zend_class_entry,
}
#[test]
fn bindgen_test_layout__zend_property_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_property_info>(),
        64usize,
        concat!("Size of: ", stringify!(_zend_property_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_property_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_property_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).name_length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(name_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).h as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).offset as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).doc_comment as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_property_info>())).doc_comment_len as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(doc_comment_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).ce as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(ce)
        )
    );
}
pub type zend_property_info = _zend_property_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_arg_info {
    pub name: *const ::std::os::raw::c_char,
    pub name_len: zend_uint,
    pub class_name: *const ::std::os::raw::c_char,
    pub class_name_len: zend_uint,
    pub type_hint: zend_uchar,
    pub pass_by_reference: zend_uchar,
    pub allow_null: zend_bool,
    pub is_variadic: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_arg_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_arg_info>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_arg_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_arg_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_arg_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).name_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).class_name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).class_name_len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(class_name_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).type_hint as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(type_hint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_arg_info>())).pass_by_reference as *const _ as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(pass_by_reference)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).allow_null as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(allow_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).is_variadic as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(is_variadic)
        )
    );
}
pub type zend_arg_info = _zend_arg_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function_info {
    pub _name: *const ::std::os::raw::c_char,
    pub _name_len: zend_uint,
    pub _class_name: *const ::std::os::raw::c_char,
    pub required_num_args: zend_uint,
    pub _type_hint: zend_uchar,
    pub return_reference: zend_bool,
    pub _allow_null: zend_bool,
    pub _is_variadic: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_internal_function_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_internal_function_info>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_internal_function_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_internal_function_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_internal_function_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._name_len as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_name_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._class_name as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).required_num_args as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._type_hint as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_type_hint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).return_reference as *const _
                as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(return_reference)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._allow_null as *const _
                as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_allow_null)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._is_variadic as *const _
                as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_is_variadic)
        )
    );
}
pub type zend_internal_function_info = _zend_internal_function_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_compiled_variable {
    pub name: *const ::std::os::raw::c_char,
    pub name_len: ::std::os::raw::c_int,
    pub hash_value: ulong,
}
#[test]
fn bindgen_test_layout__zend_compiled_variable() {
    assert_eq!(
        ::std::mem::size_of::<_zend_compiled_variable>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_compiled_variable))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_compiled_variable>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_compiled_variable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiled_variable>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiled_variable),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiled_variable>())).name_len as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiled_variable),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiled_variable>())).hash_value as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiled_variable),
            "::",
            stringify!(hash_value)
        )
    );
}
pub type zend_compiled_variable = _zend_compiled_variable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_op_array {
    pub type_: zend_uchar,
    pub function_name: *const ::std::os::raw::c_char,
    pub scope: *mut zend_class_entry,
    pub fn_flags: zend_uint,
    pub prototype: *mut _zend_function,
    pub num_args: zend_uint,
    pub required_num_args: zend_uint,
    pub arg_info: *mut zend_arg_info,
    pub refcount: *mut zend_uint,
    pub opcodes: *mut zend_op,
    pub last: zend_uint,
    pub vars: *mut zend_compiled_variable,
    pub last_var: ::std::os::raw::c_int,
    pub T: zend_uint,
    pub nested_calls: zend_uint,
    pub used_stack: zend_uint,
    pub brk_cont_array: *mut zend_brk_cont_element,
    pub last_brk_cont: ::std::os::raw::c_int,
    pub try_catch_array: *mut zend_try_catch_element,
    pub last_try_catch: ::std::os::raw::c_int,
    pub has_finally_block: zend_bool,
    pub static_variables: *mut HashTable,
    pub this_var: zend_uint,
    pub filename: *const ::std::os::raw::c_char,
    pub line_start: zend_uint,
    pub line_end: zend_uint,
    pub doc_comment: *const ::std::os::raw::c_char,
    pub doc_comment_len: zend_uint,
    pub early_binding: zend_uint,
    pub literals: *mut zend_literal,
    pub last_literal: ::std::os::raw::c_int,
    pub run_time_cache: *mut *mut ::std::os::raw::c_void,
    pub last_cache_slot: ::std::os::raw::c_int,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout__zend_op_array() {
    assert_eq!(
        ::std::mem::size_of::<_zend_op_array>(),
        248usize,
        concat!("Size of: ", stringify!(_zend_op_array))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_op_array>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_op_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).function_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).scope as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).fn_flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).prototype as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).num_args as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_op_array>())).required_num_args as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).arg_info as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(arg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).refcount as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).opcodes as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(opcodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).vars as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(vars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_var as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).T as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(T)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).nested_calls as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(nested_calls)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).used_stack as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(used_stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).brk_cont_array as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(brk_cont_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_brk_cont as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_brk_cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).try_catch_array as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(try_catch_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_try_catch as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_try_catch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_op_array>())).has_finally_block as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(has_finally_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).static_variables as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(static_variables)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).this_var as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(this_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).filename as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).line_start as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(line_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).line_end as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(line_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).doc_comment as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).doc_comment_len as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(doc_comment_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).early_binding as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(early_binding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).literals as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(literals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_literal as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_literal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).run_time_cache as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(run_time_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_cache_slot as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_cache_slot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).reserved as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function {
    pub type_: zend_uchar,
    pub function_name: *const ::std::os::raw::c_char,
    pub scope: *mut zend_class_entry,
    pub fn_flags: zend_uint,
    pub prototype: *mut _zend_function,
    pub num_args: zend_uint,
    pub required_num_args: zend_uint,
    pub arg_info: *mut zend_arg_info,
    pub handler: ::std::option::Option<
        unsafe extern "C" fn(
            ht: ::std::os::raw::c_int,
            return_value: *mut zval,
            return_value_ptr: *mut *mut zval,
            this_ptr: *mut zval,
            return_value_used: ::std::os::raw::c_int,
        ),
    >,
    pub module: *mut _zend_module_entry,
}
#[test]
fn bindgen_test_layout__zend_internal_function() {
    assert_eq!(
        ::std::mem::size_of::<_zend_internal_function>(),
        72usize,
        concat!("Size of: ", stringify!(_zend_internal_function))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_internal_function>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_internal_function))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).function_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).scope as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).fn_flags as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).prototype as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).num_args as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).required_num_args as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).arg_info as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(arg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).handler as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).module as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(module)
        )
    );
}
pub type zend_internal_function = _zend_internal_function;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_function {
    pub type_: zend_uchar,
    pub common: _zend_function__bindgen_ty_1,
    pub op_array: zend_op_array,
    pub internal_function: zend_internal_function,
    _bindgen_union_align: [u64; 31usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_function__bindgen_ty_1 {
    pub type_: zend_uchar,
    pub function_name: *const ::std::os::raw::c_char,
    pub scope: *mut zend_class_entry,
    pub fn_flags: zend_uint,
    pub prototype: *mut _zend_function,
    pub num_args: zend_uint,
    pub required_num_args: zend_uint,
    pub arg_info: *mut zend_arg_info,
}
#[test]
fn bindgen_test_layout__zend_function__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function__bindgen_ty_1>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_function__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).function_name as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).scope as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).fn_flags as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).prototype as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).num_args as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).required_num_args as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).arg_info as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(arg_info)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_function() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function>(),
        248usize,
        concat!("Size of: ", stringify!(_zend_function))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).op_array as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(op_array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function>())).internal_function as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(internal_function)
        )
    );
}
pub type zend_function = _zend_function;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_function_state {
    pub function: *mut zend_function,
    pub arguments: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_function_state() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function_state>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_function_state))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function_state>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function_state>())).function as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function_state),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function_state>())).arguments as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function_state),
            "::",
            stringify!(arguments)
        )
    );
}
pub type zend_function_state = _zend_function_state;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_function_call_entry {
    pub fbc: *mut zend_function,
    pub arg_num: zend_uint,
    pub uses_argument_unpacking: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_function_call_entry() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function_call_entry>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_function_call_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function_call_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function_call_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function_call_entry>())).fbc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function_call_entry),
            "::",
            stringify!(fbc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function_call_entry>())).arg_num as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function_call_entry),
            "::",
            stringify!(arg_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function_call_entry>())).uses_argument_unpacking
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function_call_entry),
            "::",
            stringify!(uses_argument_unpacking)
        )
    );
}
pub type zend_function_call_entry = _zend_function_call_entry;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_switch_entry {
    pub cond: znode,
    pub default_case: ::std::os::raw::c_int,
    pub control_var: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_switch_entry() {
    assert_eq!(
        ::std::mem::size_of::<_zend_switch_entry>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_switch_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_switch_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_switch_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_switch_entry>())).cond as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_switch_entry),
            "::",
            stringify!(cond)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_switch_entry>())).default_case as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_switch_entry),
            "::",
            stringify!(default_case)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_switch_entry>())).control_var as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_switch_entry),
            "::",
            stringify!(control_var)
        )
    );
}
pub type zend_switch_entry = _zend_switch_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _call_slot {
    pub fbc: *mut zend_function,
    pub object: *mut zval,
    pub called_scope: *mut zend_class_entry,
    pub num_additional_args: zend_uint,
    pub is_ctor_call: zend_bool,
    pub is_ctor_result_used: zend_bool,
}
#[test]
fn bindgen_test_layout__call_slot() {
    assert_eq!(
        ::std::mem::size_of::<_call_slot>(),
        32usize,
        concat!("Size of: ", stringify!(_call_slot))
    );
    assert_eq!(
        ::std::mem::align_of::<_call_slot>(),
        8usize,
        concat!("Alignment of ", stringify!(_call_slot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).fbc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(fbc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).object as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).called_scope as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(called_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).num_additional_args as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(num_additional_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).is_ctor_call as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(is_ctor_call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_call_slot>())).is_ctor_result_used as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_call_slot),
            "::",
            stringify!(is_ctor_result_used)
        )
    );
}
pub type call_slot = _call_slot;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_execute_data {
    pub opline: *mut _zend_op,
    pub function_state: zend_function_state,
    pub op_array: *mut zend_op_array,
    pub object: *mut zval,
    pub symbol_table: *mut HashTable,
    pub prev_execute_data: *mut _zend_execute_data,
    pub old_error_reporting: *mut zval,
    pub nested: zend_bool,
    pub original_return_value: *mut *mut zval,
    pub current_scope: *mut zend_class_entry,
    pub current_called_scope: *mut zend_class_entry,
    pub current_this: *mut zval,
    pub fast_ret: *mut _zend_op,
    pub delayed_exception: *mut zval,
    pub call_slots: *mut call_slot,
    pub call: *mut call_slot,
}
#[test]
fn bindgen_test_layout__zend_execute_data() {
    assert_eq!(
        ::std::mem::size_of::<_zend_execute_data>(),
        136usize,
        concat!("Size of: ", stringify!(_zend_execute_data))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_execute_data>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_execute_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).opline as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(opline)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).function_state as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(function_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).op_array as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(op_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).object as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).symbol_table as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(symbol_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).prev_execute_data as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(prev_execute_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).old_error_reporting as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(old_error_reporting)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).nested as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(nested)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).original_return_value as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(original_return_value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).current_scope as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(current_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).current_called_scope as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(current_called_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).current_this as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(current_this)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).fast_ret as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(fast_ret)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).delayed_exception as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(delayed_exception)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).call_slots as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(call_slots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).call as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(call)
        )
    );
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[test]
fn bindgen_test_layout___jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__jmp_buf_tag>(),
        200usize,
        concat!("Size of: ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__jmpbuf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__jmpbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__mask_was_saved as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__saved_mask as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__saved_mask)
        )
    );
}
pub type jmp_buf = [__jmp_buf_tag; 1usize];
pub type zend_compiler_globals = _zend_compiler_globals;
pub type zend_executor_globals = _zend_executor_globals;
pub type zend_php_scanner_globals = _zend_php_scanner_globals;
pub type zend_ini_scanner_globals = _zend_ini_scanner_globals;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_compiler_globals {
    pub bp_stack: zend_stack,
    pub switch_cond_stack: zend_stack,
    pub foreach_copy_stack: zend_stack,
    pub object_stack: zend_stack,
    pub declare_stack: zend_stack,
    pub active_class_entry: *mut zend_class_entry,
    pub list_llist: zend_llist,
    pub dimension_llist: zend_llist,
    pub list_stack: zend_stack,
    pub function_call_stack: zend_stack,
    pub compiled_filename: *mut ::std::os::raw::c_char,
    pub zend_lineno: ::std::os::raw::c_int,
    pub active_op_array: *mut zend_op_array,
    pub function_table: *mut HashTable,
    pub class_table: *mut HashTable,
    pub filenames_table: HashTable,
    pub auto_globals: *mut HashTable,
    pub parse_error: zend_bool,
    pub in_compilation: zend_bool,
    pub short_tags: zend_bool,
    pub asp_tags: zend_bool,
    pub declarables: zend_declarables,
    pub unclean_shutdown: zend_bool,
    pub ini_parser_unbuffered_errors: zend_bool,
    pub open_files: zend_llist,
    pub catch_begin: ::std::os::raw::c_long,
    pub ini_parser_param: *mut _zend_ini_parser_param,
    pub interactive: ::std::os::raw::c_int,
    pub start_lineno: zend_uint,
    pub increment_lineno: zend_bool,
    pub implementing_class: znode,
    pub access_type: zend_uint,
    pub doc_comment: *mut ::std::os::raw::c_char,
    pub doc_comment_len: zend_uint,
    pub compiler_options: zend_uint,
    pub current_namespace: *mut zval,
    pub current_import: *mut HashTable,
    pub current_import_function: *mut HashTable,
    pub current_import_const: *mut HashTable,
    pub in_namespace: zend_bool,
    pub has_bracketed_namespaces: zend_bool,
    pub const_filenames: HashTable,
    pub context: zend_compiler_context,
    pub context_stack: zend_stack,
    pub interned_strings_start: *mut ::std::os::raw::c_char,
    pub interned_strings_end: *mut ::std::os::raw::c_char,
    pub interned_strings_top: *mut ::std::os::raw::c_char,
    pub interned_strings_snapshot_top: *mut ::std::os::raw::c_char,
    pub interned_empty_string: *mut ::std::os::raw::c_char,
    pub interned_strings: HashTable,
    pub script_encoding_list: *mut *const zend_encoding,
    pub script_encoding_list_size: size_t,
    pub multibyte: zend_bool,
    pub detect_unicode: zend_bool,
    pub encoding_declared: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_compiler_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_compiler_globals>(),
        848usize,
        concat!("Size of: ", stringify!(_zend_compiler_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_compiler_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_compiler_globals))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).bp_stack as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(bp_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).switch_cond_stack as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(switch_cond_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).foreach_copy_stack as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(foreach_copy_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).object_stack as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(object_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).declare_stack as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(declare_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).active_class_entry as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(active_class_entry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).list_llist as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(list_llist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).dimension_llist as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(dimension_llist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).list_stack as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(list_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).function_call_stack as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(function_call_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).compiled_filename as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(compiled_filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).zend_lineno as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(zend_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).active_op_array as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(active_op_array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).function_table as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(function_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).class_table as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(class_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).filenames_table as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(filenames_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).auto_globals as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(auto_globals)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).parse_error as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(parse_error)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).in_compilation as *const _ as usize
        },
        353usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(in_compilation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).short_tags as *const _ as usize
        },
        354usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(short_tags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).asp_tags as *const _ as usize },
        355usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(asp_tags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).declarables as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(declarables)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).unclean_shutdown as *const _ as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(unclean_shutdown)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).ini_parser_unbuffered_errors
                as *const _ as usize
        },
        385usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ini_parser_unbuffered_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).open_files as *const _ as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(open_files)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).catch_begin as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(catch_begin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).ini_parser_param as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ini_parser_param)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interactive as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interactive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).start_lineno as *const _ as usize
        },
        468usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(start_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).increment_lineno as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(increment_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).implementing_class as *const _
                as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(implementing_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).access_type as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(access_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).doc_comment as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).doc_comment_len as *const _ as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(doc_comment_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).compiler_options as *const _ as usize
        },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(compiler_options)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).current_namespace as *const _
                as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(current_namespace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).current_import as *const _ as usize
        },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(current_import)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).current_import_function as *const _
                as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(current_import_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).current_import_const as *const _
                as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(current_import_const)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).in_namespace as *const _ as usize
        },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(in_namespace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).has_bracketed_namespaces as *const _
                as usize
        },
        577usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(has_bracketed_namespaces)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).const_filenames as *const _ as usize
        },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(const_filenames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).context as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).context_stack as *const _ as usize
        },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(context_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings_start as *const _
                as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings_end as *const _
                as usize
        },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings_top as *const _
                as usize
        },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings_top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings_snapshot_top
                as *const _ as usize
        },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings_snapshot_top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_empty_string as *const _
                as usize
        },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_empty_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings as *const _ as usize
        },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).script_encoding_list as *const _
                as usize
        },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(script_encoding_list)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).script_encoding_list_size as *const _
                as usize
        },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(script_encoding_list_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).multibyte as *const _ as usize
        },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(multibyte)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).detect_unicode as *const _ as usize
        },
        841usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(detect_unicode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).encoding_declared as *const _
                as usize
        },
        842usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(encoding_declared)
        )
    );
}
extern "C" {
    pub static mut compiler_globals: _zend_compiler_globals;
}
extern "C" {
    pub fn zendparse() -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut executor_globals: zend_executor_globals;
}
extern "C" {
    pub static mut language_scanner_globals: zend_php_scanner_globals;
}
extern "C" {
    pub static mut ini_scanner_globals: zend_ini_scanner_globals;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stack {
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_stack() {
    assert_eq!(
        ::std::mem::size_of::<_zend_stack>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_stack))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_stack>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_stack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).max as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).elements as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(elements)
        )
    );
}
pub type zend_stack = _zend_stack;
extern "C" {
    pub fn zend_stack_init(stack: *mut zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_push(
        stack: *mut zend_stack,
        element: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_top(
        stack: *const zend_stack,
        element: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_del_top(stack: *mut zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_int_top(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_is_empty(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_destroy(stack: *mut zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_base(stack: *const zend_stack) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_stack_count(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_apply(
        stack: *mut zend_stack,
        type_: ::std::os::raw::c_int,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(element: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_stack_apply_with_argument(
        stack: *mut zend_stack,
        type_: ::std::os::raw::c_int,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(
                element: *mut ::std::os::raw::c_void,
                arg: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ptr_stack {
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut *mut ::std::os::raw::c_void,
    pub top_element: *mut *mut ::std::os::raw::c_void,
    pub persistent: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_ptr_stack() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ptr_stack>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_ptr_stack))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ptr_stack>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ptr_stack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).max as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).elements as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).top_element as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(top_element)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).persistent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(persistent)
        )
    );
}
pub type zend_ptr_stack = _zend_ptr_stack;
extern "C" {
    pub fn zend_ptr_stack_init(stack: *mut zend_ptr_stack);
}
extern "C" {
    pub fn zend_ptr_stack_init_ex(stack: *mut zend_ptr_stack, persistent: zend_bool);
}
extern "C" {
    pub fn zend_ptr_stack_n_push(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
extern "C" {
    pub fn zend_ptr_stack_n_pop(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
extern "C" {
    pub fn zend_ptr_stack_destroy(stack: *mut zend_ptr_stack);
}
extern "C" {
    pub fn zend_ptr_stack_apply(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
extern "C" {
    pub fn zend_ptr_stack_clean(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        free_elements: zend_bool,
    );
}
extern "C" {
    pub fn zend_ptr_stack_num_elements(stack: *mut zend_ptr_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_object_std_init(object: *mut zend_object, ce: *mut zend_class_entry);
}
extern "C" {
    pub fn zend_object_std_dtor(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_new(
        object: *mut *mut zend_object,
        class_type: *mut zend_class_entry,
    ) -> zend_object_value;
}
extern "C" {
    pub fn zend_objects_destroy_object(object: *mut zend_object, handle: zend_object_handle);
}
extern "C" {
    pub fn zend_objects_get_address(object: *const zval) -> *mut zend_object;
}
extern "C" {
    pub fn zend_objects_clone_members(
        new_object: *mut zend_object,
        new_obj_val: zend_object_value,
        old_object: *mut zend_object,
        handle: zend_object_handle,
    );
}
extern "C" {
    pub fn zend_objects_clone_obj(object: *mut zval) -> zend_object_value;
}
extern "C" {
    pub fn zend_objects_free_object_storage(object: *mut zend_object);
}
pub type zend_objects_store_dtor_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut ::std::os::raw::c_void, handle: zend_object_handle),
>;
pub type zend_objects_free_object_storage_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut ::std::os::raw::c_void)>;
pub type zend_objects_store_clone_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut ::std::os::raw::c_void,
        object_clone: *mut *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_object_store_bucket {
    pub destructor_called: zend_bool,
    pub valid: zend_bool,
    pub apply_count: zend_uchar,
    pub bucket: _zend_object_store_bucket__store_bucket,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_object_store_bucket__store_bucket {
    pub obj: _zend_object_store_bucket__store_bucket__store_object,
    pub free_list: _zend_object_store_bucket__store_bucket__bindgen_ty_1,
    _bindgen_union_align: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_store_bucket__store_bucket__store_object {
    pub object: *mut ::std::os::raw::c_void,
    pub dtor: zend_objects_store_dtor_t,
    pub free_storage: zend_objects_free_object_storage_t,
    pub clone: zend_objects_store_clone_t,
    pub handlers: *const zend_object_handlers,
    pub refcount: zend_uint,
    pub buffered: *mut gc_root_buffer,
}
#[test]
fn bindgen_test_layout__zend_object_store_bucket__store_bucket__store_object() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_store_bucket__store_bucket__store_object>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_store_bucket__store_bucket__store_object>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>())).object
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>())).dtor
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>()))
                .free_storage as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(free_storage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>())).clone
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>()))
                .handlers as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(handlers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>()))
                .refcount as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__store_object>()))
                .buffered as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__store_object),
            "::",
            stringify!(buffered)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_store_bucket__store_bucket__bindgen_ty_1 {
    pub next: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_object_store_bucket__store_bucket__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_store_bucket__store_bucket__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_zend_object_store_bucket__store_bucket__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_store_bucket__store_bucket__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_object_store_bucket__store_bucket__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket__bindgen_ty_1>())).next
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_object_store_bucket__store_bucket() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_store_bucket__store_bucket>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(_zend_object_store_bucket__store_bucket)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_store_bucket__store_bucket>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_object_store_bucket__store_bucket)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket>())).obj as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket__store_bucket>())).free_list
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket__store_bucket),
            "::",
            stringify!(free_list)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_object_store_bucket() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_store_bucket>(),
        64usize,
        concat!("Size of: ", stringify!(_zend_object_store_bucket))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_store_bucket>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_store_bucket))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket>())).destructor_called as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket),
            "::",
            stringify!(destructor_called)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_store_bucket>())).valid as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket>())).apply_count as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket),
            "::",
            stringify!(apply_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_store_bucket>())).bucket as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_store_bucket),
            "::",
            stringify!(bucket)
        )
    );
}
pub type zend_object_store_bucket = _zend_object_store_bucket;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_objects_store {
    pub object_buckets: *mut zend_object_store_bucket,
    pub top: zend_uint,
    pub size: zend_uint,
    pub free_list_head: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_objects_store() {
    assert_eq!(
        ::std::mem::size_of::<_zend_objects_store>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_objects_store))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_objects_store>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_objects_store))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_objects_store>())).object_buckets as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(object_buckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_objects_store>())).top as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_objects_store>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_objects_store>())).free_list_head as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(free_list_head)
        )
    );
}
pub type zend_objects_store = _zend_objects_store;
extern "C" {
    pub fn zend_objects_store_init(objects: *mut zend_objects_store, init_size: zend_uint);
}
extern "C" {
    pub fn zend_objects_store_call_destructors(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_mark_destructed(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_destroy(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_put(
        object: *mut ::std::os::raw::c_void,
        dtor: zend_objects_store_dtor_t,
        storage: zend_objects_free_object_storage_t,
        clone: zend_objects_store_clone_t,
    ) -> zend_object_handle;
}
extern "C" {
    pub fn zend_objects_store_add_ref(object: *mut zval);
}
extern "C" {
    pub fn zend_objects_store_del_ref(object: *mut zval);
}
extern "C" {
    pub fn zend_objects_store_add_ref_by_handle(handle: zend_object_handle);
}
extern "C" {
    pub fn zend_objects_store_del_ref_by_handle_ex(
        handle: zend_object_handle,
        handlers: *const zend_object_handlers,
    );
}
extern "C" {
    pub fn zend_objects_store_get_refcount(object: *mut zval) -> zend_uint;
}
extern "C" {
    pub fn zend_objects_store_clone_obj(object: *mut zval) -> zend_object_value;
}
extern "C" {
    pub fn zend_object_store_get_object(object: *const zval) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_object_store_get_object_by_handle(
        handle: zend_object_handle,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_object_store_set_object(zobject: *mut zval, object: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_object_store_ctor_failed(zobject: *mut zval);
}
extern "C" {
    pub fn zend_objects_store_free_object_storage(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_object_create_proxy(object: *mut zval, member: *mut zval) -> *mut zval;
}
extern "C" {
    pub fn zend_get_std_object_handlers() -> *mut zend_object_handlers;
}
extern "C" {
    pub fn zend_init_fpu();
}
extern "C" {
    pub fn zend_shutdown_fpu();
}
extern "C" {
    pub fn zend_ensure_fpu_mode();
}
pub type fpu_control_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_encoding {
    _unused: [u8; 0],
}
pub type zend_encoding = _zend_encoding;
pub type zend_encoding_filter = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *mut *mut ::std::os::raw::c_uchar,
        str_length: *mut size_t,
        buf: *const ::std::os::raw::c_uchar,
        length: size_t,
    ) -> size_t,
>;
pub type zend_encoding_fetcher = ::std::option::Option<
    unsafe extern "C" fn(encoding_name: *const ::std::os::raw::c_char) -> *const zend_encoding,
>;
pub type zend_encoding_name_getter = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> *const ::std::os::raw::c_char,
>;
pub type zend_encoding_lexer_compatibility_checker = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> ::std::os::raw::c_int,
>;
pub type zend_encoding_detector = ::std::option::Option<
    unsafe extern "C" fn(
        string: *const ::std::os::raw::c_uchar,
        length: size_t,
        list: *mut *const zend_encoding,
        list_size: size_t,
    ) -> *const zend_encoding,
>;
pub type zend_encoding_converter = ::std::option::Option<
    unsafe extern "C" fn(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut size_t,
        from: *const ::std::os::raw::c_uchar,
        from_length: size_t,
        encoding_to: *const zend_encoding,
        encoding_from: *const zend_encoding,
    ) -> size_t,
>;
pub type zend_encoding_list_parser = ::std::option::Option<
    unsafe extern "C" fn(
        encoding_list: *const ::std::os::raw::c_char,
        encoding_list_len: size_t,
        return_list: *mut *mut *const zend_encoding,
        return_size: *mut size_t,
        persistent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_encoding_internal_encoding_getter =
    ::std::option::Option<unsafe extern "C" fn() -> *const zend_encoding>;
pub type zend_encoding_internal_encoding_setter = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_multibyte_functions {
    pub provider_name: *const ::std::os::raw::c_char,
    pub encoding_fetcher: zend_encoding_fetcher,
    pub encoding_name_getter: zend_encoding_name_getter,
    pub lexer_compatibility_checker: zend_encoding_lexer_compatibility_checker,
    pub encoding_detector: zend_encoding_detector,
    pub encoding_converter: zend_encoding_converter,
    pub encoding_list_parser: zend_encoding_list_parser,
    pub internal_encoding_getter: zend_encoding_internal_encoding_getter,
    pub internal_encoding_setter: zend_encoding_internal_encoding_setter,
}
#[test]
fn bindgen_test_layout__zend_multibyte_functions() {
    assert_eq!(
        ::std::mem::size_of::<_zend_multibyte_functions>(),
        72usize,
        concat!("Size of: ", stringify!(_zend_multibyte_functions))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_multibyte_functions>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_multibyte_functions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).provider_name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(provider_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_fetcher as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_fetcher)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_name_getter as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_name_getter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).lexer_compatibility_checker
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(lexer_compatibility_checker)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_detector as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_detector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_converter as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_converter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_list_parser as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_list_parser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).internal_encoding_getter
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(internal_encoding_getter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).internal_encoding_setter
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(internal_encoding_setter)
        )
    );
}
pub type zend_multibyte_functions = _zend_multibyte_functions;
extern "C" {
    pub static mut zend_multibyte_encoding_utf32be: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf32le: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf16be: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf16le: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf8: *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_set_functions(
        functions: *const zend_multibyte_functions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_get_functions() -> *const zend_multibyte_functions;
}
extern "C" {
    pub fn zend_multibyte_fetch_encoding(
        name: *const ::std::os::raw::c_char,
    ) -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_get_encoding_name(
        encoding: *const zend_encoding,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_multibyte_check_lexer_compatibility(
        encoding: *const zend_encoding,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_encoding_detector(
        string: *const ::std::os::raw::c_uchar,
        length: size_t,
        list: *mut *const zend_encoding,
        list_size: size_t,
    ) -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_encoding_converter(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut size_t,
        from: *const ::std::os::raw::c_uchar,
        from_length: size_t,
        encoding_to: *const zend_encoding,
        encoding_from: *const zend_encoding,
    ) -> size_t;
}
extern "C" {
    pub fn zend_multibyte_parse_encoding_list(
        encoding_list: *const ::std::os::raw::c_char,
        encoding_list_len: size_t,
        return_list: *mut *mut *const zend_encoding,
        return_size: *mut size_t,
        persistent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_get_internal_encoding() -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_get_script_encoding() -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_set_script_encoding(
        encoding_list: *mut *const zend_encoding,
        encoding_list_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_set_internal_encoding(
        encoding: *const zend_encoding,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_set_script_encoding_by_string(
        new_value: *const ::std::os::raw::c_char,
        new_value_length: size_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_declarables {
    pub ticks: zval,
}
#[test]
fn bindgen_test_layout__zend_declarables() {
    assert_eq!(
        ::std::mem::size_of::<_zend_declarables>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_declarables))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_declarables>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_declarables))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_declarables>())).ticks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_declarables),
            "::",
            stringify!(ticks)
        )
    );
}
pub type zend_declarables = _zend_declarables;
pub type zend_vm_stack = *mut _zend_vm_stack;
pub type zend_ini_entry = _zend_ini_entry;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_executor_globals {
    pub return_value_ptr_ptr: *mut *mut zval,
    pub uninitialized_zval: zval,
    pub uninitialized_zval_ptr: *mut zval,
    pub error_zval: zval,
    pub error_zval_ptr: *mut zval,
    pub symtable_cache: [*mut HashTable; 32usize],
    pub symtable_cache_limit: *mut *mut HashTable,
    pub symtable_cache_ptr: *mut *mut HashTable,
    pub opline_ptr: *mut *mut zend_op,
    pub active_symbol_table: *mut HashTable,
    pub symbol_table: HashTable,
    pub included_files: HashTable,
    pub bailout: *mut jmp_buf,
    pub error_reporting: ::std::os::raw::c_int,
    pub orig_error_reporting: ::std::os::raw::c_int,
    pub exit_status: ::std::os::raw::c_int,
    pub active_op_array: *mut zend_op_array,
    pub function_table: *mut HashTable,
    pub class_table: *mut HashTable,
    pub zend_constants: *mut HashTable,
    pub scope: *mut zend_class_entry,
    pub called_scope: *mut zend_class_entry,
    pub This: *mut zval,
    pub precision: ::std::os::raw::c_long,
    pub ticks_count: ::std::os::raw::c_int,
    pub in_execution: zend_bool,
    pub in_autoload: *mut HashTable,
    pub autoload_func: *mut zend_function,
    pub full_tables_cleanup: zend_bool,
    pub no_extensions: zend_bool,
    pub regular_list: HashTable,
    pub persistent_list: HashTable,
    pub argument_stack: zend_vm_stack,
    pub user_error_handler_error_reporting: ::std::os::raw::c_int,
    pub user_error_handler: *mut zval,
    pub user_exception_handler: *mut zval,
    pub user_error_handlers_error_reporting: zend_stack,
    pub user_error_handlers: zend_ptr_stack,
    pub user_exception_handlers: zend_ptr_stack,
    pub error_handling: zend_error_handling_t,
    pub exception_class: *mut zend_class_entry,
    pub timeout_seconds: ::std::os::raw::c_int,
    pub lambda_count: ::std::os::raw::c_int,
    pub ini_directives: *mut HashTable,
    pub modified_ini_directives: *mut HashTable,
    pub error_reporting_ini_entry: *mut zend_ini_entry,
    pub objects_store: zend_objects_store,
    pub exception: *mut zval,
    pub prev_exception: *mut zval,
    pub opline_before_exception: *mut zend_op,
    pub exception_op: [zend_op; 3usize],
    pub current_execute_data: *mut _zend_execute_data,
    pub current_module: *mut _zend_module_entry,
    pub std_property_info: zend_property_info,
    pub active: zend_bool,
    pub start_op: *mut zend_op,
    pub saved_fpu_cw_ptr: *mut ::std::os::raw::c_void,
    pub saved_fpu_cw: fpu_control_t,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout__zend_executor_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_executor_globals>(),
        1264usize,
        concat!("Size of: ", stringify!(_zend_executor_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_executor_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_executor_globals))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_executor_globals>())).return_value_ptr_ptr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_executor_globals),
            "::",
