/* automatically generated by rust-bindgen 0.57.0 */

#![allow(
    non_upper_case_globals,
    non_camel_case_types,
    non_snake_case,
    clashing_extern_declarations
)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

pub const ZEND_LOGO_DATA_URI : & 'static [u8 ; 6083usize] = b"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAPoAAAAvCAYAAADKH9ehAAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAEWJJREFUeNrsXQl0VNUZvjNJSAgEAxHCGsNitSBFxB1l0boUW1pp3VAUrKLWKgUPUlEB13K0Yq1alaXWuh5EadWK1F0s1gJaoaCgQDRKBBJDVhKSzPR+zPfg5vLevCUzmZnwvnP+k8ybN3fevfff73/vBAJTHxc+khL5kr6T1ODk5nAgTRTWloghFVtEg/zfh2PkSvq9pJGSKiX9SdKittbJoD/PSYkrJD0vKeB4IsNNotfuUtHk/CM+IvijpF9KGiDpGEkLJZ3lC7qPeKKTpD9IWiDpUOfWPCi61ZeLvD2VIhTwp9QlTjK5NsIXdB/xxHmSpvD/OucWPSAyQw2+LfeG1SbXVra1Tqb785xUaNdMel0g7Iu5V1zPv6dJqpD0kKR/+ILuI55o8oeg1bFT0kWSOkraQxK+oPvw0TZR3ZY758foyQXf//ZxUFh0Q/GEfNf9gHkaJ6m7pHJJSyTt9tnXhxtBR2EGlnHCMbZMaHuHzX19JZ0u6VRJh0k6hM+BpMjnklZIelPSNhff3V5StkNlEWBMFm+3LcC+BW3GuZP2GvfmiEiCCMUzxZIKRGSt9zeML/fdGAW9JB3O8c6SlMZ+b5f0qaQiF7EpnieXY1auvZfG7zhSUk8RSS428F7M5xfsh1eAV/vxOzoq16sklZBqbdpo5H2qDPRQXoP3Ki0+20FSFyrZUgt+Rt/7KH2vZb8/t/iMG2Sy/0dI6sbvgHGoV8a3xErQb5Q0iTfHCplkzlkW7w+VNF3ST7QJUzFK0pVkDFiw+yV95uC7r5Z0k3CW2ApwIkrJ9B9IelfSh2SIlqC/pDFUZAVk0rQoMhk2GYswx+AtWvMKPtcyEckW37pPwsIHNAuBniDpYhEpBMmJwvibJL0gIlVh39r0C8UlczkXQ/mM6OtEzuf3RfPVAxUY47f5PStcGKPxpOMldbbxiBptPMavJX1PuQ/P/olyz12S7rD4PLyqBTQ8gyXVSOot6VK+dxR53wyl7POjkv7pkpcwpleJSCHP4eQjM0BB/ZuG4Hl9EO8mQx4ZQ0FfL+k+k+t4wNlULpkO24IGnSzpQklzKPDRAMvZ1eXz9uXfH/Pvx5Ie44C5zYQXUgDPj6LEnMCQ3AFkjjupjGF9/kJmxPw1oiquz+6dalXcCRSmYxwK0kDSRI71azb3Y+6GiMi6P/5ey3F3YpExjxdQoG61uX8gBetkh2OWFkUIVGUT1pS9yosZNu1nkl8uZH+mikhxkx1wz7mkB0WkXsKJFw1ZuSWKotY9wjNJS6mUy41JK5P0c2qCnBgIeQWZvEK7Dnf6WUljTT5TS7d0KwezkJShdWIeGeuKKJo7FktUQylcl0i6RtL/HH4OjP+wB0UTLTGHfubRDWyi1g7SaoZQ495z9w7RpaHKqHEfLeklEyWzk+7dl3TTu1KQCpV7+pBB4IWstFFAgvOpJnTL6DoW0xPbw3k/nIYkW+kbmHeXhUEABklazrBDBdzTDfyuBo5DPq1eoUk7ZbSk70l6n3MZjUdCDpQvMF/rezn7/hX7Xs8wsj/7rsrWdQxnZtrwwENUosJkDDZxTjOUkEH1ds6lzJyDZzGScRsonGNcMCIG+WgRKTRQ8Su2p7uRi/mlKjZKekREChS2KIOcTvfqp3RZDlM+cxnfv8Thc75Pt8kqo92VzNTbxBqcQlceivAdByHDIxbvFTMOLovyHAGGK3qc/jJDoDc4hpjABzBm4UAglBFqEAOqt8mB29ss4uJnNCHfSK/tVZMYEfMykt7Bcco1eDLDHCT8gmzzRdLHZL6wRSgzg6GIgVl8Xj2uhPA+oQn53yTdK2mVMC8NzuJ8zaSyM/ApxyzWCFJRvUQ3eQ29BTNFcRgt+FTl2g30zDZZtD/ZRMifE5ES6Y9MxqAHQ7XZikI9nd97j5p1f83GZTPr6Crt2sOcOB1zTYT8HrqjVRZx4wbSAt47SXn/YsZV9zp4zuvJgNGQRaszmoN1rBY6IH4dHiVHcA5dZd2zeIbPv8ZBkghYTQFTx/h1WvSz6c3kM5ewGG8Prvxc5DZWS2u+dypnM5Y3sIJMXmbxfXW0misZN56oxITnWsyl2fg+6+C+zWTefMWr68RwaYF271htHBZqCsKqL28wB/ACjYShrE9nUjfWmEU33A7woqbR4k5UlNk4yoYOzOHvtGs30KO1QgnlZC2VohGOIGn7WEvW0ZdoMeCHfBgdo8X++m3V+s2wEHKzJMblJom92+ne2SHDwT1gknUispPpJLrrVZqwLxTmy5F5jOdVS72F/b6UwlbrcEytrD00+a8l/ZUM82jEZd8peu8uNYS8JxNWqis5IYqQCy1rPUULh8Y7fOYal3zzmPb6aJN7zlf+32bBV9ESclNE85WUX4j4oNbl/fM1b2eoxX3jyXNqiDTP4Xe8Rm9ItfSjvAr6DM0d+o5MXW/CuHO0a7eZTLYT3KF9LktYZ/WdCI+IkoV+lFZ6l3J9OF14HdM0F3MrhXxFjJmqhh5FBera24XqxaCqL0UosK97Z2ku+yJaEqf4D62ByoROcjZuN78Xaa9zTBSzKvxvC+vlrmgWVPU2h4j4FCO5lZ+vNBnpYHHfOOX/PfR83eApTaGM8CLop5l88WSLWAOu4AiNme5owcBO1xhlLGO/eGAFkyYqrtFe5zKzqU7KBE5o/BAIiv7VJSK7qV4GhEF1XtSk0YseWl6lWYI+cXj6pigJLkH3Vk0qfebxe4q0JGOGSDxCWn/Nchk9qJgMfGKS87LDes1IHeVW0LszgaC6sPMYE5lBt4CzRcuy4lVMLKlWfWwcJ+YpxtcGjtOYfzRjTgNIlv0rnpyCveeHNFSJ/jUlonH/3nNYqyOU28qYhHOLbzVPqFc81JQDKxnQ5twLdmjfmQzlxU6eoZ/mma3y8D3VonlhUr6bElhMwJ81RseSxW+jfOYULdYGAw5s4WBtpeU0ijKwxnp/HCfn70piCNlMFEUU8/WpmnZe1Bq80r96m5yMkIwx9nnNHTWFs114q0ArM1HsiUY7j5/rKFIThdrrzR7agHyoy9vd3Ag64uEfKa+xjIKlLqtTUBB7FWgJrQ9joFl1d2cQ2wzHaeDXa6/ztO9Wx+OT+FrzSAKuV12ptOZp+ljnaVawk8uxDpnMZXYCGB3PXqe5sl7QQ5ubhhQR9B4mQpvjIR+gJgrbOxV0rK/rVUyXmyRWdI2a2YLEhVP3BwmN9sJ9BtQpKkxiSDOrUeUhaeQaPevKzKQ3oIVTSGatcynoRl29sIkh440a8pURNoz00Ab4Ts1obxCps1FKl8k5IpKbcmsgu6nz6ETQC+iSqoKKOPmVJBmYnDjHX4EozB9s7TgwykkyYS13URAHpmstYIloOP/HEi6Wx5a4+DwSpH2V18tTyHUPm3iQeS1s09ai4/0ntVgNRQmzHTRulGwaQNnei3FgHqPcMBEJlXrNioAaE8AcupKBd7ElBu1uTxCzg+dmKB4TahiQNX/OxssAb00Uzdeci4S3FYhEQdfkWCrc1cI2K+2EDhsP1OUxZGUnOWTmcgphV0UgZ4jUR1hLlBiuJfqJpb61CXimOrq8RqiEeu6TU3iMwdzYgWhUnWHDDKr0ptLar6USqmOfYYiGMMTUN/KgziGVTo+pNJHBBfF0zVAQc6N2DUL+tcO2Yc1Rk2ss+yBmOko43yCSCljJXAWA7PD4eAt6MBy2yiNACRvVVN05t40pPLYPsT+zlRDpOLG/Jt8OSGKhmnBpivV7q/Y6JkucVgkyWKb52rVZwl0tvNDi+AzRvKjfK1Dnjvpd1FhPEc1LBVsbqENXN35cFaPY2BIVGdlWYZKqgPPj/RythNtpcNycpoOxwAae0bGwhAkAQg01cfiDWDRqZtHhCqFQ5FAtOXKXh/Yh6Ci2N5YMUDW2SHg/N3scn02N++cnMIZCBdwS9gtApRxqDc6OlzWtSrdc8cJGlzP5fzZDri1tQNixISWL/5fSQvcVzfe/wzXfSG8Kuw03pHB/t5KMik+EYJ1EC1d0zCw6fofqRI2ZJwpvyxN4uPs0q/6UR2szyESobxatf3aa7jvfrT0DGPNpYV3H3CI0BYLGllQdy7TX14rUP/zzDHpuRp0EPLnJvH68Qij/RXnyIyku5Ea+5S3NO7s01q77eMY1qqY8T7Qs+4qtq+o2UWhjZO6HuWhjJBlZXWbAHvbFSTAxqMW+RbuG3VfviAP36tshujINh6Tr3kE0BNMl5x8Qq6+mVTdwrMlzpRrGaGPzVpw9NDNFngjoFZZzRCS/FRPXHRZT31X2MgfYTQYX1WE1moaaQJfKEFTs/camkXnUwt9YtNWPiuc67VmRlb0yiRgS/cAe7is0QXuTAm9kikM2DNc5OkeGRaMU8tq0TJHbUCOtezMeRfITiSv1PLLbGE5gb/NOB/1AuR1KlLETDltidyR4XIPasyEnc6eIbRa9kfNifFeXJOAnVJBiKfFCvobcLKccLHWojHJpIPH3iXQlpoNLrdcH44sucvmQOHHjZ9rDrGdbixVmbk/XGy4mtiKuoQDjmQpFJLs6wuSZvqKmL0ky6zOZLry+420UKUaue5ooyeqy9+iopgM989cp1Dcp16bSU1tOJbyFyjedTID5wOk6OAUFFXUDKFRLkmBM3xH7fzIJwPLsxexDMWP2b8g38DqN45ywCuH0VNuv+XmjwOYCjtUakbg6AkGlNoQGBMB5A9g8hh2g7zFE2U4F35FxfHfmwwbxcz3Yl32C/oAwPwDAS6UXdpOhXPZ27Trc9R/SLTla0zzGoXl2QAexnLVZJB/CZMpV7HthfL4lJIrb54u+tdv3/rCiSbw+k88yM9ZxXgKwlHmZycq13iSr0KeMHmUZw6r1VICrLT4D5fy4wq/5DAvfjaWC9oAd9KxwTNUJynUjL+EqpwSTME1zOWMBuIxmZ7p9RCsNq+NmdxW09I1MdNkJeYZNHsIt0qKEO2Z4kvmHadS+Xqv2cqzc93rpuhdl54tg2DISuJljBW3uZjMHrAPqHOYK6zPIM23G2+14Rts4cyLbdxo3Y667UskOo/W/m/PwRhQBwZFkT2vXzDbTtLMZCyfP1155bbfDrpjKZoYH41bO+d97jmEgMPVxFMF0iHESIkiNtDhKuwV058cw0dBZNP+lFsSU/6VWf0E4P/x+IF2eJnokr4uW/2jAKPYjjRb7Cxef70c3qsCl0im1Gj/Uu2eF6sWo0rUiTQq7zS+pYjywnXYwcyOZfI4mKgHj9N2ttHqbRfSlQXhjw5XXy4S7ZbzOovkxVRsphHp8ia3HlyleZS1zHcvoVrdjuNFdEe7edGHzSbpSria/WZ3+cxYV5DCx/4w7FUfyfTW0WO+i7x2YrzKUXZFw/sut+OxJDGkHUxEZPwgCquQcIgxZR9oXekDQk8FF60bqwocupaIoEz6EmaC3C+0Ro6Wgp4eb2tpPJqN+4xXFXQ3TfUfCc5PDNnLZDpLIV1NADKyjZa87mHgmWX57bYdIfIY3pdCGf43xQUXI62kBn3fZxi4SPC8crIjDQ4yzFAaz/XcPJn7xf03VRzIB5Z7qCbBzPQi5jga2E9bCD+ELug8ficEZCk/Cmj8Ro3aLtLxDR1/QffhIHNRTUZCf+S5G7SJBp2b7G31B9+EjcVAFEInZQ2LU7jiN1zf4gu7DR+KwTvkfO9bGx6BNnEQ8XXmN5cT3fEH34SNxwN4A9dgknIEwyWNbeRTwV7WYHBVwFQfbwKb7vOUjiYAiKVT1PczXqCLD/n5UbuLcNxTKoCgExSFNmsFCHI6iJBQFnUbqqbWPHyFceDAOrC/oPpIN+FVaVLrNUa6dLPbvoEQdO4pd1OUylBVkCutsOkqosbNvwcE6qL6g+0hG3MY4ejots1pT3kE4P9QDdfuLKeDfHswD6gu6j2TF2yQcLoqEGurre9EdP1QTfmxJRdn0NlrvD+jmY69Egz+UQvxfgAEALJ4EcRDa/toAAAAASUVORK5CYII=\0" ;
pub const ZEND_EXTENSION_API_NO: u32 = 320151012;
pub const ZEND_EXTMSG_NEW_EXTENSION: u32 = 1;
pub const ZEND_EXTENSIONS_HAVE_OP_ARRAY_CTOR: u32 = 1;
pub const ZEND_EXTENSIONS_HAVE_OP_ARRAY_DTOR: u32 = 2;
pub const ZEND_EXTENSIONS_HAVE_OP_ARRAY_HANDLER: u32 = 4;
pub const ZEND_EXTENSIONS_HAVE_OP_ARRAY_PERSIST_CALC: u32 = 8;
pub const ZEND_EXTENSIONS_HAVE_OP_ARRAY_PERSIST: u32 = 16;
pub type size_t = ::std::os::raw::c_ulong;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type time_t = __time_t;
pub type uint = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub const FP_INT_UPWARD: ::std::os::raw::c_uint = 0;
pub const FP_INT_DOWNWARD: ::std::os::raw::c_uint = 1;
pub const FP_INT_TOWARDZERO: ::std::os::raw::c_uint = 2;
pub const FP_INT_TONEARESTFROMZERO: ::std::os::raw::c_uint = 3;
pub const FP_INT_TONEAREST: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: ::std::os::raw::c_uint = 0;
pub const FP_INFINITE: ::std::os::raw::c_uint = 1;
pub const FP_ZERO: ::std::os::raw::c_uint = 2;
pub const FP_SUBNORMAL: ::std::os::raw::c_uint = 3;
pub const FP_NORMAL: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub type va_list = __builtin_va_list;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
pub const RTLD_DL_SYMENT: ::std::os::raw::c_uint = 1;
pub const RTLD_DL_LINKMAP: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const RTLD_DI_LMID: ::std::os::raw::c_uint = 1;
pub const RTLD_DI_LINKMAP: ::std::os::raw::c_uint = 2;
pub const RTLD_DI_CONFIGADDR: ::std::os::raw::c_uint = 3;
pub const RTLD_DI_SERINFO: ::std::os::raw::c_uint = 4;
pub const RTLD_DI_SERINFOSIZE: ::std::os::raw::c_uint = 5;
pub const RTLD_DI_ORIGIN: ::std::os::raw::c_uint = 6;
pub const RTLD_DI_PROFILENAME: ::std::os::raw::c_uint = 7;
pub const RTLD_DI_PROFILEOUT: ::std::os::raw::c_uint = 8;
pub const RTLD_DI_TLS_MODID: ::std::os::raw::c_uint = 9;
pub const RTLD_DI_TLS_DATA: ::std::os::raw::c_uint = 10;
pub const RTLD_DI_MAX: ::std::os::raw::c_uint = 10;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub type zend_long = i64;
pub type zend_ulong = u64;
pub type zend_off_t = i64;
extern "C" {
    pub static long_min_digits: [::std::os::raw::c_char; 20usize];
}
pub type zend_bool = ::std::os::raw::c_uchar;
pub type zend_uchar = ::std::os::raw::c_uchar;
pub const ZEND_RESULT_CODE_SUCCESS: ZEND_RESULT_CODE = 0;
pub const ZEND_RESULT_CODE_FAILURE: ZEND_RESULT_CODE = -1;
pub type ZEND_RESULT_CODE = ::std::os::raw::c_int;
pub type zend_intptr_t = isize;
pub type zend_uintptr_t = usize;
pub type zend_object_handlers = _zend_object_handlers;
pub type zend_class_entry = _zend_class_entry;
pub type zend_function = _zend_function;
pub type zend_execute_data = _zend_execute_data;
pub type zval = _zval_struct;
pub type zend_refcounted = _zend_refcounted;
pub type zend_string = _zend_string;
pub type zend_array = _zend_array;
pub type zend_object = _zend_object;
pub type zend_resource = _zend_resource;
pub type zend_reference = _zend_reference;
pub type zend_ast_ref = _zend_ast_ref;
pub type zend_ast = _zend_ast;
pub type compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type swap_func_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_void),
>;
pub type sort_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: size_t,
        arg3: size_t,
        arg4: compare_func_t,
        arg5: swap_func_t,
    ),
>;
pub type dtor_func_t = ::std::option::Option<unsafe extern "C" fn(pDest: *mut zval)>;
pub type copy_ctor_func_t = ::std::option::Option<unsafe extern "C" fn(pElement: *mut zval)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_value {
    pub lval: zend_long,
    pub dval: f64,
    pub counted: *mut zend_refcounted,
    pub str_: *mut zend_string,
    pub arr: *mut zend_array,
    pub obj: *mut zend_object,
    pub res: *mut zend_resource,
    pub ref_: *mut zend_reference,
    pub ast: *mut zend_ast_ref,
    pub zv: *mut zval,
    pub ptr: *mut ::std::os::raw::c_void,
    pub ce: *mut zend_class_entry,
    pub func: *mut zend_function,
    pub ww: _zend_value__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_value__bindgen_ty_1 {
    pub w1: u32,
    pub w2: u32,
}
#[test]
fn bindgen_test_layout__zend_value__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_value__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_value__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_value__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_value__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value__bindgen_ty_1>())).w1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value__bindgen_ty_1),
            "::",
            stringify!(w1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value__bindgen_ty_1>())).w2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value__bindgen_ty_1),
            "::",
            stringify!(w2)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_value() {
    assert_eq!(
        ::std::mem::size_of::<_zend_value>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_value))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_value>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_value))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).lval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(lval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).dval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(dval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).counted as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(counted)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).arr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(arr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).obj as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).res as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(res)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).ref_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).ast as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(ast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).zv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(zv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).ce as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).func as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_value>())).ww as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_value),
            "::",
            stringify!(ww)
        )
    );
}
pub type zend_value = _zend_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zval_struct {
    pub value: zend_value,
    pub u1: _zval_struct__bindgen_ty_1,
    pub u2: _zval_struct__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_struct__bindgen_ty_1 {
    pub v: _zval_struct__bindgen_ty_1__bindgen_ty_1,
    pub type_info: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zval_struct__bindgen_ty_1__bindgen_ty_1 {
    pub type_: zend_uchar,
    pub type_flags: zend_uchar,
    pub const_flags: zend_uchar,
    pub reserved: zend_uchar,
}
#[test]
fn bindgen_test_layout__zval_struct__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_struct__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1__bindgen_ty_1>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1__bindgen_ty_1>())).type_flags
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(type_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1__bindgen_ty_1>())).const_flags
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(const_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1__bindgen_ty_1>())).reserved
                as *const _ as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(reserved)
        )
    );
}
#[test]
fn bindgen_test_layout__zval_struct__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zval_struct__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_zval_struct__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_struct__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_zval_struct__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_1>())).type_info as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_1),
            "::",
            stringify!(type_info)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zval_struct__bindgen_ty_2 {
    pub var_flags: u32,
    pub next: u32,
    pub cache_slot: u32,
    pub lineno: u32,
    pub num_args: u32,
    pub fe_pos: u32,
    pub fe_iter_idx: u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__zval_struct__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_zval_struct__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(_zval_struct__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_struct__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_zval_struct__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).var_flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(var_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).cache_slot as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(cache_slot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).lineno as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).num_args as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).fe_pos as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(fe_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zval_struct__bindgen_ty_2>())).fe_iter_idx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct__bindgen_ty_2),
            "::",
            stringify!(fe_iter_idx)
        )
    );
}
#[test]
fn bindgen_test_layout__zval_struct() {
    assert_eq!(
        ::std::mem::size_of::<_zval_struct>(),
        16usize,
        concat!("Size of: ", stringify!(_zval_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<_zval_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(_zval_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).u1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(u1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zval_struct>())).u2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zval_struct),
            "::",
            stringify!(u2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_refcounted_h {
    pub refcount: u32,
    pub u: _zend_refcounted_h__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_refcounted_h__bindgen_ty_1 {
    pub v: _zend_refcounted_h__bindgen_ty_1__bindgen_ty_1,
    pub type_info: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_refcounted_h__bindgen_ty_1__bindgen_ty_1 {
    pub type_: zend_uchar,
    pub flags: zend_uchar,
    pub gc_info: u16,
}
#[test]
fn bindgen_test_layout__zend_refcounted_h__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1>())).type_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1>())).flags
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1>())).gc_info
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(gc_info)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_refcounted_h__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_refcounted_h__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_zend_refcounted_h__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_refcounted_h__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_refcounted_h__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_refcounted_h__bindgen_ty_1>())).v as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_refcounted_h__bindgen_ty_1>())).type_info as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h__bindgen_ty_1),
            "::",
            stringify!(type_info)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_refcounted_h() {
    assert_eq!(
        ::std::mem::size_of::<_zend_refcounted_h>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_refcounted_h))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_refcounted_h>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_refcounted_h))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_refcounted_h>())).refcount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_refcounted_h>())).u as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted_h),
            "::",
            stringify!(u)
        )
    );
}
pub type zend_refcounted_h = _zend_refcounted_h;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_refcounted {
    pub gc: zend_refcounted_h,
}
#[test]
fn bindgen_test_layout__zend_refcounted() {
    assert_eq!(
        ::std::mem::size_of::<_zend_refcounted>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_refcounted))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_refcounted>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_refcounted))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_refcounted>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_refcounted),
            "::",
            stringify!(gc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_string {
    pub gc: zend_refcounted_h,
    pub h: zend_ulong,
    pub len: size_t,
    pub val: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout__zend_string() {
    assert_eq!(
        ::std::mem::size_of::<_zend_string>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_string))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_string>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_string))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_string>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_string),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_string>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_string),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_string>())).len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_string),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_string>())).val as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_string),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _Bucket {
    pub val: zval,
    pub h: zend_ulong,
    pub key: *mut zend_string,
}
#[test]
fn bindgen_test_layout__Bucket() {
    assert_eq!(
        ::std::mem::size_of::<_Bucket>(),
        32usize,
        concat!("Size of: ", stringify!(_Bucket))
    );
    assert_eq!(
        ::std::mem::align_of::<_Bucket>(),
        8usize,
        concat!("Alignment of ", stringify!(_Bucket))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Bucket>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bucket),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Bucket>())).h as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bucket),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_Bucket>())).key as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bucket),
            "::",
            stringify!(key)
        )
    );
}
pub type Bucket = _Bucket;
pub type HashTable = _zend_array;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_array {
    pub gc: zend_refcounted_h,
    pub u: _zend_array__bindgen_ty_1,
    pub nTableMask: u32,
    pub arData: *mut Bucket,
    pub nNumUsed: u32,
    pub nNumOfElements: u32,
    pub nTableSize: u32,
    pub nInternalPointer: u32,
    pub nNextFreeElement: zend_long,
    pub pDestructor: dtor_func_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_array__bindgen_ty_1 {
    pub v: _zend_array__bindgen_ty_1__bindgen_ty_1,
    pub flags: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_array__bindgen_ty_1__bindgen_ty_1 {
    pub flags: zend_uchar,
    pub nApplyCount: zend_uchar,
    pub nIteratorsCount: zend_uchar,
    pub reserve: zend_uchar,
}
#[test]
fn bindgen_test_layout__zend_array__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_array__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_array__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_array__bindgen_ty_1__bindgen_ty_1>())).flags as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_array__bindgen_ty_1__bindgen_ty_1>())).nApplyCount
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(nApplyCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_array__bindgen_ty_1__bindgen_ty_1>())).nIteratorsCount
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(nIteratorsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_array__bindgen_ty_1__bindgen_ty_1>())).reserve as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(reserve)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_array__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_array__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_zend_array__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_array__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_array__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array__bindgen_ty_1>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array__bindgen_ty_1>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_array() {
    assert_eq!(
        ::std::mem::size_of::<_zend_array>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_array))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_array>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nTableMask as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nTableMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).arData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(arData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nNumUsed as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nNumUsed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nNumOfElements as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nNumOfElements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nTableSize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nTableSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nInternalPointer as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nInternalPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).nNextFreeElement as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(nNextFreeElement)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_array>())).pDestructor as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_array),
            "::",
            stringify!(pDestructor)
        )
    );
}
pub type HashPosition = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HashTableIterator {
    pub ht: *mut HashTable,
    pub pos: HashPosition,
}
#[test]
fn bindgen_test_layout__HashTableIterator() {
    assert_eq!(
        ::std::mem::size_of::<_HashTableIterator>(),
        16usize,
        concat!("Size of: ", stringify!(_HashTableIterator))
    );
    assert_eq!(
        ::std::mem::align_of::<_HashTableIterator>(),
        8usize,
        concat!("Alignment of ", stringify!(_HashTableIterator))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HashTableIterator>())).ht as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HashTableIterator),
            "::",
            stringify!(ht)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HashTableIterator>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HashTableIterator),
            "::",
            stringify!(pos)
        )
    );
}
pub type HashTableIterator = _HashTableIterator;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_object {
    pub gc: zend_refcounted_h,
    pub handle: u32,
    pub ce: *mut zend_class_entry,
    pub handlers: *const zend_object_handlers,
    pub properties: *mut HashTable,
    pub properties_table: [zval; 1usize],
}
#[test]
fn bindgen_test_layout__zend_object() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_object))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).ce as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).handlers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(handlers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).properties as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object>())).properties_table as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object),
            "::",
            stringify!(properties_table)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_resource {
    pub gc: zend_refcounted_h,
    pub handle: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_resource() {
    assert_eq!(
        ::std::mem::size_of::<_zend_resource>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_resource))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_resource>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_resource),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_resource>())).handle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_resource),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_resource>())).type_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_resource),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_resource>())).ptr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_resource),
            "::",
            stringify!(ptr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_reference {
    pub gc: zend_refcounted_h,
    pub val: zval,
}
#[test]
fn bindgen_test_layout__zend_reference() {
    assert_eq!(
        ::std::mem::size_of::<_zend_reference>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_reference))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_reference>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_reference))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_reference>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_reference),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_reference>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_reference),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_ref {
    pub gc: zend_refcounted_h,
    pub ast: *mut zend_ast,
}
#[test]
fn bindgen_test_layout__zend_ast_ref() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast_ref>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_ast_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast_ref))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_ref>())).gc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_ref),
            "::",
            stringify!(gc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_ref>())).ast as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_ref),
            "::",
            stringify!(ast)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_leak_info {
    pub addr: *mut ::std::os::raw::c_void,
    pub size: size_t,
    pub filename: *const ::std::os::raw::c_char,
    pub orig_filename: *const ::std::os::raw::c_char,
    pub lineno: uint,
    pub orig_lineno: uint,
}
#[test]
fn bindgen_test_layout__zend_leak_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_leak_info>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_leak_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_leak_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_leak_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).orig_filename as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(orig_filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).lineno as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_leak_info>())).orig_lineno as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_leak_info),
            "::",
            stringify!(orig_lineno)
        )
    );
}
pub type zend_leak_info = _zend_leak_info;
extern "C" {
    pub fn zend_strndup(
        s: *const ::std::os::raw::c_char,
        length: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _zend_mem_block_size(ptr: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    pub fn zend_set_memory_limit(memory_limit: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_memory_usage(real_usage: ::std::os::raw::c_int) -> size_t;
}
extern "C" {
    pub fn zend_memory_peak_usage(real_usage: ::std::os::raw::c_int) -> size_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_heap {
    _unused: [u8; 0],
}
pub type zend_mm_heap = _zend_mm_heap;
extern "C" {
    pub fn zend_mm_startup() -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_shutdown(
        heap: *mut zend_mm_heap,
        full_shutdown: ::std::os::raw::c_int,
        silent: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn _zend_mm_alloc(heap: *mut zend_mm_heap, size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _zend_mm_free(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _zend_mm_realloc(
        heap: *mut zend_mm_heap,
        p: *mut ::std::os::raw::c_void,
        size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _zend_mm_realloc2(
        heap: *mut zend_mm_heap,
        p: *mut ::std::os::raw::c_void,
        size: size_t,
        copy_size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _zend_mm_block_size(heap: *mut zend_mm_heap, p: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    pub fn zend_mm_set_heap(new_heap: *mut zend_mm_heap) -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_get_heap() -> *mut zend_mm_heap;
}
extern "C" {
    pub fn zend_mm_gc(heap: *mut zend_mm_heap) -> size_t;
}
extern "C" {
    pub fn zend_mm_is_custom_heap(new_heap: *mut zend_mm_heap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_mm_set_custom_handlers(
        heap: *mut zend_mm_heap,
        _malloc: ::std::option::Option<
            unsafe extern "C" fn(arg1: size_t) -> *mut ::std::os::raw::c_void,
        >,
        _free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: size_t,
            ) -> *mut ::std::os::raw::c_void,
        >,
    );
}
extern "C" {
    pub fn zend_mm_get_custom_handlers(
        heap: *mut zend_mm_heap,
        _malloc: *mut ::std::option::Option<
            unsafe extern "C" fn(arg1: size_t) -> *mut ::std::os::raw::c_void,
        >,
        _free: *mut ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        _realloc: *mut ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: size_t,
            ) -> *mut ::std::os::raw::c_void,
        >,
    );
}
pub type zend_mm_storage = _zend_mm_storage;
pub type zend_mm_chunk_alloc_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        size: size_t,
        alignment: size_t,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type zend_mm_chunk_free_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        size: size_t,
    ),
>;
pub type zend_mm_chunk_truncate_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        old_size: size_t,
        new_size: size_t,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_mm_chunk_extend_t = ::std::option::Option<
    unsafe extern "C" fn(
        storage: *mut zend_mm_storage,
        chunk: *mut ::std::os::raw::c_void,
        old_size: size_t,
        new_size: size_t,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_handlers {
    pub chunk_alloc: zend_mm_chunk_alloc_t,
    pub chunk_free: zend_mm_chunk_free_t,
    pub chunk_truncate: zend_mm_chunk_truncate_t,
    pub chunk_extend: zend_mm_chunk_extend_t,
}
#[test]
fn bindgen_test_layout__zend_mm_handlers() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mm_handlers>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_mm_handlers))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mm_handlers>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mm_handlers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_handlers>())).chunk_alloc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_handlers),
            "::",
            stringify!(chunk_alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_handlers>())).chunk_free as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_handlers),
            "::",
            stringify!(chunk_free)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_mm_handlers>())).chunk_truncate as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_handlers),
            "::",
            stringify!(chunk_truncate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_handlers>())).chunk_extend as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_handlers),
            "::",
            stringify!(chunk_extend)
        )
    );
}
pub type zend_mm_handlers = _zend_mm_handlers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mm_storage {
    pub handlers: zend_mm_handlers,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_mm_storage() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mm_storage>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_mm_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mm_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mm_storage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_storage>())).handlers as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_storage),
            "::",
            stringify!(handlers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mm_storage>())).data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mm_storage),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn zend_mm_get_storage(heap: *mut zend_mm_heap) -> *mut zend_mm_storage;
}
extern "C" {
    pub fn zend_mm_startup_ex(
        handlers: *const zend_mm_handlers,
        data: *mut ::std::os::raw::c_void,
        data_size: size_t,
    ) -> *mut zend_mm_heap;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist_element {
    pub next: *mut _zend_llist_element,
    pub prev: *mut _zend_llist_element,
    pub data: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout__zend_llist_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_llist_element>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_llist_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_llist_element>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_llist_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist_element>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist_element),
            "::",
            stringify!(data)
        )
    );
}
pub type zend_llist_element = _zend_llist_element;
pub type llist_dtor_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
pub type llist_compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut *const zend_llist_element,
        arg2: *mut *const zend_llist_element,
    ) -> ::std::os::raw::c_int,
>;
pub type llist_apply_with_args_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        num_args: ::std::os::raw::c_int,
        args: *mut __va_list_tag,
    ),
>;
pub type llist_apply_with_arg_func_t = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void, arg: *mut ::std::os::raw::c_void),
>;
pub type llist_apply_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_llist {
    pub head: *mut zend_llist_element,
    pub tail: *mut zend_llist_element,
    pub count: size_t,
    pub size: size_t,
    pub dtor: llist_dtor_func_t,
    pub persistent: ::std::os::raw::c_uchar,
    pub traverse_ptr: *mut zend_llist_element,
}
#[test]
fn bindgen_test_layout__zend_llist() {
    assert_eq!(
        ::std::mem::size_of::<_zend_llist>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_llist))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_llist>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_llist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).tail as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).dtor as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).persistent as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(persistent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_llist>())).traverse_ptr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_llist),
            "::",
            stringify!(traverse_ptr)
        )
    );
}
pub type zend_llist = _zend_llist;
pub type zend_llist_position = *mut zend_llist_element;
extern "C" {
    pub fn zend_llist_init(
        l: *mut zend_llist,
        size: size_t,
        dtor: llist_dtor_func_t,
        persistent: ::std::os::raw::c_uchar,
    );
}
extern "C" {
    pub fn zend_llist_add_element(l: *mut zend_llist, element: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_llist_prepend_element(l: *mut zend_llist, element: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_llist_del_element(
        l: *mut zend_llist,
        element: *mut ::std::os::raw::c_void,
        compare: ::std::option::Option<
            unsafe extern "C" fn(
                element1: *mut ::std::os::raw::c_void,
                element2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_llist_destroy(l: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_clean(l: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_remove_tail(l: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_copy(dst: *mut zend_llist, src: *mut zend_llist);
}
extern "C" {
    pub fn zend_llist_apply(l: *mut zend_llist, func: llist_apply_func_t);
}
extern "C" {
    pub fn zend_llist_apply_with_del(
        l: *mut zend_llist,
        func: ::std::option::Option<
            unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_llist_apply_with_argument(
        l: *mut zend_llist,
        func: llist_apply_with_arg_func_t,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_llist_apply_with_arguments(
        l: *mut zend_llist,
        func: llist_apply_with_args_func_t,
        num_args: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn zend_llist_count(l: *mut zend_llist) -> size_t;
}
extern "C" {
    pub fn zend_llist_sort(l: *mut zend_llist, comp_func: llist_compare_func_t);
}
extern "C" {
    pub fn zend_llist_get_first_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_last_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_next_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_llist_get_prev_ex(
        l: *mut zend_llist,
        pos: *mut zend_llist_position,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub static mut zend_new_interned_string:
        ::std::option::Option<unsafe extern "C" fn(str_: *mut zend_string) -> *mut zend_string>;
}
extern "C" {
    pub static mut zend_interned_strings_snapshot: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_interned_strings_restore: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub fn zend_hash_func(str_: *const ::std::os::raw::c_char, len: size_t) -> zend_ulong;
}
extern "C" {
    pub fn zend_interned_strings_init();
}
extern "C" {
    pub fn zend_interned_strings_dtor();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_hash_key {
    pub h: zend_ulong,
    pub key: *mut zend_string,
}
#[test]
fn bindgen_test_layout__zend_hash_key() {
    assert_eq!(
        ::std::mem::size_of::<_zend_hash_key>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_hash_key))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_hash_key>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_hash_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_hash_key>())).h as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_hash_key),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_hash_key>())).key as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_hash_key),
            "::",
            stringify!(key)
        )
    );
}
pub type zend_hash_key = _zend_hash_key;
pub type merge_checker_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        target_ht: *mut HashTable,
        source_data: *mut zval,
        hash_key: *mut zend_hash_key,
        pParam: *mut ::std::os::raw::c_void,
    ) -> zend_bool,
>;
extern "C" {
    pub fn _zend_hash_init(
        ht: *mut HashTable,
        nSize: u32,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
    );
}
extern "C" {
    pub fn _zend_hash_init_ex(
        ht: *mut HashTable,
        nSize: u32,
        pDestructor: dtor_func_t,
        persistent: zend_bool,
        bApplyProtection: zend_bool,
    );
}
extern "C" {
    pub fn zend_hash_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_clean(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_real_init(ht: *mut HashTable, packed: zend_bool);
}
extern "C" {
    pub fn zend_hash_packed_to_hash(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_to_packed(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_extend(ht: *mut HashTable, nSize: u32, packed: zend_bool);
}
extern "C" {
    pub fn _zend_hash_add_or_update(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_update(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_update_ind(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_add(ht: *mut HashTable, key: *mut zend_string, pData: *mut zval)
        -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_add_new(
        ht: *mut HashTable,
        key: *mut zend_string,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_str_add_or_update(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_str_update(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_str_update_ind(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_str_add(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_str_add_new(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_index_add_or_update(
        ht: *mut HashTable,
        h: zend_ulong,
        pData: *mut zval,
        flag: u32,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_index_add(ht: *mut HashTable, h: zend_ulong, pData: *mut zval) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_index_add_new(
        ht: *mut HashTable,
        h: zend_ulong,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_index_update(
        ht: *mut HashTable,
        h: zend_ulong,
        pData: *mut zval,
    ) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_next_index_insert(ht: *mut HashTable, pData: *mut zval) -> *mut zval;
}
extern "C" {
    pub fn _zend_hash_next_index_insert_new(ht: *mut HashTable, pData: *mut zval) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_index_add_empty_element(ht: *mut HashTable, h: zend_ulong) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_add_empty_element(ht: *mut HashTable, key: *mut zend_string) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_str_add_empty_element(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> *mut zval;
}
pub type apply_func_t =
    ::std::option::Option<unsafe extern "C" fn(pDest: *mut zval) -> ::std::os::raw::c_int>;
pub type apply_func_arg_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut zval,
        argument: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type apply_func_args_t = ::std::option::Option<
    unsafe extern "C" fn(
        pDest: *mut zval,
        num_args: ::std::os::raw::c_int,
        args: *mut __va_list_tag,
        hash_key: *mut zend_hash_key,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn zend_hash_graceful_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_graceful_reverse_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_hash_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_hash_apply_with_argument(
        ht: *mut HashTable,
        apply_func: apply_func_arg_t,
        arg1: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_hash_apply_with_arguments(
        ht: *mut HashTable,
        apply_func: apply_func_args_t,
        arg1: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn zend_hash_reverse_apply(ht: *mut HashTable, apply_func: apply_func_t);
}
extern "C" {
    pub fn zend_hash_del(ht: *mut HashTable, key: *mut zend_string) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_del_ind(ht: *mut HashTable, key: *mut zend_string) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_str_del(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_str_del_ind(
        ht: *mut HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_index_del(ht: *mut HashTable, h: zend_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_del_bucket(ht: *mut HashTable, p: *mut Bucket);
}
extern "C" {
    pub fn zend_hash_find(ht: *const HashTable, key: *mut zend_string) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_str_find(
        ht: *const HashTable,
        key: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_index_find(ht: *const HashTable, h: zend_ulong) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_exists(ht: *const HashTable, key: *mut zend_string) -> zend_bool;
}
extern "C" {
    pub fn zend_hash_str_exists(
        ht: *const HashTable,
        str_: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> zend_bool;
}
extern "C" {
    pub fn zend_hash_index_exists(ht: *const HashTable, h: zend_ulong) -> zend_bool;
}
extern "C" {
    pub fn zend_hash_move_forward_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_move_backwards_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_key_ex(
        ht: *const HashTable,
        str_index: *mut *mut zend_string,
        num_index: *mut zend_ulong,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_key_zval_ex(
        ht: *const HashTable,
        key: *mut zval,
        pos: *mut HashPosition,
    );
}
extern "C" {
    pub fn zend_hash_get_current_key_type_ex(
        ht: *mut HashTable,
        pos: *mut HashPosition,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_get_current_data_ex(ht: *mut HashTable, pos: *mut HashPosition) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_internal_pointer_reset_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
extern "C" {
    pub fn zend_hash_internal_pointer_end_ex(ht: *mut HashTable, pos: *mut HashPosition);
}
extern "C" {
    pub fn zend_hash_copy(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
    );
}
extern "C" {
    pub fn _zend_hash_merge(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        overwrite: zend_bool,
    );
}
extern "C" {
    pub fn zend_hash_merge_ex(
        target: *mut HashTable,
        source: *mut HashTable,
        pCopyConstructor: copy_ctor_func_t,
        pMergeSource: merge_checker_func_t,
        pParam: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_hash_bucket_swap(p: *mut Bucket, q: *mut Bucket);
}
extern "C" {
    pub fn zend_hash_bucket_renum_swap(p: *mut Bucket, q: *mut Bucket);
}
extern "C" {
    pub fn zend_hash_bucket_packed_swap(p: *mut Bucket, q: *mut Bucket);
}
extern "C" {
    pub fn zend_hash_compare(
        ht1: *mut HashTable,
        ht2: *mut HashTable,
        compar: compare_func_t,
        ordered: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_sort_ex(
        ht: *mut HashTable,
        sort_func: sort_func_t,
        compare_func: compare_func_t,
        renumber: zend_bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_minmax(ht: *const HashTable, compar: compare_func_t, flag: u32) -> *mut zval;
}
extern "C" {
    pub fn zend_hash_rehash(ht: *mut HashTable) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_array_count(ht: *mut HashTable) -> u32;
}
extern "C" {
    pub fn zend_array_dup(source: *mut HashTable) -> *mut HashTable;
}
extern "C" {
    pub fn zend_array_destroy(ht: *mut HashTable);
}
extern "C" {
    pub fn zend_symtable_clean(ht: *mut HashTable);
}
extern "C" {
    pub fn _zend_handle_numeric_str_ex(
        key: *const ::std::os::raw::c_char,
        length: size_t,
        idx: *mut zend_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_hash_iterator_add(ht: *mut HashTable, pos: HashPosition) -> u32;
}
extern "C" {
    pub fn zend_hash_iterator_pos(idx: u32, ht: *mut HashTable) -> HashPosition;
}
extern "C" {
    pub fn zend_hash_iterator_pos_ex(idx: u32, array: *mut zval) -> HashPosition;
}
extern "C" {
    pub fn zend_hash_iterator_del(idx: u32);
}
extern "C" {
    pub fn zend_hash_iterators_lower_pos(ht: *mut HashTable, start: HashPosition) -> HashPosition;
}
extern "C" {
    pub fn _zend_hash_iterators_update(ht: *mut HashTable, from: HashPosition, to: HashPosition);
}
pub type zend_ast_kind = u16;
pub type zend_ast_attr = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub child: [*mut zend_ast; 1usize],
}
#[test]
fn bindgen_test_layout__zend_ast() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_ast))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).lineno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast>())).child as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast),
            "::",
            stringify!(child)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast_list {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub children: u32,
    pub child: [*mut zend_ast; 1usize],
}
#[test]
fn bindgen_test_layout__zend_ast_list() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast_list>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_ast_list))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast_list>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_list>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_list),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_list>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_list),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_list>())).lineno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_list),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_list>())).children as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_list),
            "::",
            stringify!(children)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_list>())).child as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_list),
            "::",
            stringify!(child)
        )
    );
}
pub type zend_ast_list = _zend_ast_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_zval {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub val: zval,
}
#[test]
fn bindgen_test_layout__zend_ast_zval() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast_zval>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_ast_zval))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast_zval>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast_zval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_zval>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_zval),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_zval>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_zval),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_zval>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_zval),
            "::",
            stringify!(val)
        )
    );
}
pub type zend_ast_zval = _zend_ast_zval;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ast_decl {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub start_lineno: u32,
    pub end_lineno: u32,
    pub flags: u32,
    pub lex_pos: *mut ::std::os::raw::c_uchar,
    pub doc_comment: *mut zend_string,
    pub name: *mut zend_string,
    pub child: [*mut zend_ast; 4usize],
}
#[test]
fn bindgen_test_layout__zend_ast_decl() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast_decl>(),
        72usize,
        concat!("Size of: ", stringify!(_zend_ast_decl))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast_decl>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast_decl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).start_lineno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(start_lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).end_lineno as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(end_lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).lex_pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(lex_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).doc_comment as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).name as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_decl>())).child as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_decl),
            "::",
            stringify!(child)
        )
    );
}
pub type zend_ast_decl = _zend_ast_decl;
pub type zend_ast_process_t = ::std::option::Option<unsafe extern "C" fn(ast: *mut zend_ast)>;
extern "C" {
    pub static mut zend_ast_process: zend_ast_process_t;
}
extern "C" {
    pub fn zend_ast_create_zval_with_lineno(
        zv: *mut zval,
        attr: zend_ast_attr,
        lineno: u32,
    ) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_zval_ex(zv: *mut zval, attr: zend_ast_attr) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_ex(kind: zend_ast_kind, attr: zend_ast_attr, ...) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create(kind: zend_ast_kind, ...) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_decl(
        kind: zend_ast_kind,
        flags: u32,
        start_lineno: u32,
        doc_comment: *mut zend_string,
        name: *mut zend_string,
        child0: *mut zend_ast,
        child1: *mut zend_ast,
        child2: *mut zend_ast,
        child3: *mut zend_ast,
    ) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_create_list(init_children: u32, kind: zend_ast_kind, ...) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_list_add(list: *mut zend_ast, op: *mut zend_ast) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_evaluate(
        result: *mut zval,
        ast: *mut zend_ast,
        scope: *mut zend_class_entry,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_ast_export(
        prefix: *const ::std::os::raw::c_char,
        ast: *mut zend_ast,
        suffix: *const ::std::os::raw::c_char,
    ) -> *mut zend_string;
}
extern "C" {
    pub fn zend_ast_copy(ast: *mut zend_ast) -> *mut zend_ast;
}
extern "C" {
    pub fn zend_ast_destroy(ast: *mut zend_ast);
}
extern "C" {
    pub fn zend_ast_destroy_and_free(ast: *mut zend_ast);
}
pub type zend_ast_apply_func =
    ::std::option::Option<unsafe extern "C" fn(ast_ptr: *mut *mut zend_ast)>;
extern "C" {
    pub fn zend_ast_apply(ast: *mut zend_ast, fn_: zend_ast_apply_func);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _gc_root_buffer {
    pub ref_: *mut zend_refcounted,
    pub next: *mut _gc_root_buffer,
    pub prev: *mut _gc_root_buffer,
    pub refcount: u32,
}
#[test]
fn bindgen_test_layout__gc_root_buffer() {
    assert_eq!(
        ::std::mem::size_of::<_gc_root_buffer>(),
        32usize,
        concat!("Size of: ", stringify!(_gc_root_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_gc_root_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(_gc_root_buffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).ref_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).prev as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_root_buffer>())).refcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_root_buffer),
            "::",
            stringify!(refcount)
        )
    );
}
pub type gc_root_buffer = _gc_root_buffer;
pub type gc_additional_buffer = _gc_additional_bufer;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _gc_additional_bufer {
    pub used: u32,
    pub next: *mut gc_additional_buffer,
    pub buf: [gc_root_buffer; 127usize],
}
#[test]
fn bindgen_test_layout__gc_additional_bufer() {
    assert_eq!(
        ::std::mem::size_of::<_gc_additional_bufer>(),
        4080usize,
        concat!("Size of: ", stringify!(_gc_additional_bufer))
    );
    assert_eq!(
        ::std::mem::align_of::<_gc_additional_bufer>(),
        8usize,
        concat!("Alignment of ", stringify!(_gc_additional_bufer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_additional_bufer>())).used as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_additional_bufer),
            "::",
            stringify!(used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_additional_bufer>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_additional_bufer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_gc_additional_bufer>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_gc_additional_bufer),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_gc_globals {
    pub gc_enabled: zend_bool,
    pub gc_active: zend_bool,
    pub gc_full: zend_bool,
    pub buf: *mut gc_root_buffer,
    pub roots: gc_root_buffer,
    pub unused: *mut gc_root_buffer,
    pub first_unused: *mut gc_root_buffer,
    pub last_unused: *mut gc_root_buffer,
    pub to_free: gc_root_buffer,
    pub next_to_free: *mut gc_root_buffer,
    pub gc_runs: u32,
    pub collected: u32,
    pub additional_buffer: *mut gc_additional_buffer,
}
#[test]
fn bindgen_test_layout__zend_gc_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_gc_globals>(),
        128usize,
        concat!("Size of: ", stringify!(_zend_gc_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_gc_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_gc_globals))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_active as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_active)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_full as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_full)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).buf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).roots as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(roots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).unused as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).first_unused as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(first_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).last_unused as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(last_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).to_free as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(to_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).next_to_free as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(next_to_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).gc_runs as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(gc_runs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_gc_globals>())).collected as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(collected)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_gc_globals>())).additional_buffer as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_gc_globals),
            "::",
            stringify!(additional_buffer)
        )
    );
}
pub type zend_gc_globals = _zend_gc_globals;
extern "C" {
    pub static mut gc_globals: zend_gc_globals;
}
extern "C" {
    pub static mut gc_collect_cycles:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
extern "C" {
    pub fn zend_gc_collect_cycles() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_print_variable(var: *mut zval) -> size_t;
}
pub type zend_object_iterator = _zend_object_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_iterator_funcs {
    pub dtor: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub valid: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator) -> ::std::os::raw::c_int,
    >,
    pub get_current_data:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator) -> *mut zval>,
    pub get_current_key: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut zend_object_iterator, key: *mut zval),
    >,
    pub move_forward: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub rewind: ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
    pub invalidate_current:
        ::std::option::Option<unsafe extern "C" fn(iter: *mut zend_object_iterator)>,
}
#[test]
fn bindgen_test_layout__zend_object_iterator_funcs() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_iterator_funcs>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_object_iterator_funcs))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_iterator_funcs>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_iterator_funcs))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).dtor as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(dtor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).valid as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).get_current_data as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(get_current_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).get_current_key as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(get_current_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).move_forward as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(move_forward)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).rewind as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(rewind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_iterator_funcs>())).invalidate_current as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator_funcs),
            "::",
            stringify!(invalidate_current)
        )
    );
}
pub type zend_object_iterator_funcs = _zend_object_iterator_funcs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_object_iterator {
    pub std: zend_object,
    pub data: zval,
    pub funcs: *mut zend_object_iterator_funcs,
    pub index: zend_ulong,
}
#[test]
fn bindgen_test_layout__zend_object_iterator() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_iterator>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_object_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_iterator))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).std as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(std)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).funcs as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(funcs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_iterator>())).index as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_iterator),
            "::",
            stringify!(index)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_iterator_funcs {
    pub funcs: *mut zend_object_iterator_funcs,
    pub zf_new_iterator: *mut _zend_function,
    pub zf_valid: *mut _zend_function,
    pub zf_current: *mut _zend_function,
    pub zf_key: *mut _zend_function,
    pub zf_next: *mut _zend_function,
    pub zf_rewind: *mut _zend_function,
}
#[test]
fn bindgen_test_layout__zend_class_iterator_funcs() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_iterator_funcs>(),
        56usize,
        concat!("Size of: ", stringify!(_zend_class_iterator_funcs))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_iterator_funcs>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_iterator_funcs))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).funcs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(funcs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_new_iterator as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_new_iterator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_valid as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_valid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_current as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_current)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_key as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_next as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_iterator_funcs>())).zf_rewind as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_iterator_funcs),
            "::",
            stringify!(zf_rewind)
        )
    );
}
pub type zend_class_iterator_funcs = _zend_class_iterator_funcs;
extern "C" {
    pub fn zend_iterator_unwrap(array_ptr: *mut zval) -> *mut zend_object_iterator;
}
extern "C" {
    pub fn zend_iterator_init(iter: *mut zend_object_iterator);
}
extern "C" {
    pub fn zend_iterator_dtor(iter: *mut zend_object_iterator);
}
extern "C" {
    pub fn zend_register_iterator_wrapper();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_ino as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_nlink as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_uid as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_gid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).__pad0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_rdev as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_blksize as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_blocks as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_atim as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_mtim as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).st_ctim as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stat>())).__glibc_reserved as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
pub type zend_stream_fsizer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void) -> size_t>;
pub type zend_stream_reader_t = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        buf: *mut ::std::os::raw::c_char,
        len: size_t,
    ) -> size_t,
>;
pub type zend_stream_closer_t =
    ::std::option::Option<unsafe extern "C" fn(handle: *mut ::std::os::raw::c_void)>;
pub const zend_stream_type_ZEND_HANDLE_FILENAME: zend_stream_type = 0;
pub const zend_stream_type_ZEND_HANDLE_FD: zend_stream_type = 1;
pub const zend_stream_type_ZEND_HANDLE_FP: zend_stream_type = 2;
pub const zend_stream_type_ZEND_HANDLE_STREAM: zend_stream_type = 3;
pub const zend_stream_type_ZEND_HANDLE_MAPPED: zend_stream_type = 4;
pub type zend_stream_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_mmap {
    pub len: size_t,
    pub pos: size_t,
    pub map: *mut ::std::os::raw::c_void,
    pub buf: *mut ::std::os::raw::c_char,
    pub old_handle: *mut ::std::os::raw::c_void,
    pub old_closer: zend_stream_closer_t,
}
#[test]
fn bindgen_test_layout__zend_mmap() {
    assert_eq!(
        ::std::mem::size_of::<_zend_mmap>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_mmap))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_mmap>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_mmap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).map as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).buf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).old_handle as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(old_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_mmap>())).old_closer as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_mmap),
            "::",
            stringify!(old_closer)
        )
    );
}
pub type zend_mmap = _zend_mmap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stream {
    pub handle: *mut ::std::os::raw::c_void,
    pub isatty: ::std::os::raw::c_int,
    pub mmap: zend_mmap,
    pub reader: zend_stream_reader_t,
    pub fsizer: zend_stream_fsizer_t,
    pub closer: zend_stream_closer_t,
}
#[test]
fn bindgen_test_layout__zend_stream() {
    assert_eq!(
        ::std::mem::size_of::<_zend_stream>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_stream))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_stream>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_stream))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).isatty as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(isatty)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).mmap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(mmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).reader as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(reader)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).fsizer as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(fsizer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stream>())).closer as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stream),
            "::",
            stringify!(closer)
        )
    );
}
pub type zend_stream = _zend_stream;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_file_handle {
    pub handle: _zend_file_handle__bindgen_ty_1,
    pub filename: *const ::std::os::raw::c_char,
    pub opened_path: *mut zend_string,
    pub type_: zend_stream_type,
    pub free_filename: zend_bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_file_handle__bindgen_ty_1 {
    pub fd: ::std::os::raw::c_int,
    pub fp: *mut FILE,
    pub stream: zend_stream,
    _bindgen_union_align: [u64; 11usize],
}
#[test]
fn bindgen_test_layout__zend_file_handle__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_file_handle__bindgen_ty_1>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_file_handle__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_file_handle__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_file_handle__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).fd as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).fp as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_handle__bindgen_ty_1>())).stream as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle__bindgen_ty_1),
            "::",
            stringify!(stream)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_file_handle() {
    assert_eq!(
        ::std::mem::size_of::<_zend_file_handle>(),
        112usize,
        concat!("Size of: ", stringify!(_zend_file_handle))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_file_handle>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_file_handle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).filename as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).opened_path as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(opened_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).type_ as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_handle>())).free_filename as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_handle),
            "::",
            stringify!(free_filename)
        )
    );
}
pub type zend_file_handle = _zend_file_handle;
extern "C" {
    pub fn zend_stream_open(
        filename: *const ::std::os::raw::c_char,
        handle: *mut zend_file_handle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stream_fixup(
        file_handle: *mut zend_file_handle,
        buf: *mut *mut ::std::os::raw::c_char,
        len: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_file_handle_dtor(fh: *mut zend_file_handle);
}
extern "C" {
    pub fn zend_compare_file_handles(
        fh1: *mut zend_file_handle,
        fh2: *mut zend_file_handle,
    ) -> ::std::os::raw::c_int;
}
pub type zend_stat_t = stat;
extern "C" {
    pub fn zend_error_noreturn(
        type_: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_serialize_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_unserialize_data {
    _unused: [u8; 0],
}
pub type zend_serialize_data = _zend_serialize_data;
pub type zend_unserialize_data = _zend_unserialize_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_method_reference {
    pub method_name: *mut zend_string,
    pub ce: *mut zend_class_entry,
    pub class_name: *mut zend_string,
}
#[test]
fn bindgen_test_layout__zend_trait_method_reference() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_method_reference>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_trait_method_reference))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_method_reference>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_method_reference))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).method_name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(method_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_method_reference>())).ce as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_method_reference>())).class_name as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_method_reference),
            "::",
            stringify!(class_name)
        )
    );
}
pub type zend_trait_method_reference = _zend_trait_method_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_precedence {
    pub trait_method: *mut zend_trait_method_reference,
    pub exclude_from_classes: *mut _zend_trait_precedence__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_trait_precedence__bindgen_ty_1 {
    pub ce: *mut zend_class_entry,
    pub class_name: *mut zend_string,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__zend_trait_precedence__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_precedence__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_zend_trait_precedence__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_precedence__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_trait_precedence__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence__bindgen_ty_1>())).ce as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence__bindgen_ty_1),
            "::",
            stringify!(ce)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence__bindgen_ty_1>())).class_name as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence__bindgen_ty_1),
            "::",
            stringify!(class_name)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_trait_precedence() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_precedence>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_trait_precedence))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_precedence>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_precedence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence>())).trait_method as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence),
            "::",
            stringify!(trait_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_trait_precedence>())).exclude_from_classes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_precedence),
            "::",
            stringify!(exclude_from_classes)
        )
    );
}
pub type zend_trait_precedence = _zend_trait_precedence;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_trait_alias {
    pub trait_method: *mut zend_trait_method_reference,
    #[doc = " name for method to be added"]
    pub alias: *mut zend_string,
    #[doc = " modifiers to be set on trait method"]
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout__zend_trait_alias() {
    assert_eq!(
        ::std::mem::size_of::<_zend_trait_alias>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_trait_alias))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_trait_alias>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_trait_alias))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).trait_method as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(trait_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).alias as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_trait_alias>())).modifiers as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_trait_alias),
            "::",
            stringify!(modifiers)
        )
    );
}
pub type zend_trait_alias = _zend_trait_alias;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_class_entry {
    pub type_: ::std::os::raw::c_char,
    pub name: *mut zend_string,
    pub parent: *mut _zend_class_entry,
    pub refcount: ::std::os::raw::c_int,
    pub ce_flags: u32,
    pub default_properties_count: ::std::os::raw::c_int,
    pub default_static_members_count: ::std::os::raw::c_int,
    pub default_properties_table: *mut zval,
    pub default_static_members_table: *mut zval,
    pub static_members_table: *mut zval,
    pub function_table: HashTable,
    pub properties_info: HashTable,
    pub constants_table: HashTable,
    pub constructor: *mut _zend_function,
    pub destructor: *mut _zend_function,
    pub clone: *mut _zend_function,
    pub __get: *mut _zend_function,
    pub __set: *mut _zend_function,
    pub __unset: *mut _zend_function,
    pub __isset: *mut _zend_function,
    pub __call: *mut _zend_function,
    pub __callstatic: *mut _zend_function,
    pub __tostring: *mut _zend_function,
    pub __debugInfo: *mut _zend_function,
    pub serialize_func: *mut _zend_function,
    pub unserialize_func: *mut _zend_function,
    pub iterator_funcs: zend_class_iterator_funcs,
    pub create_object: ::std::option::Option<
        unsafe extern "C" fn(class_type: *mut zend_class_entry) -> *mut zend_object,
    >,
    pub get_iterator: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            object: *mut zval,
            by_ref: ::std::os::raw::c_int,
        ) -> *mut zend_object_iterator,
    >,
    pub interface_gets_implemented: ::std::option::Option<
        unsafe extern "C" fn(
            iface: *mut zend_class_entry,
            class_type: *mut zend_class_entry,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_static_method: ::std::option::Option<
        unsafe extern "C" fn(
            ce: *mut zend_class_entry,
            method: *mut zend_string,
        ) -> *mut _zend_function,
    >,
    pub serialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut zval,
            buffer: *mut *mut ::std::os::raw::c_uchar,
            buf_len: *mut size_t,
            data: *mut zend_serialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub unserialize: ::std::option::Option<
        unsafe extern "C" fn(
            object: *mut zval,
            ce: *mut zend_class_entry,
            buf: *const ::std::os::raw::c_uchar,
            buf_len: size_t,
            data: *mut zend_unserialize_data,
        ) -> ::std::os::raw::c_int,
    >,
    pub num_interfaces: u32,
    pub num_traits: u32,
    pub interfaces: *mut *mut zend_class_entry,
    pub traits: *mut *mut zend_class_entry,
    pub trait_aliases: *mut *mut zend_trait_alias,
    pub trait_precedences: *mut *mut zend_trait_precedence,
    pub info: _zend_class_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_class_entry__bindgen_ty_1 {
    pub user: _zend_class_entry__bindgen_ty_1__bindgen_ty_1,
    pub internal: _zend_class_entry__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_1__bindgen_ty_1 {
    pub filename: *mut zend_string,
    pub line_start: u32,
    pub line_end: u32,
    pub doc_comment: *mut zend_string,
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).filename
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).line_start
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(line_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).line_end
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(line_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_1>())).doc_comment
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(doc_comment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_class_entry__bindgen_ty_1__bindgen_ty_2 {
    pub builtin_functions: *const _zend_function_entry,
    pub module: *mut _zend_module_entry,
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>()))
                .builtin_functions as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(builtin_functions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1__bindgen_ty_2>())).module
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(module)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_class_entry__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_class_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1>())).user as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry__bindgen_ty_1>())).internal as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry__bindgen_ty_1),
            "::",
            stringify!(internal)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_class_entry() {
    assert_eq!(
        ::std::mem::size_of::<_zend_class_entry>(),
        504usize,
        concat!("Size of: ", stringify!(_zend_class_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_class_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_class_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).refcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).ce_flags as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(ce_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_properties_count as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_properties_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_static_members_count as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_static_members_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_properties_table as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_properties_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).default_static_members_table as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(default_static_members_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).static_members_table as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(static_members_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).function_table as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(function_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).properties_info as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(properties_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).constants_table as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(constants_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).constructor as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(constructor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).destructor as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(destructor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).clone as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__get as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__set as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__unset as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__unset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__isset as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__isset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__call as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__callstatic as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__callstatic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__tostring as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__tostring)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).__debugInfo as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(__debugInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).serialize_func as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(serialize_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).unserialize_func as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(unserialize_func)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).iterator_funcs as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(iterator_funcs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).create_object as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(create_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).get_iterator as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(get_iterator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).interface_gets_implemented as *const _
                as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(interface_gets_implemented)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).get_static_method as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(get_static_method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).serialize as *const _ as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(serialize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).unserialize as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(unserialize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).num_interfaces as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(num_interfaces)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).num_traits as *const _ as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(num_traits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).interfaces as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(interfaces)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).traits as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(traits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).trait_aliases as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(trait_aliases)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_class_entry>())).trait_precedences as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(trait_precedences)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_class_entry>())).info as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_class_entry),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_utility_functions {
    pub error_function: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *const ::std::os::raw::c_char,
            error_lineno: uint,
            format: *const ::std::os::raw::c_char,
            args: *mut __va_list_tag,
        ),
    >,
    pub printf_function: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> size_t,
    >,
    pub write_function: ::std::option::Option<
        unsafe extern "C" fn(str_: *const ::std::os::raw::c_char, str_length: size_t) -> size_t,
    >,
    pub fopen_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            opened_path: *mut *mut zend_string,
        ) -> *mut FILE,
    >,
    pub message_handler: ::std::option::Option<
        unsafe extern "C" fn(message: zend_long, data: *const ::std::os::raw::c_void),
    >,
    pub block_interruptions: ::std::option::Option<unsafe extern "C" fn()>,
    pub unblock_interruptions: ::std::option::Option<unsafe extern "C" fn()>,
    pub get_configuration_directive:
        ::std::option::Option<unsafe extern "C" fn(name: *mut zend_string) -> *mut zval>,
    pub ticks_function: ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>,
    pub on_timeout: ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>,
    pub stream_open_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            handle: *mut zend_file_handle,
        ) -> ::std::os::raw::c_int,
    >,
    pub vspprintf_function: ::std::option::Option<
        unsafe extern "C" fn(
            pbuf: *mut *mut ::std::os::raw::c_char,
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> size_t,
    >,
    pub vstrpprintf_function: ::std::option::Option<
        unsafe extern "C" fn(
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> *mut zend_string,
    >,
    pub getenv_function: ::std::option::Option<
        unsafe extern "C" fn(
            name: *mut ::std::os::raw::c_char,
            name_len: size_t,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub resolve_path_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            filename_len: ::std::os::raw::c_int,
        ) -> *mut zend_string,
    >,
}
#[test]
fn bindgen_test_layout__zend_utility_functions() {
    assert_eq!(
        ::std::mem::size_of::<_zend_utility_functions>(),
        120usize,
        concat!("Size of: ", stringify!(_zend_utility_functions))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_utility_functions>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_utility_functions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).error_function as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(error_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).printf_function as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(printf_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).write_function as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(write_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).fopen_function as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(fopen_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).message_handler as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(message_handler)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).block_interruptions as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(block_interruptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).unblock_interruptions as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(unblock_interruptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).get_configuration_directive
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(get_configuration_directive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).ticks_function as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(ticks_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).on_timeout as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(on_timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).stream_open_function as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(stream_open_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).vspprintf_function as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(vspprintf_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).vstrpprintf_function as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(vstrpprintf_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).getenv_function as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(getenv_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_functions>())).resolve_path_function as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_functions),
            "::",
            stringify!(resolve_path_function)
        )
    );
}
pub type zend_utility_functions = _zend_utility_functions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_utility_values {
    pub import_use_extension: *mut ::std::os::raw::c_char,
    pub import_use_extension_length: uint,
    pub html_errors: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_utility_values() {
    assert_eq!(
        ::std::mem::size_of::<_zend_utility_values>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_utility_values))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_utility_values>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_utility_values))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).import_use_extension as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(import_use_extension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).import_use_extension_length as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(import_use_extension_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_utility_values>())).html_errors as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_utility_values),
            "::",
            stringify!(html_errors)
        )
    );
}
pub type zend_utility_values = _zend_utility_values;
pub type zend_write_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *const ::std::os::raw::c_char,
        str_length: size_t,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn zend_startup(
        utility_functions: *mut zend_utility_functions,
        extensions: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_shutdown();
}
extern "C" {
    pub fn zend_register_standard_ini_entries();
}
extern "C" {
    pub fn zend_post_startup();
}
extern "C" {
    pub fn zend_set_utility_values(utility_values: *mut zend_utility_values);
}
extern "C" {
    pub fn _zend_bailout(filename: *mut ::std::os::raw::c_char, lineno: uint);
}
extern "C" {
    pub fn zend_make_printable_zval(expr: *mut zval, expr_copy: *mut zval)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_print_zval(expr: *mut zval, indent: ::std::os::raw::c_int) -> size_t;
}
extern "C" {
    pub fn zend_print_zval_ex(
        write_func: zend_write_func_t,
        expr: *mut zval,
        indent: ::std::os::raw::c_int,
    ) -> size_t;
}
extern "C" {
    pub fn zend_print_zval_r(expr: *mut zval, indent: ::std::os::raw::c_int);
}
extern "C" {
    pub fn zend_print_flat_zval_r(expr: *mut zval);
}
extern "C" {
    pub fn zend_print_zval_r_ex(
        write_func: zend_write_func_t,
        expr: *mut zval,
        indent: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn zend_output_debug_string(
        trigger_break: zend_bool,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn zend_activate();
}
extern "C" {
    pub fn zend_deactivate();
}
extern "C" {
    pub fn zend_call_destructors();
}
extern "C" {
    pub fn zend_activate_modules();
}
extern "C" {
    pub fn zend_deactivate_modules();
}
extern "C" {
    pub fn zend_post_deactivate_modules();
}
extern "C" {
    pub static mut zend_printf: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...) -> size_t,
    >;
}
extern "C" {
    pub static mut zend_write: zend_write_func_t;
}
extern "C" {
    pub static mut zend_fopen: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            opened_path: *mut *mut zend_string,
        ) -> *mut FILE,
    >;
}
extern "C" {
    pub static mut zend_block_interruptions: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_unblock_interruptions: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut zend_ticks_function:
        ::std::option::Option<unsafe extern "C" fn(ticks: ::std::os::raw::c_int)>;
}
extern "C" {
    pub static mut zend_error_cb: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            error_filename: *const ::std::os::raw::c_char,
            error_lineno: uint,
            format: *const ::std::os::raw::c_char,
            args: *mut __va_list_tag,
        ),
    >;
}
extern "C" {
    pub static mut zend_on_timeout:
        ::std::option::Option<unsafe extern "C" fn(seconds: ::std::os::raw::c_int)>;
}
extern "C" {
    pub static mut zend_stream_open_function: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            handle: *mut zend_file_handle,
        ) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub static mut zend_vspprintf: ::std::option::Option<
        unsafe extern "C" fn(
            pbuf: *mut *mut ::std::os::raw::c_char,
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> size_t,
    >;
}
extern "C" {
    pub static mut zend_vstrpprintf: ::std::option::Option<
        unsafe extern "C" fn(
            max_len: size_t,
            format: *const ::std::os::raw::c_char,
            ap: *mut __va_list_tag,
        ) -> *mut zend_string,
    >;
}
extern "C" {
    pub static mut zend_getenv: ::std::option::Option<
        unsafe extern "C" fn(
            name: *mut ::std::os::raw::c_char,
            name_len: size_t,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
extern "C" {
    pub static mut zend_resolve_path: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            filename_len: ::std::os::raw::c_int,
        ) -> *mut zend_string,
    >;
}
extern "C" {
    pub fn zend_error(type_: ::std::os::raw::c_int, format: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn zend_throw_error(
        exception_ce: *mut zend_class_entry,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn zend_type_error(format: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn zend_internal_type_error(
        throw_exception: zend_bool,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn zenderror(error: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut zend_standard_class_def: *mut zend_class_entry;
}
extern "C" {
    pub static mut zend_uv: zend_utility_values;
}
extern "C" {
    pub static mut zend_dtrace_enabled: zend_bool;
}
extern "C" {
    pub fn zend_message_dispatcher(message: zend_long, data: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn zend_get_configuration_directive(name: *mut zend_string) -> *mut zval;
}
pub const zend_error_handling_t_EH_NORMAL: zend_error_handling_t = 0;
pub const zend_error_handling_t_EH_SUPPRESS: zend_error_handling_t = 1;
pub const zend_error_handling_t_EH_THROW: zend_error_handling_t = 2;
pub type zend_error_handling_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct zend_error_handling {
    pub handling: zend_error_handling_t,
    pub exception: *mut zend_class_entry,
    pub user_handler: zval,
}
#[test]
fn bindgen_test_layout_zend_error_handling() {
    assert_eq!(
        ::std::mem::size_of::<zend_error_handling>(),
        32usize,
        concat!("Size of: ", stringify!(zend_error_handling))
    );
    assert_eq!(
        ::std::mem::align_of::<zend_error_handling>(),
        8usize,
        concat!("Alignment of ", stringify!(zend_error_handling))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zend_error_handling>())).handling as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(handling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<zend_error_handling>())).exception as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(exception)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<zend_error_handling>())).user_handler as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(zend_error_handling),
            "::",
            stringify!(user_handler)
        )
    );
}
extern "C" {
    pub fn zend_save_error_handling(current: *mut zend_error_handling);
}
extern "C" {
    pub fn zend_replace_error_handling(
        error_handling: zend_error_handling_t,
        exception_class: *mut zend_class_entry,
        current: *mut zend_error_handling,
    );
}
extern "C" {
    pub fn zend_restore_error_handling(saved: *mut zend_error_handling);
}
pub type zend_object_read_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
        rv: *mut zval,
    ) -> *mut zval,
>;
pub type zend_object_read_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        offset: *mut zval,
        type_: ::std::os::raw::c_int,
        rv: *mut zval,
    ) -> *mut zval,
>;
pub type zend_object_write_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        value: *mut zval,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ),
>;
pub type zend_object_write_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, offset: *mut zval, value: *mut zval),
>;
pub type zend_object_get_property_ptr_ptr_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        type_: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> *mut zval,
>;
pub type zend_object_set_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval, value: *mut zval)>;
pub type zend_object_get_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval, rv: *mut zval) -> *mut zval>;
pub type zend_object_has_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        has_set_exists: ::std::os::raw::c_int,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_has_dimension_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        check_empty: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_unset_property_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        member: *mut zval,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    ),
>;
pub type zend_object_unset_dimension_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval, offset: *mut zval)>;
pub type zend_object_get_properties_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> *mut HashTable>;
pub type zend_object_get_debug_info_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, is_temp: *mut ::std::os::raw::c_int) -> *mut HashTable,
>;
pub type zend_object_call_method_t = ::std::option::Option<
    unsafe extern "C" fn(
        method: *mut zend_string,
        object: *mut zend_object,
        execute_data: *mut zend_execute_data,
        return_value: *mut zval,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_method_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut *mut zend_object,
        method: *mut zend_string,
        key: *const zval,
    ) -> *mut _zend_function,
>;
pub type zend_object_get_constructor_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object) -> *mut _zend_function>;
pub type zend_object_dtor_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object)>;
pub type zend_object_free_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zend_object)>;
pub type zend_object_clone_obj_t =
    ::std::option::Option<unsafe extern "C" fn(object: *mut zval) -> *mut zend_object>;
pub type zend_object_get_class_name_t =
    ::std::option::Option<unsafe extern "C" fn(object: *const zend_object) -> *mut zend_string>;
pub type zend_object_compare_t = ::std::option::Option<
    unsafe extern "C" fn(object1: *mut zval, object2: *mut zval) -> ::std::os::raw::c_int,
>;
pub type zend_object_compare_zvals_t = ::std::option::Option<
    unsafe extern "C" fn(resul: *mut zval, op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int,
>;
pub type zend_object_cast_t = ::std::option::Option<
    unsafe extern "C" fn(
        readobj: *mut zval,
        retval: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_count_elements_t = ::std::option::Option<
    unsafe extern "C" fn(object: *mut zval, count: *mut zend_long) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_closure_t = ::std::option::Option<
    unsafe extern "C" fn(
        obj: *mut zval,
        ce_ptr: *mut *mut zend_class_entry,
        fptr_ptr: *mut *mut _zend_function,
        obj_ptr: *mut *mut zend_object,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_object_get_gc_t = ::std::option::Option<
    unsafe extern "C" fn(
        object: *mut zval,
        table: *mut *mut zval,
        n: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable,
>;
pub type zend_object_do_operation_t = ::std::option::Option<
    unsafe extern "C" fn(
        opcode: zend_uchar,
        result: *mut zval,
        op1: *mut zval,
        op2: *mut zval,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_object_handlers {
    pub offset: ::std::os::raw::c_int,
    pub free_obj: zend_object_free_obj_t,
    pub dtor_obj: zend_object_dtor_obj_t,
    pub clone_obj: zend_object_clone_obj_t,
    pub read_property: zend_object_read_property_t,
    pub write_property: zend_object_write_property_t,
    pub read_dimension: zend_object_read_dimension_t,
    pub write_dimension: zend_object_write_dimension_t,
    pub get_property_ptr_ptr: zend_object_get_property_ptr_ptr_t,
    pub get: zend_object_get_t,
    pub set: zend_object_set_t,
    pub has_property: zend_object_has_property_t,
    pub unset_property: zend_object_unset_property_t,
    pub has_dimension: zend_object_has_dimension_t,
    pub unset_dimension: zend_object_unset_dimension_t,
    pub get_properties: zend_object_get_properties_t,
    pub get_method: zend_object_get_method_t,
    pub call_method: zend_object_call_method_t,
    pub get_constructor: zend_object_get_constructor_t,
    pub get_class_name: zend_object_get_class_name_t,
    pub compare_objects: zend_object_compare_t,
    pub cast_object: zend_object_cast_t,
    pub count_elements: zend_object_count_elements_t,
    pub get_debug_info: zend_object_get_debug_info_t,
    pub get_closure: zend_object_get_closure_t,
    pub get_gc: zend_object_get_gc_t,
    pub do_operation: zend_object_do_operation_t,
    pub compare: zend_object_compare_zvals_t,
}
#[test]
fn bindgen_test_layout__zend_object_handlers() {
    assert_eq!(
        ::std::mem::size_of::<_zend_object_handlers>(),
        224usize,
        concat!("Size of: ", stringify!(_zend_object_handlers))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_object_handlers>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_object_handlers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).free_obj as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(free_obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).dtor_obj as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(dtor_obj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).clone_obj as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(clone_obj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).read_property as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(read_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).write_property as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(write_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).read_dimension as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(read_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).write_dimension as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(write_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_property_ptr_ptr as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_property_ptr_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).get as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).set as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).has_property as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(has_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).unset_property as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(unset_property)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).has_dimension as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(has_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).unset_dimension as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(unset_dimension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_properties as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_properties)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_method as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).call_method as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(call_method)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_constructor as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_constructor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_class_name as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).compare_objects as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(compare_objects)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).cast_object as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(cast_object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).count_elements as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(count_elements)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_debug_info as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_debug_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).get_closure as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_closure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).get_gc as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(get_gc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_object_handlers>())).do_operation as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(do_operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_object_handlers>())).compare as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_object_handlers),
            "::",
            stringify!(compare)
        )
    );
}
extern "C" {
    pub static mut std_object_handlers: zend_object_handlers;
}
extern "C" {
    pub fn zend_std_get_static_method(
        ce: *mut zend_class_entry,
        function_name_strval: *mut zend_string,
        key: *const zval,
    ) -> *mut _zend_function;
}
extern "C" {
    pub fn zend_std_get_static_property(
        ce: *mut zend_class_entry,
        property_name: *mut zend_string,
        silent: zend_bool,
    ) -> *mut zval;
}
extern "C" {
    pub fn zend_std_unset_static_property(
        ce: *mut zend_class_entry,
        property_name: *mut zend_string,
    ) -> zend_bool;
}
extern "C" {
    pub fn zend_std_get_constructor(object: *mut zend_object) -> *mut _zend_function;
}
extern "C" {
    pub fn zend_get_property_info(
        ce: *mut zend_class_entry,
        member: *mut zend_string,
        silent: ::std::os::raw::c_int,
    ) -> *mut _zend_property_info;
}
extern "C" {
    pub fn zend_std_get_properties(object: *mut zval) -> *mut HashTable;
}
extern "C" {
    pub fn zend_std_get_debug_info(
        object: *mut zval,
        is_temp: *mut ::std::os::raw::c_int,
    ) -> *mut HashTable;
}
extern "C" {
    pub fn zend_std_cast_object_tostring(
        readobj: *mut zval,
        writeobj: *mut zval,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_std_write_property(
        object: *mut zval,
        member: *mut zval,
        value: *mut zval,
        cache_slot: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_check_private(
        fbc: *mut _zend_function,
        ce: *mut zend_class_entry,
        function_name: *mut zend_string,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_check_protected(
        ce: *mut zend_class_entry,
        scope: *mut zend_class_entry,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_check_property_access(
        zobj: *mut zend_object,
        prop_info_name: *mut zend_string,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_get_call_trampoline_func(
        ce: *mut zend_class_entry,
        method_name: *mut zend_string,
        is_static: ::std::os::raw::c_int,
    ) -> *mut zend_function;
}
extern "C" {
    pub static mut program_invocation_name: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut program_invocation_short_name: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_freedtoa(s: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn zend_dtoa(
        _d: f64,
        mode: ::std::os::raw::c_int,
        ndigits: ::std::os::raw::c_int,
        decpt: *mut ::std::os::raw::c_int,
        sign: *mut ::std::os::raw::c_int,
        rve: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_strtod(
        s00: *const ::std::os::raw::c_char,
        se: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_hex_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_oct_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_bin_strtod(
        str_: *const ::std::os::raw::c_char,
        endptr: *mut *const ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn zend_startup_strtod() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_shutdown_strtod() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_is_identical(op1: *mut zval, op2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_memnstr_ex(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
        needle_len: size_t,
        end: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_memnrstr_ex(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
        needle_len: size_t,
        end: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_dval_to_lval_slow(d: f64) -> zend_long;
}
extern "C" {
    pub fn zend_is_true(op: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_object_is_true(op: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_str_tolower(str_: *mut ::std::os::raw::c_char, length: size_t);
}
extern "C" {
    pub fn zend_str_tolower_copy(
        dest: *mut ::std::os::raw::c_char,
        source: *const ::std::os::raw::c_char,
        length: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_str_tolower_dup(
        source: *const ::std::os::raw::c_char,
        length: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_str_tolower_dup_ex(
        source: *const ::std::os::raw::c_char,
        length: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_string_tolower(str_: *mut zend_string) -> *mut zend_string;
}
extern "C" {
    pub fn zend_binary_zval_strcmp(s1: *mut zval, s2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strncmp(
        s1: *mut zval,
        s2: *mut zval,
        s3: *mut zval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strcasecmp(s1: *mut zval, s2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_zval_strncasecmp(
        s1: *mut zval,
        s2: *mut zval,
        s3: *mut zval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strcmp(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncmp(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
        length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strcasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncasecmp(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
        length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strcasecmp_l(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_binary_strncasecmp_l(
        s1: *const ::std::os::raw::c_char,
        len1: size_t,
        s2: *const ::std::os::raw::c_char,
        len2: size_t,
        length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zendi_smart_strcmp(s1: *mut zend_string, s2: *mut zend_string) -> zend_long;
}
extern "C" {
    pub fn zend_compare_symbol_tables(
        ht1: *mut HashTable,
        ht2: *mut HashTable,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_compare_arrays(a1: *mut zval, a2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_compare_objects(o1: *mut zval, o2: *mut zval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_atoi(
        str_: *const ::std::os::raw::c_char,
        str_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_atol(
        str_: *const ::std::os::raw::c_char,
        str_len: ::std::os::raw::c_int,
    ) -> zend_long;
}
extern "C" {
    pub fn zend_locale_sprintf_double(op: *mut zval);
}
extern "C" {
    pub fn zend_long_to_str(num: zend_long) -> *mut zend_string;
}
extern "C" {
    pub fn zend_qsort(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        siz: size_t,
        cmp: compare_func_t,
        swp: swap_func_t,
    );
}
extern "C" {
    pub fn zend_sort(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        siz: size_t,
        cmp: compare_func_t,
        swp: swap_func_t,
    );
}
extern "C" {
    pub fn zend_insert_sort(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        siz: size_t,
        cmp: compare_func_t,
        swp: swap_func_t,
    );
}
pub type zend_op_array = _zend_op_array;
pub type zend_op = _zend_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode_op {
    pub constant: u32,
    pub var: u32,
    pub num: u32,
    pub opline_num: u32,
    pub jmp_offset: u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__znode_op() {
    assert_eq!(
        ::std::mem::size_of::<_znode_op>(),
        4usize,
        concat!("Size of: ", stringify!(_znode_op))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode_op>(),
        4usize,
        concat!("Alignment of ", stringify!(_znode_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).var as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).opline_num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(opline_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode_op>())).jmp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode_op),
            "::",
            stringify!(jmp_offset)
        )
    );
}
pub type znode_op = _znode_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _znode {
    pub op_type: zend_uchar,
    pub flag: zend_uchar,
    pub u: _znode__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _znode__bindgen_ty_1 {
    pub op: znode_op,
    pub constant: zval,
    _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout__znode__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_znode__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(_znode__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_znode__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode__bindgen_ty_1>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode__bindgen_ty_1),
            "::",
            stringify!(constant)
        )
    );
}
#[test]
fn bindgen_test_layout__znode() {
    assert_eq!(
        ::std::mem::size_of::<_znode>(),
        24usize,
        concat!("Size of: ", stringify!(_znode))
    );
    assert_eq!(
        ::std::mem::align_of::<_znode>(),
        8usize,
        concat!("Alignment of ", stringify!(_znode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).op_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode),
            "::",
            stringify!(op_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).flag as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_znode),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_znode>())).u as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_znode), "::", stringify!(u))
    );
}
pub type znode = _znode;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_ast_znode {
    pub kind: zend_ast_kind,
    pub attr: zend_ast_attr,
    pub lineno: u32,
    pub node: znode,
}
#[test]
fn bindgen_test_layout__zend_ast_znode() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ast_znode>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_ast_znode))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ast_znode>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ast_znode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_znode>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_znode),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_znode>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_znode),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_znode>())).lineno as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_znode),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ast_znode>())).node as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ast_znode),
            "::",
            stringify!(node)
        )
    );
}
pub type zend_ast_znode = _zend_ast_znode;
extern "C" {
    pub fn zend_ast_create_znode(node: *mut znode) -> *mut zend_ast;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_declarables {
    pub ticks: zend_long,
}
#[test]
fn bindgen_test_layout__zend_declarables() {
    assert_eq!(
        ::std::mem::size_of::<_zend_declarables>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_declarables))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_declarables>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_declarables))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_declarables>())).ticks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_declarables),
            "::",
            stringify!(ticks)
        )
    );
}
pub type zend_declarables = _zend_declarables;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_oparray_context {
    pub opcodes_size: u32,
    pub vars_size: ::std::os::raw::c_int,
    pub literals_size: ::std::os::raw::c_int,
    pub current_brk_cont: ::std::os::raw::c_int,
    pub backpatch_count: ::std::os::raw::c_int,
    pub in_finally: ::std::os::raw::c_int,
    pub fast_call_var: u32,
    pub labels: *mut HashTable,
}
#[test]
fn bindgen_test_layout__zend_oparray_context() {
    assert_eq!(
        ::std::mem::size_of::<_zend_oparray_context>(),
        40usize,
        concat!("Size of: ", stringify!(_zend_oparray_context))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_oparray_context>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_oparray_context))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).opcodes_size as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(opcodes_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_oparray_context>())).vars_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(vars_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).literals_size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(literals_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).current_brk_cont as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(current_brk_cont)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).backpatch_count as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(backpatch_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).in_finally as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(in_finally)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_oparray_context>())).fast_call_var as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(fast_call_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_oparray_context>())).labels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_oparray_context),
            "::",
            stringify!(labels)
        )
    );
}
pub type zend_oparray_context = _zend_oparray_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_file_context {
    pub declarables: zend_declarables,
    pub implementing_class: znode,
    pub current_namespace: *mut zend_string,
    pub in_namespace: zend_bool,
    pub has_bracketed_namespaces: zend_bool,
    pub imports: *mut HashTable,
    pub imports_function: *mut HashTable,
    pub imports_const: *mut HashTable,
}
#[test]
fn bindgen_test_layout__zend_file_context() {
    assert_eq!(
        ::std::mem::size_of::<_zend_file_context>(),
        72usize,
        concat!("Size of: ", stringify!(_zend_file_context))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_file_context>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_file_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_context>())).declarables as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(declarables)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_context>())).implementing_class as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(implementing_class)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_context>())).current_namespace as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(current_namespace)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_context>())).in_namespace as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(in_namespace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_context>())).has_bracketed_namespaces as *const _
                as usize
        },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(has_bracketed_namespaces)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_file_context>())).imports as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(imports)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_context>())).imports_function as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(imports_function)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_file_context>())).imports_const as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_file_context),
            "::",
            stringify!(imports_const)
        )
    );
}
pub type zend_file_context = _zend_file_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_parser_stack_elem {
    pub ast: *mut zend_ast,
    pub str_: *mut zend_string,
    pub num: zend_ulong,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__zend_parser_stack_elem() {
    assert_eq!(
        ::std::mem::size_of::<_zend_parser_stack_elem>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_parser_stack_elem))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_parser_stack_elem>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_parser_stack_elem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_parser_stack_elem>())).ast as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_parser_stack_elem),
            "::",
            stringify!(ast)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_parser_stack_elem>())).str_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_parser_stack_elem),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_parser_stack_elem>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_parser_stack_elem),
            "::",
            stringify!(num)
        )
    );
}
pub type zend_parser_stack_elem = _zend_parser_stack_elem;
extern "C" {
    pub fn zend_compile_top_stmt(ast: *mut zend_ast);
}
extern "C" {
    pub fn zend_compile_stmt(ast: *mut zend_ast);
}
extern "C" {
    pub fn zend_compile_expr(node: *mut znode, ast: *mut zend_ast);
}
extern "C" {
    pub fn zend_compile_var(node: *mut znode, ast: *mut zend_ast, type_: u32);
}
extern "C" {
    pub fn zend_eval_const_expr(ast_ptr: *mut *mut zend_ast);
}
extern "C" {
    pub fn zend_const_expr_to_zval(result: *mut zval, ast: *mut zend_ast);
}
pub type user_opcode_handler_t = ::std::option::Option<
    unsafe extern "C" fn(execute_data: *mut zend_execute_data) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_op {
    pub handler: *const ::std::os::raw::c_void,
    pub op1: znode_op,
    pub op2: znode_op,
    pub result: znode_op,
    pub extended_value: u32,
    pub lineno: u32,
    pub opcode: zend_uchar,
    pub op1_type: zend_uchar,
    pub op2_type: zend_uchar,
    pub result_type: zend_uchar,
}
#[test]
fn bindgen_test_layout__zend_op() {
    assert_eq!(
        ::std::mem::size_of::<_zend_op>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_op))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_op>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).handler as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).result as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).extended_value as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(extended_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).lineno as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(lineno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).opcode as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op1_type as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op1_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).op2_type as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(op2_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op>())).result_type as *const _ as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op),
            "::",
            stringify!(result_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_brk_cont_element {
    pub start: ::std::os::raw::c_int,
    pub cont: ::std::os::raw::c_int,
    pub brk: ::std::os::raw::c_int,
    pub parent: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_brk_cont_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_brk_cont_element>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_brk_cont_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_brk_cont_element>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_brk_cont_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).cont as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).brk as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(brk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_brk_cont_element>())).parent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_brk_cont_element),
            "::",
            stringify!(parent)
        )
    );
}
pub type zend_brk_cont_element = _zend_brk_cont_element;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_label {
    pub brk_cont: ::std::os::raw::c_int,
    pub opline_num: u32,
}
#[test]
fn bindgen_test_layout__zend_label() {
    assert_eq!(
        ::std::mem::size_of::<_zend_label>(),
        8usize,
        concat!("Size of: ", stringify!(_zend_label))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_label>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_label))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_label>())).brk_cont as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_label),
            "::",
            stringify!(brk_cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_label>())).opline_num as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_label),
            "::",
            stringify!(opline_num)
        )
    );
}
pub type zend_label = _zend_label;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_try_catch_element {
    pub try_op: u32,
    pub catch_op: u32,
    pub finally_op: u32,
    pub finally_end: u32,
}
#[test]
fn bindgen_test_layout__zend_try_catch_element() {
    assert_eq!(
        ::std::mem::size_of::<_zend_try_catch_element>(),
        16usize,
        concat!("Size of: ", stringify!(_zend_try_catch_element))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_try_catch_element>(),
        4usize,
        concat!("Alignment of ", stringify!(_zend_try_catch_element))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_try_catch_element>())).try_op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(try_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).catch_op as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(catch_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).finally_op as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(finally_op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_try_catch_element>())).finally_end as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_try_catch_element),
            "::",
            stringify!(finally_end)
        )
    );
}
pub type zend_try_catch_element = _zend_try_catch_element;
extern "C" {
    pub fn zend_visibility_string(fn_flags: u32) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_property_info {
    pub offset: u32,
    pub flags: u32,
    pub name: *mut zend_string,
    pub doc_comment: *mut zend_string,
    pub ce: *mut zend_class_entry,
}
#[test]
fn bindgen_test_layout__zend_property_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_property_info>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_property_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_property_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_property_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).doc_comment as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_property_info>())).ce as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_property_info),
            "::",
            stringify!(ce)
        )
    );
}
pub type zend_property_info = _zend_property_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_arg_info {
    pub name: *const ::std::os::raw::c_char,
    pub class_name: *const ::std::os::raw::c_char,
    pub type_hint: zend_uchar,
    pub pass_by_reference: zend_uchar,
    pub allow_null: zend_bool,
    pub is_variadic: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_internal_arg_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_internal_arg_info>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_internal_arg_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_internal_arg_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_internal_arg_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_arg_info>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_arg_info>())).class_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_arg_info>())).type_hint as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(type_hint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_arg_info>())).pass_by_reference as *const _
                as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(pass_by_reference)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_arg_info>())).allow_null as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(allow_null)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_arg_info>())).is_variadic as *const _ as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_arg_info),
            "::",
            stringify!(is_variadic)
        )
    );
}
pub type zend_internal_arg_info = _zend_internal_arg_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_arg_info {
    pub name: *mut zend_string,
    pub class_name: *mut zend_string,
    pub type_hint: zend_uchar,
    pub pass_by_reference: zend_uchar,
    pub allow_null: zend_bool,
    pub is_variadic: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_arg_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_arg_info>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_arg_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_arg_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_arg_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).class_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).type_hint as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(type_hint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_arg_info>())).pass_by_reference as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(pass_by_reference)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).allow_null as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(allow_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arg_info>())).is_variadic as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arg_info),
            "::",
            stringify!(is_variadic)
        )
    );
}
pub type zend_arg_info = _zend_arg_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function_info {
    pub required_num_args: zend_uintptr_t,
    pub class_name: *const ::std::os::raw::c_char,
    pub type_hint: zend_uchar,
    pub return_reference: zend_bool,
    pub allow_null: zend_bool,
    pub _is_variadic: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_internal_function_info() {
    assert_eq!(
        ::std::mem::size_of::<_zend_internal_function_info>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_internal_function_info))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_internal_function_info>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_internal_function_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).required_num_args as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).class_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).type_hint as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(type_hint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).return_reference as *const _
                as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(return_reference)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>())).allow_null as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(allow_null)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function_info>()))._is_variadic as *const _
                as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function_info),
            "::",
            stringify!(_is_variadic)
        )
    );
}
pub type zend_internal_function_info = _zend_internal_function_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_op_array {
    pub type_: zend_uchar,
    pub arg_flags: [zend_uchar; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_arg_info,
    pub refcount: *mut u32,
    pub this_var: u32,
    pub last: u32,
    pub opcodes: *mut zend_op,
    pub last_var: ::std::os::raw::c_int,
    pub T: u32,
    pub vars: *mut *mut zend_string,
    pub last_brk_cont: ::std::os::raw::c_int,
    pub last_try_catch: ::std::os::raw::c_int,
    pub brk_cont_array: *mut zend_brk_cont_element,
    pub try_catch_array: *mut zend_try_catch_element,
    pub static_variables: *mut HashTable,
    pub filename: *mut zend_string,
    pub line_start: u32,
    pub line_end: u32,
    pub doc_comment: *mut zend_string,
    pub early_binding: u32,
    pub last_literal: ::std::os::raw::c_int,
    pub literals: *mut zval,
    pub cache_size: ::std::os::raw::c_int,
    pub run_time_cache: *mut *mut ::std::os::raw::c_void,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout__zend_op_array() {
    assert_eq!(
        ::std::mem::size_of::<_zend_op_array>(),
        208usize,
        concat!("Size of: ", stringify!(_zend_op_array))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_op_array>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_op_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).arg_flags as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(arg_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).fn_flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).function_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).scope as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).prototype as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).num_args as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_op_array>())).required_num_args as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).arg_info as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(arg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).refcount as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).this_var as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(this_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).opcodes as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(opcodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_var as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).T as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(T)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).vars as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(vars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_brk_cont as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_brk_cont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_try_catch as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_try_catch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).brk_cont_array as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(brk_cont_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).try_catch_array as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(try_catch_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).static_variables as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(static_variables)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).filename as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).line_start as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(line_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).line_end as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(line_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).doc_comment as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).early_binding as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(early_binding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).last_literal as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(last_literal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).literals as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(literals)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).cache_size as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(cache_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).run_time_cache as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(run_time_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_op_array>())).reserved as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_op_array),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_internal_function {
    pub type_: zend_uchar,
    pub arg_flags: [zend_uchar; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_internal_arg_info,
    pub handler: ::std::option::Option<
        unsafe extern "C" fn(execute_data: *mut zend_execute_data, return_value: *mut zval),
    >,
    pub module: *mut _zend_module_entry,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout__zend_internal_function() {
    assert_eq!(
        ::std::mem::size_of::<_zend_internal_function>(),
        96usize,
        concat!("Size of: ", stringify!(_zend_internal_function))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_internal_function>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_internal_function))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).arg_flags as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(arg_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).fn_flags as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).function_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).scope as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).prototype as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).num_args as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).required_num_args as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).arg_info as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(arg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).handler as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_internal_function>())).module as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(module)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_internal_function>())).reserved as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_internal_function),
            "::",
            stringify!(reserved)
        )
    );
}
pub type zend_internal_function = _zend_internal_function;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _zend_function {
    pub type_: zend_uchar,
    pub common: _zend_function__bindgen_ty_1,
    pub op_array: zend_op_array,
    pub internal_function: zend_internal_function,
    _bindgen_union_align: [u64; 26usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_function__bindgen_ty_1 {
    pub type_: zend_uchar,
    pub arg_flags: [zend_uchar; 3usize],
    pub fn_flags: u32,
    pub function_name: *mut zend_string,
    pub scope: *mut zend_class_entry,
    pub prototype: *mut _zend_function,
    pub num_args: u32,
    pub required_num_args: u32,
    pub arg_info: *mut zend_arg_info,
}
#[test]
fn bindgen_test_layout__zend_function__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(_zend_function__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).arg_flags as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(arg_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).fn_flags as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(fn_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).function_name as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(function_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).scope as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).prototype as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(prototype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).num_args as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).required_num_args as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(required_num_args)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function__bindgen_ty_1>())).arg_info as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function__bindgen_ty_1),
            "::",
            stringify!(arg_info)
        )
    );
}
#[test]
fn bindgen_test_layout__zend_function() {
    assert_eq!(
        ::std::mem::size_of::<_zend_function>(),
        208usize,
        concat!("Size of: ", stringify!(_zend_function))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_function>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_function))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).common as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(common)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_function>())).op_array as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(op_array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_function>())).internal_function as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_function),
            "::",
            stringify!(internal_function)
        )
    );
}
pub const _zend_call_kind_ZEND_CALL_NESTED_FUNCTION: _zend_call_kind = 0;
pub const _zend_call_kind_ZEND_CALL_NESTED_CODE: _zend_call_kind = 1;
pub const _zend_call_kind_ZEND_CALL_TOP_FUNCTION: _zend_call_kind = 2;
pub const _zend_call_kind_ZEND_CALL_TOP_CODE: _zend_call_kind = 3;
pub type _zend_call_kind = ::std::os::raw::c_uint;
pub use self::_zend_call_kind as zend_call_kind;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_execute_data {
    pub opline: *const zend_op,
    pub call: *mut zend_execute_data,
    pub return_value: *mut zval,
    pub func: *mut zend_function,
    pub This: zval,
    pub called_scope: *mut zend_class_entry,
    pub prev_execute_data: *mut zend_execute_data,
    pub symbol_table: *mut zend_array,
    pub run_time_cache: *mut *mut ::std::os::raw::c_void,
    pub literals: *mut zval,
}
#[test]
fn bindgen_test_layout__zend_execute_data() {
    assert_eq!(
        ::std::mem::size_of::<_zend_execute_data>(),
        88usize,
        concat!("Size of: ", stringify!(_zend_execute_data))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_execute_data>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_execute_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).opline as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(opline)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).call as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).return_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(return_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).func as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).This as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(This)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).called_scope as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(called_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).prev_execute_data as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(prev_execute_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).symbol_table as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(symbol_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_execute_data>())).run_time_cache as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(run_time_cache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_execute_data>())).literals as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_execute_data),
            "::",
            stringify!(literals)
        )
    );
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[test]
fn bindgen_test_layout___jmp_buf_tag() {
    assert_eq!(
        ::std::mem::size_of::<__jmp_buf_tag>(),
        200usize,
        concat!("Size of: ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__jmp_buf_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__jmpbuf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__jmpbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__mask_was_saved as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__jmp_buf_tag>())).__saved_mask as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__saved_mask)
        )
    );
}
pub type jmp_buf = [__jmp_buf_tag; 1usize];
pub type zend_compiler_globals = _zend_compiler_globals;
pub type zend_executor_globals = _zend_executor_globals;
pub type zend_php_scanner_globals = _zend_php_scanner_globals;
pub type zend_ini_scanner_globals = _zend_ini_scanner_globals;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_compiler_globals {
    pub loop_var_stack: zend_stack,
    pub active_class_entry: *mut zend_class_entry,
    pub compiled_filename: *mut zend_string,
    pub zend_lineno: ::std::os::raw::c_int,
    pub active_op_array: *mut zend_op_array,
    pub function_table: *mut HashTable,
    pub class_table: *mut HashTable,
    pub filenames_table: HashTable,
    pub auto_globals: *mut HashTable,
    pub parse_error: zend_bool,
    pub in_compilation: zend_bool,
    pub short_tags: zend_bool,
    pub unclean_shutdown: zend_bool,
    pub ini_parser_unbuffered_errors: zend_bool,
    pub open_files: zend_llist,
    pub ini_parser_param: *mut _zend_ini_parser_param,
    pub start_lineno: u32,
    pub increment_lineno: zend_bool,
    pub doc_comment: *mut zend_string,
    pub compiler_options: u32,
    pub const_filenames: HashTable,
    pub context: zend_oparray_context,
    pub file_context: zend_file_context,
    pub arena: *mut zend_arena,
    pub empty_string: *mut zend_string,
    pub one_char_string: [*mut zend_string; 256usize],
    pub interned_strings: HashTable,
    pub script_encoding_list: *mut *const zend_encoding,
    pub script_encoding_list_size: size_t,
    pub multibyte: zend_bool,
    pub detect_unicode: zend_bool,
    pub encoding_declared: zend_bool,
    pub ast: *mut zend_ast,
    pub ast_arena: *mut zend_arena,
    pub delayed_oplines_stack: zend_stack,
}
#[test]
fn bindgen_test_layout__zend_compiler_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_compiler_globals>(),
        2584usize,
        concat!("Size of: ", stringify!(_zend_compiler_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_compiler_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_compiler_globals))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).loop_var_stack as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(loop_var_stack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).active_class_entry as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(active_class_entry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).compiled_filename as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(compiled_filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).zend_lineno as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(zend_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).active_op_array as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(active_op_array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).function_table as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(function_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).class_table as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(class_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).filenames_table as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(filenames_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).auto_globals as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(auto_globals)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).parse_error as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(parse_error)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).in_compilation as *const _ as usize
        },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(in_compilation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).short_tags as *const _ as usize
        },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(short_tags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).unclean_shutdown as *const _ as usize
        },
        139usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(unclean_shutdown)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).ini_parser_unbuffered_errors
                as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ini_parser_unbuffered_errors)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).open_files as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(open_files)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).ini_parser_param as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ini_parser_param)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).start_lineno as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(start_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).increment_lineno as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(increment_lineno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).doc_comment as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(doc_comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).compiler_options as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(compiler_options)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).const_filenames as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(const_filenames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).context as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).file_context as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(file_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).arena as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(arena)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).empty_string as *const _ as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(empty_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).one_char_string as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(one_char_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).interned_strings as *const _ as usize
        },
        2464usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(interned_strings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).script_encoding_list as *const _
                as usize
        },
        2520usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(script_encoding_list)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).script_encoding_list_size as *const _
                as usize
        },
        2528usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(script_encoding_list_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).multibyte as *const _ as usize
        },
        2536usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(multibyte)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).detect_unicode as *const _ as usize
        },
        2537usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(detect_unicode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).encoding_declared as *const _
                as usize
        },
        2538usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(encoding_declared)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_compiler_globals>())).ast as *const _ as usize },
        2544usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ast)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).ast_arena as *const _ as usize
        },
        2552usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(ast_arena)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_compiler_globals>())).delayed_oplines_stack as *const _
                as usize
        },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_compiler_globals),
            "::",
            stringify!(delayed_oplines_stack)
        )
    );
}
extern "C" {
    pub static mut compiler_globals: _zend_compiler_globals;
}
extern "C" {
    pub fn zendparse() -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut executor_globals: zend_executor_globals;
}
extern "C" {
    pub static mut language_scanner_globals: zend_php_scanner_globals;
}
extern "C" {
    pub static mut ini_scanner_globals: zend_ini_scanner_globals;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_stack {
    pub size: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__zend_stack() {
    assert_eq!(
        ::std::mem::size_of::<_zend_stack>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_stack))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_stack>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_stack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).max as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_stack>())).elements as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_stack),
            "::",
            stringify!(elements)
        )
    );
}
pub type zend_stack = _zend_stack;
extern "C" {
    pub fn zend_stack_init(
        stack: *mut zend_stack,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_push(
        stack: *mut zend_stack,
        element: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_top(stack: *const zend_stack) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_stack_del_top(stack: *mut zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_int_top(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_is_empty(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_destroy(stack: *mut zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_base(stack: *const zend_stack) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn zend_stack_count(stack: *const zend_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_stack_apply(
        stack: *mut zend_stack,
        type_: ::std::os::raw::c_int,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(element: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn zend_stack_apply_with_argument(
        stack: *mut zend_stack,
        type_: ::std::os::raw::c_int,
        apply_function: ::std::option::Option<
            unsafe extern "C" fn(
                element: *mut ::std::os::raw::c_void,
                arg: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn zend_stack_clean(
        stack: *mut zend_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        free_elements: zend_bool,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_ptr_stack {
    pub top: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub elements: *mut *mut ::std::os::raw::c_void,
    pub top_element: *mut *mut ::std::os::raw::c_void,
    pub persistent: zend_bool,
}
#[test]
fn bindgen_test_layout__zend_ptr_stack() {
    assert_eq!(
        ::std::mem::size_of::<_zend_ptr_stack>(),
        32usize,
        concat!("Size of: ", stringify!(_zend_ptr_stack))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_ptr_stack>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_ptr_stack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).max as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).elements as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).top_element as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(top_element)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_ptr_stack>())).persistent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_ptr_stack),
            "::",
            stringify!(persistent)
        )
    );
}
pub type zend_ptr_stack = _zend_ptr_stack;
extern "C" {
    pub fn zend_ptr_stack_init(stack: *mut zend_ptr_stack);
}
extern "C" {
    pub fn zend_ptr_stack_init_ex(stack: *mut zend_ptr_stack, persistent: zend_bool);
}
extern "C" {
    pub fn zend_ptr_stack_n_push(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
extern "C" {
    pub fn zend_ptr_stack_n_pop(stack: *mut zend_ptr_stack, count: ::std::os::raw::c_int, ...);
}
extern "C" {
    pub fn zend_ptr_stack_destroy(stack: *mut zend_ptr_stack);
}
extern "C" {
    pub fn zend_ptr_stack_apply(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
extern "C" {
    pub fn zend_ptr_stack_clean(
        stack: *mut zend_ptr_stack,
        func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        free_elements: zend_bool,
    );
}
extern "C" {
    pub fn zend_ptr_stack_num_elements(stack: *mut zend_ptr_stack) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_object_std_init(object: *mut zend_object, ce: *mut zend_class_entry);
}
extern "C" {
    pub fn zend_object_std_dtor(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_new(ce: *mut zend_class_entry) -> *mut zend_object;
}
extern "C" {
    pub fn zend_objects_destroy_object(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_clone_members(new_object: *mut zend_object, old_object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_clone_obj(object: *mut zval) -> *mut zend_object;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_objects_store {
    pub object_buckets: *mut *mut zend_object,
    pub top: u32,
    pub size: u32,
    pub free_list_head: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__zend_objects_store() {
    assert_eq!(
        ::std::mem::size_of::<_zend_objects_store>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_objects_store))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_objects_store>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_objects_store))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_objects_store>())).object_buckets as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(object_buckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_objects_store>())).top as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_objects_store>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_objects_store>())).free_list_head as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_objects_store),
            "::",
            stringify!(free_list_head)
        )
    );
}
pub type zend_objects_store = _zend_objects_store;
extern "C" {
    pub fn zend_objects_store_init(objects: *mut zend_objects_store, init_size: u32);
}
extern "C" {
    pub fn zend_objects_store_call_destructors(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_mark_destructed(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_destroy(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_objects_store_put(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_store_del(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_store_free(object: *mut zend_object);
}
extern "C" {
    pub fn zend_object_store_set_object(zobject: *mut zval, object: *mut zend_object);
}
extern "C" {
    pub fn zend_object_store_ctor_failed(object: *mut zend_object);
}
extern "C" {
    pub fn zend_objects_store_free_object_storage(objects: *mut zend_objects_store);
}
extern "C" {
    pub fn zend_object_create_proxy(object: *mut zval, member: *mut zval) -> *mut zend_object;
}
extern "C" {
    pub fn zend_get_std_object_handlers() -> *mut zend_object_handlers;
}
extern "C" {
    pub fn zend_init_fpu();
}
extern "C" {
    pub fn zend_shutdown_fpu();
}
extern "C" {
    pub fn zend_ensure_fpu_mode();
}
pub type fpu_control_t = ::std::os::raw::c_ushort;
extern "C" {
    pub static mut __fpu_control: fpu_control_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_encoding {
    _unused: [u8; 0],
}
pub type zend_encoding = _zend_encoding;
pub type zend_encoding_filter = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *mut *mut ::std::os::raw::c_uchar,
        str_length: *mut size_t,
        buf: *const ::std::os::raw::c_uchar,
        length: size_t,
    ) -> size_t,
>;
pub type zend_encoding_fetcher = ::std::option::Option<
    unsafe extern "C" fn(encoding_name: *const ::std::os::raw::c_char) -> *const zend_encoding,
>;
pub type zend_encoding_name_getter = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> *const ::std::os::raw::c_char,
>;
pub type zend_encoding_lexer_compatibility_checker = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> ::std::os::raw::c_int,
>;
pub type zend_encoding_detector = ::std::option::Option<
    unsafe extern "C" fn(
        string: *const ::std::os::raw::c_uchar,
        length: size_t,
        list: *mut *const zend_encoding,
        list_size: size_t,
    ) -> *const zend_encoding,
>;
pub type zend_encoding_converter = ::std::option::Option<
    unsafe extern "C" fn(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut size_t,
        from: *const ::std::os::raw::c_uchar,
        from_length: size_t,
        encoding_to: *const zend_encoding,
        encoding_from: *const zend_encoding,
    ) -> size_t,
>;
pub type zend_encoding_list_parser = ::std::option::Option<
    unsafe extern "C" fn(
        encoding_list: *const ::std::os::raw::c_char,
        encoding_list_len: size_t,
        return_list: *mut *mut *const zend_encoding,
        return_size: *mut size_t,
        persistent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type zend_encoding_internal_encoding_getter =
    ::std::option::Option<unsafe extern "C" fn() -> *const zend_encoding>;
pub type zend_encoding_internal_encoding_setter = ::std::option::Option<
    unsafe extern "C" fn(encoding: *const zend_encoding) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_multibyte_functions {
    pub provider_name: *const ::std::os::raw::c_char,
    pub encoding_fetcher: zend_encoding_fetcher,
    pub encoding_name_getter: zend_encoding_name_getter,
    pub lexer_compatibility_checker: zend_encoding_lexer_compatibility_checker,
    pub encoding_detector: zend_encoding_detector,
    pub encoding_converter: zend_encoding_converter,
    pub encoding_list_parser: zend_encoding_list_parser,
    pub internal_encoding_getter: zend_encoding_internal_encoding_getter,
    pub internal_encoding_setter: zend_encoding_internal_encoding_setter,
}
#[test]
fn bindgen_test_layout__zend_multibyte_functions() {
    assert_eq!(
        ::std::mem::size_of::<_zend_multibyte_functions>(),
        72usize,
        concat!("Size of: ", stringify!(_zend_multibyte_functions))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_multibyte_functions>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_multibyte_functions))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).provider_name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(provider_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_fetcher as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_fetcher)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_name_getter as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_name_getter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).lexer_compatibility_checker
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(lexer_compatibility_checker)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_detector as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_detector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_converter as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_converter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).encoding_list_parser as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(encoding_list_parser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).internal_encoding_getter
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(internal_encoding_getter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_multibyte_functions>())).internal_encoding_setter
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_multibyte_functions),
            "::",
            stringify!(internal_encoding_setter)
        )
    );
}
pub type zend_multibyte_functions = _zend_multibyte_functions;
extern "C" {
    pub static mut zend_multibyte_encoding_utf32be: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf32le: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf16be: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf16le: *const zend_encoding;
}
extern "C" {
    pub static mut zend_multibyte_encoding_utf8: *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_set_functions(
        functions: *const zend_multibyte_functions,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_get_functions() -> *const zend_multibyte_functions;
}
extern "C" {
    pub fn zend_multibyte_fetch_encoding(
        name: *const ::std::os::raw::c_char,
    ) -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_get_encoding_name(
        encoding: *const zend_encoding,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn zend_multibyte_check_lexer_compatibility(
        encoding: *const zend_encoding,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_encoding_detector(
        string: *const ::std::os::raw::c_uchar,
        length: size_t,
        list: *mut *const zend_encoding,
        list_size: size_t,
    ) -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_encoding_converter(
        to: *mut *mut ::std::os::raw::c_uchar,
        to_length: *mut size_t,
        from: *const ::std::os::raw::c_uchar,
        from_length: size_t,
        encoding_to: *const zend_encoding,
        encoding_from: *const zend_encoding,
    ) -> size_t;
}
extern "C" {
    pub fn zend_multibyte_parse_encoding_list(
        encoding_list: *const ::std::os::raw::c_char,
        encoding_list_len: size_t,
        return_list: *mut *mut *const zend_encoding,
        return_size: *mut size_t,
        persistent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_get_internal_encoding() -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_get_script_encoding() -> *const zend_encoding;
}
extern "C" {
    pub fn zend_multibyte_set_script_encoding(
        encoding_list: *mut *const zend_encoding,
        encoding_list_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_set_internal_encoding(
        encoding: *const zend_encoding,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zend_multibyte_set_script_encoding_by_string(
        new_value: *const ::std::os::raw::c_char,
        new_value_length: size_t,
    ) -> ::std::os::raw::c_int;
}
pub type zend_arena = _zend_arena;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _zend_arena {
    pub ptr: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
    pub prev: *mut zend_arena,
}
#[test]
fn bindgen_test_layout__zend_arena() {
    assert_eq!(
        ::std::mem::size_of::<_zend_arena>(),
        24usize,
        concat!("Size of: ", stringify!(_zend_arena))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_arena>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_arena))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arena>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arena),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arena>())).end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arena),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_zend_arena>())).prev as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_arena),
            "::",
            stringify!(prev)
        )
    );
}
pub type zend_vm_stack = *mut _zend_vm_stack;
pub type zend_ini_entry = _zend_ini_entry;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _zend_executor_globals {
    pub uninitialized_zval: zval,
    pub error_zval: zval,
    pub symtable_cache: [*mut zend_array; 32usize],
    pub symtable_cache_limit: *mut *mut zend_array,
    pub symtable_cache_ptr: *mut *mut zend_array,
    pub symbol_table: zend_array,
    pub included_files: HashTable,
    pub bailout: *mut jmp_buf,
    pub error_reporting: ::std::os::raw::c_int,
    pub exit_status: ::std::os::raw::c_int,
    pub function_table: *mut HashTable,
    pub class_table: *mut HashTable,
    pub zend_constants: *mut HashTable,
    pub vm_stack_top: *mut zval,
    pub vm_stack_end: *mut zval,
    pub vm_stack: zend_vm_stack,
    pub current_execute_data: *mut _zend_execute_data,
    pub scope: *mut zend_class_entry,
    pub precision: zend_long,
    pub ticks_count: ::std::os::raw::c_int,
    pub in_autoload: *mut HashTable,
    pub autoload_func: *mut zend_function,
    pub full_tables_cleanup: zend_bool,
    pub no_extensions: zend_bool,
    pub regular_list: HashTable,
    pub persistent_list: HashTable,
    pub user_error_handler_error_reporting: ::std::os::raw::c_int,
    pub user_error_handler: zval,
    pub user_exception_handler: zval,
    pub user_error_handlers_error_reporting: zend_stack,
    pub user_error_handlers: zend_stack,
    pub user_exception_handlers: zend_stack,
    pub error_handling: zend_error_handling_t,
    pub exception_class: *mut zend_class_entry,
    pub timeout_seconds: zend_long,
    pub lambda_count: ::std::os::raw::c_int,
    pub ini_directives: *mut HashTable,
    pub modified_ini_directives: *mut HashTable,
    pub error_reporting_ini_entry: *mut zend_ini_entry,
    pub objects_store: zend_objects_store,
    pub exception: *mut zend_object,
    pub prev_exception: *mut zend_object,
    pub opline_before_exception: *const zend_op,
    pub exception_op: [zend_op; 3usize],
    pub current_module: *mut _zend_module_entry,
    pub active: zend_bool,
    pub valid_symbol_table: zend_bool,
    pub assertions: zend_long,
    pub ht_iterators_count: u32,
    pub ht_iterators_used: u32,
    pub ht_iterators: *mut HashTableIterator,
    pub ht_iterators_slots: [HashTableIterator; 16usize],
    pub saved_fpu_cw_ptr: *mut ::std::os::raw::c_void,
    pub saved_fpu_cw: fpu_control_t,
    pub trampoline: zend_function,
    pub call_trampoline_op: zend_op,
    pub reserved: [*mut ::std::os::raw::c_void; 4usize],
}
#[test]
fn bindgen_test_layout__zend_executor_globals() {
    assert_eq!(
        ::std::mem::size_of::<_zend_executor_globals>(),
        1544usize,
        concat!("Size of: ", stringify!(_zend_executor_globals))
    );
    assert_eq!(
        ::std::mem::align_of::<_zend_executor_globals>(),
        8usize,
        concat!("Alignment of ", stringify!(_zend_executor_globals))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_executor_globals>())).uninitialized_zval as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_zend_executor_globals),
            "::",
            stringify!(uninitialized_zval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_zend_executor_globals>())).error_zval as *const _ as usize
        },
        16usize,
        concat!(
